//@ sourceURL=barrierfree.js
//Version：2.4.16
// 取消shift+tab的事件
$(document).on('keyup', function(e) {
  if(e.shiftKey&&(e.key == 'Tab')){
    return false
  }
}).on('keydown', function(e) {
  if(e.shiftKey&&(e.key === 'Tab')){
    return false
  }
})
var BarrierFreeConfig;
// 全局对象
var INSTANCE = new Object();
/*************配置************/
function declareConfig() {
  var jsPath = $('#barrierfree').attr('src');
  jsPath = jsPath.substr(0, jsPath.lastIndexOf('/') + 1);
  BarrierFreeConfig = new Object();
  BarrierFreeConfig.contextPath = jsPath;
  //  用来判断 切换颜色 是 点击事件 触发 还是键盘触发 0 代表点击触发
  BarrierFreeConfig.UpDownKey = 0
// 需要外链提示1,0不需要外链提示
  BarrierFreeConfig.outlinkTip = 1
  //定义网页body里面最外层DIV ID
  BarrierFreeConfig.mainBox = "barrierfree_container";
  //无障碍操作说明链接地址
  BarrierFreeConfig.barrierfreeHelp = jsPath + "wza_help.html";
  // 以下是网页区域标识，快捷键导航时使用
  //网站地图区ID
  BarrierFreeConfig.SiteMap = 'sitemap';
  BarrierFreeConfig.SiteMapTitle = "已跳转到网站地图区";

  //搜索区ID
  BarrierFreeConfig.SearchForm = 'search';
  BarrierFreeConfig.SearchFormTitle = "已跳转到搜索区域";

  //头部内容区ID
  BarrierFreeConfig.HeadContent = 'header';
  BarrierFreeConfig.HeadContentTitle = "已跳转到头部内容区域";

  //底部内容区ID
  BarrierFreeConfig.BottomContent = 'footer';
  BarrierFreeConfig.BottomContentTitle = "已跳转到底部内容区域";

  //网页左栏区ID
  BarrierFreeConfig.LeftContent = 'leftSidebar';
  BarrierFreeConfig.LeftContentTitle = "已跳转网页左栏区域";

  //网页中间区ID
  BarrierFreeConfig.MiddleContent = 'centerBox';
  BarrierFreeConfig.MiddleContentTitle = "已跳转到中间结构区域";

  //网页右栏区ID
  BarrierFreeConfig.RightContent = 'rightSidebar';
  BarrierFreeConfig.RightContentTitle = "已跳转到网页右栏区域";


  //栏目分组标记 H2 或 H3 或 H4
  BarrierFreeConfig.GroupTagNameH2 = 'H2';
  BarrierFreeConfig.GroupTagNameH3 = 'H3';
  BarrierFreeConfig.GroupTagNameH4 = 'H4';

  //导航区标记ergodic="navigation"
  BarrierFreeConfig.navigationArea = 'navigation';
  BarrierFreeConfig.navigationAreaTitle = "导航区"

  //视窗区标记ergodic="view"
  BarrierFreeConfig.viewArea = 'view';
  BarrierFreeConfig.viewAreaTitle = "视窗区"

  //服务区标记ergodic="serve"
  BarrierFreeConfig.serveArea = 'serve';
  BarrierFreeConfig.serveAreaTitle = '服务区';

  //正文区标记ergodic="article"
  BarrierFreeConfig.articleArea = 'article';
  BarrierFreeConfig.articleAreaTitle = '正文区';


  //图文模式工具样式
  BarrierFreeConfig.HtmlToolCssUrl = jsPath + 'css/barrierfree.css';
  //文本模式工具样式
  //BarrierFreeConfig.TextToolCssUrl = serverUrl + 'barrierfree_tool_style.css';

  //文本模式页面样式
  BarrierFreeConfig.TextModeCssUrl = jsPath + 'css/barrierfree_style.css';

  //排除
  BarrierFreeConfig.exclude = '[readexclude]';

  BarrierFreeConfig.readerTags = 'option,a,span,p,img,h1,h2,h3,h4,h5,h6,button,textarea,input[type = button],input[type = checkbox],input[type = file],input[type = image],input[type = radio],input[type = reset],input[type = text],input[type = password],input[type = submit],[readlabel]'; //本页面语音阅读标签
  BarrierFreeConfig.readerSentences = new Array();
  BarrierFreeConfig.readerComplate = function () {
    if (BarrierFreeConfig.readerSentences.length > 0) {
      var text = BarrierFreeConfig.readerSentences.shift();
      BarrierFreeConfig.reader.read(text);
    }
  };
  BarrierFreeConfig.reader = new EasyReader({
    speed: "low",
    playerPath: jsPath + "js/",
    TTSUrl: 'https://tts.hanweb.com/txt_to_voice/' // 语音服务线上地址
  }, BarrierFreeConfig.readerComplate);
}

/*****************拼音**********************/
pinyin = {
  "1": "yī",
  "2": "èr",
  "3": "sān",
  "4": "sì",
  "5": "wǔ",
  "6": "liù",
  "7": "qī",
  "8": "bā",
  "9": "jiǔ",
  "0": "líng",
  "啊": "ā",
  "阿": "ā",
  "埃": "āi",
  "挨": "āi",
  "哎": "āi",
  "唉": "āi",
  "哀": "āi",
  "皑": "ái",
  "癌": "ái",
  "蔼": "ǎi",
  "矮": "ǎi",
  "艾": "ài",
  "碍": "ài",
  "爱": "ài",
  "隘": "ài",
  "鞍": "ān",
  "氨": "ān",
  "安": "ān",
  "俺": "ǎn",
  "按": "àn",
  "暗": "àn",
  "岸": "àn",
  "胺": "àn",
  "案": "àn",
  "肮": "āng",
  "昂": "áng",
  "盎": "àng",
  "凹": "āo",
  "敖": "áo",
  "熬": "áo",
  "翱": "áo",
  "袄": "ǎo",
  "傲": "ào",
  "奥": "ào",
  "懊": "ào",
  "澳": "ào",
  "芭": "bā",
  "捌": "bā",
  "扒": "bā",
  "叭": "bā",
  "吧": "bā",
  "笆": "bā",
  "八": "bā",
  "疤": "bā",
  "巴": "bā",
  "拔": "bá",
  "跋": "bá",
  "靶": "bǎ",
  "把": "bǎ",
  "耙": "pá",
  "坝": "bà",
  "霸": "bà",
  "罢": "bà",
  "爸": "bà",
  "白": "bái",
  "柏": "bǎi",
  "百": "bǎi",
  "摆": "bǎi",
  "佰": "bǎi",
  "败": "bài",
  "拜": "bài",
  "稗": "bài",
  "斑": "bān",
  "班": "bān",
  "搬": "bān",
  "扳": "bān",
  "般": "bān",
  "颁": "bān",
  "板": "bǎn",
  "版": "bǎn",
  "扮": "bàn",
  "拌": "bàn",
  "伴": "bàn",
  "瓣": "bàn",
  "半": "bàn",
  "办": "bàn",
  "绊": "bàn",
  "邦": "bāng",
  "帮": "bāng",
  "梆": "bāng",
  "榜": "bǎng",
  "膀": "bǎng",
  "绑": "bǎng",
  "棒": "bàng",
  "磅": "páng",
  "蚌": "bàng",
  "镑": "bàng",
  "傍": "bàng",
  "谤": "bàng",
  "苞": "bāo",
  "胞": "bāo",
  "包": "bāo",
  "褒": "bāo",
  "剥": "bāo",
  "薄": "báo",
  "雹": "báo",
  "保": "bǎo",
  "堡": "bǎo",
  "饱": "bǎo",
  "宝": "bǎo",
  "抱": "bào",
  "报": "bào",
  "暴": "bào",
  "豹": "bào",
  "鲍": "bào",
  "爆": "bào",
  "杯": "bēi",
  "碑": "bēi",
  "悲": "bēi",
  "卑": "bēi",
  "北": "běi",
  "辈": "bèi",
  "背": "bèi",
  "贝": "bèi",
  "钡": "bèi",
  "倍": "bèi",
  "狈": "bèi",
  "备": "bèi",
  "惫": "bèi",
  "焙": "bèi",
  "被": "bèi",
  "奔": "bēn",
  "苯": "běn",
  "本": "běn",
  "笨": "bèn",
  "崩": "bēng",
  "绷": "bēng",
  "甭": "béng",
  "泵": "bèng",
  "蹦": "bèng",
  "迸": "bèng",
  "逼": "bī",
  "鼻": "bí",
  "比": "bǐ",
  "鄙": "bǐ",
  "笔": "bǐ",
  "彼": "bǐ",
  "碧": "bì",
  "蓖": "bì",
  "蔽": "bì",
  "毕": "bì",
  "毙": "bì",
  "毖": "bì",
  "币": "bì",
  "庇": "bì",
  "痹": "bì",
  "闭": "bì",
  "敝": "bì",
  "弊": "bì",
  "必": "bì",
  "辟": "pì",
  "壁": "bì",
  "臂": "bì",
  "避": "bì",
  "陛": "bì",
  "鞭": "biān",
  "边": "biān",
  "编": "biān",
  "贬": "biǎn",
  "扁": "biǎn",
  "便": "biàn",
  "变": "biàn",
  "卞": "biàn",
  "辨": "biàn",
  "辩": "biàn",
  "辫": "biàn",
  "遍": "biàn",
  "标": "biāo",
  "彪": "biāo",
  "膘": "biāo",
  "表": "biǎo",
  "鳖": "biē",
  "憋": "biē",
  "别": "bié",
  "瘪": "biě",
  "彬": "bīn",
  "斌": "bīn",
  "濒": "bīn",
  "滨": "bīn",
  "宾": "bīn",
  "摈": "bìn",
  "兵": "bīng",
  "冰": "bīng",
  "柄": "bǐng",
  "丙": "bǐng",
  "秉": "bǐng",
  "饼": "bǐng",
  "炳": "bǐng",
  "病": "bìng",
  "并": "bìng",
  "玻": "bō",
  "菠": "bō",
  "播": "bō",
  "拨": "bō",
  "钵": "bō",
  "波": "bō",
  "博": "bó",
  "勃": "bó",
  "搏": "bó",
  "铂": "bó",
  "箔": "bó",
  "伯": "bó",
  "帛": "bó",
  "舶": "bó",
  "脖": "bó",
  "膊": "bó",
  "渤": "bó",
  "泊": "bó",
  "驳": "bó",
  "捕": "bǔ",
  "卜": "bo",
  "哺": "bǔ",
  "补": "bǔ",
  "埠": "bù",
  "不": "bù",
  "布": "bù",
  "步": "bù",
  "簿": "bù",
  "部": "bù",
  "怖": "bù",
  "擦": "cā",
  "猜": "cāi",
  "裁": "cái",
  "材": "cái",
  "才": "cái",
  "财": "cái",
  "睬": "cǎi",
  "踩": "cǎi",
  "采": "cǎi",
  "彩": "cǎi",
  "菜": "cài",
  "蔡": "cài",
  "餐": "cān",
  "参": "cān",
  "蚕": "cán",
  "残": "cán",
  "惭": "cán",
  "惨": "cǎn",
  "灿": "càn",
  "苍": "cāng",
  "舱": "cāng",
  "仓": "cāng",
  "沧": "cāng",
  "藏": "cáng",
  "操": "cāo",
  "糙": "cāo",
  "槽": "cáo",
  "曹": "cáo",
  "草": "cǎo",
  "厕": "cè",
  "策": "cè",
  "侧": "cè",
  "册": "cè",
  "测": "cè",
  "层": "céng",
  "蹭": "cèng",
  "插": "chā",
  "叉": "chā",
  "茬": "chá",
  "茶": "chá",
  "查": "chá",
  "碴": "chá",
  "搽": "chá",
  "察": "chá",
  "岔": "chà",
  "差": "chà",
  "诧": "chà",
  "拆": "chāi",
  "柴": "chái",
  "豺": "chái",
  "搀": "chān",
  "掺": "chān",
  "蝉": "chán",
  "馋": "chán",
  "谗": "chán",
  "缠": "chán",
  "铲": "chǎn",
  "产": "chǎn",
  "阐": "chǎn",
  "颤": "chàn",
  "昌": "chāng",
  "猖": "chāng",
  "场": "chǎng",
  "尝": "cháng",
  "常": "cháng",
  "长": "cháng",
  "偿": "cháng",
  "肠": "cháng",
  "厂": "chǎng",
  "敞": "chǎng",
  "畅": "chàng",
  "唱": "chàng",
  "倡": "chàng",
  "超": "chāo",
  "抄": "chāo",
  "钞": "chāo",
  "朝": "cháo",
  "嘲": "cháo",
  "潮": "cháo",
  "巢": "cháo",
  "吵": "chǎo",
  "炒": "chǎo",
  "车": "chē",
  "扯": "chě",
  "撤": "chè",
  "掣": "chè",
  "彻": "chè",
  "澈": "chè",
  "郴": "chēn",
  "臣": "chén",
  "辰": "chén",
  "尘": "chén",
  "晨": "chén",
  "忱": "chén",
  "沉": "chén",
  "陈": "chén",
  "趁": "chèn",
  "衬": "chèn",
  "撑": "chēng",
  "称": "chēng",
  "城": "chéng",
  "橙": "chéng",
  "成": "chéng",
  "呈": "chéng",
  "乘": "chéng",
  "程": "chéng",
  "惩": "chéng",
  "澄": "chéng",
  "诚": "chéng",
  "承": "chéng",
  "逞": "chěng",
  "骋": "chěng",
  "秤": "chèng",
  "吃": "chī",
  "痴": "chī",
  "持": "chí",
  "匙": "chí",
  "池": "shi",
  "迟": "chí",
  "弛": "chí",
  "驰": "chí",
  "耻": "chǐ",
  "齿": "chǐ",
  "侈": "chǐ",
  "尺": "chǐ",
  "赤": "chì",
  "翅": "chì",
  "斥": "chì",
  "炽": "chì",
  "充": "chōng",
  "冲": "chōng",
  "虫": "chóng",
  "崇": "chóng",
  "宠": "chǒng",
  "抽": "chōu",
  "酬": "chóu",
  "畴": "chóu",
  "踌": "chóu",
  "稠": "chóu",
  "愁": "chóu",
  "筹": "chóu",
  "仇": "chóu",
  "绸": "chóu",
  "瞅": "chǒu",
  "丑": "chǒu",
  "臭": "chòu",
  "初": "chū",
  "出": "chū",
  "橱": "chú",
  "厨": "chú",
  "躇": "chú",
  "锄": "chú",
  "雏": "chú",
  "滁": "chú",
  "除": "chú",
  "楚": "chǔ",
  "础": "chǔ",
  "储": "chǔ",
  "矗": "chù",
  "搐": "chù",
  "触": "chù",
  "处": "chǔ",
  "揣": "chuāi",
  "川": "chuān",
  "穿": "chuān",
  "椽": "chuán",
  "传": "chuán",
  "船": "chuán",
  "喘": "chuǎn",
  "串": "chuàn",
  "疮": "chuāng",
  "窗": "chuāng",
  "幢": "zhuàng",
  "床": "chuáng",
  "闯": "chuǎng",
  "创": "chuàng",
  "吹": "chuí",
  "炊": "chuī",
  "捶": "chuī",
  "锤": "chuí",
  "垂": "chuí",
  "春": "chūn",
  "椿": "chūn",
  "醇": "chún",
  "唇": "chún",
  "淳": "chún",
  "纯": "chún",
  "蠢": "chǔn",
  "戳": "chuō",
  "踔": "chuō",
  "绰": "chuō",
  "疵": "cī",
  "茨": "cí",
  "磁": "cí",
  "雌": "cí",
  "辞": "cí",
  "慈": "cí",
  "瓷": "cí",
  "词": "cí",
  "此": "cǐ",
  "刺": "cì",
  "赐": "cì",
  "次": "cì",
  "聪": "cōng",
  "葱": "cōng",
  "囱": "cōng",
  "匆": "cōng",
  "从": "cóng",
  "丛": "cóng",
  "凑": "còu",
  "粗": "cū",
  "醋": "cù",
  "簇": "cù",
  "促": "cù",
  "蹿": "cuān",
  "篡": "cuàn",
  "窜": "cuàn",
  "摧": "cuī",
  "崔": "cuī",
  "催": "cuī",
  "脆": "cuì",
  "瘁": "cuì",
  "粹": "cuì",
  "淬": "cuì",
  "翠": "cuì",
  "村": "cūn",
  "存": "cún",
  "寸": "cùn",
  "磋": "cuō",
  "撮": "cuō",
  "搓": "cuō",
  "措": "cuò",
  "挫": "cuò",
  "错": "cuò",
  "搭": "dā",
  "达": "dá",
  "答": "dá",
  "瘩": "dá",
  "打": "dǎ",
  "大": "dà",
  "呆": "dāi",
  "歹": "dǎi",
  "傣": "dǎi",
  "逮": "dǎi",
  "戴": "dài",
  "带": "dài",
  "殆": "dài",
  "代": "dài",
  "贷": "dài",
  "袋": "dài",
  "黛": "dài",
  "袋": "dài",
  "待": "dài",
  "逮": "dǎi",
  "怠": "dài",
  "耽": "dān",
  "担": "dān",
  "丹": "dān",
  "单": "dān",
  "郸": "dān",
  "掸": "dǎn",
  "胆": "dǎn",
  "旦": "dàn",
  "氮": "dàn",
  "但": "dàn",
  "惮": "dàn",
  "淡": "dàn",
  "诞": "dàn",
  "弹": "dàn",
  "蛋": "dàn",
  "当": "dāng",
  "挡": "dǎng",
  "党": "dǎng",
  "荡": "dàng",
  "档": "dàng",
  "刀": "dāo",
  "捣": "dǎo",
  "蹈": "dǎo",
  "倒": "dǎo",
  "岛": "dǎo",
  "祷": "dǎo",
  "导": "dǎo",
  "到": "dào",
  "稻": "dào",
  "悼": "dào",
  "道": "dào",
  "盗": "dào",
  "德": "dé",
  "得": "dé",
  "的": "de",
  "蹬": "dēng",
  "灯": "dēng",
  "登": "dēng",
  "等": "děng",
  "瞪": "dèng",
  "凳": "dèng",
  "邓": "dèng",
  "堤": "dī",
  "低": "dī",
  "滴": "dī",
  "迪": "dī",
  "敌": "dí",
  "笛": "dí",
  "狄": "dí",
  "涤": "dí",
  "翟": "dí",
  "嫡": "dí",
  "抵": "dǐ",
  "底": "dǐ",
  "地": "dì",
  "蒂": "dì",
  "第": "dì",
  "帝": "dì",
  "弟": "dì",
  "递": "dì",
  "缔": "dì",
  "颠": "diān",
  "掂": "diān",
  "滇": "diān",
  "碘": "diǎn",
  "点": "diǎn",
  "典": "diǎn",
  "靛": "diàn",
  "垫": "diàn",
  "电": "diàn",
  "佃": "diàn",
  "甸": "diàn",
  "店": "diàn",
  "惦": "diàn",
  "奠": "diàn",
  "淀": "diàn",
  "殿": "diàn",
  "碉": "diāo",
  "叼": "diāo",
  "雕": "diāo",
  "凋": "diāo",
  "刁": "diāo",
  "掉": "diào",
  "吊": "diào",
  "钓": "diào",
  "调": "diào",
  "跌": "diē",
  "爹": "diē",
  "碟": "dié",
  "蝶": "dié",
  "迭": "dié",
  "谍": "dié",
  "叠": "dié",
  "丁": "dīng",
  "盯": "dīng",
  "叮": "dīng",
  "钉": "dìng",
  "顶": "dǐng",
  "鼎": "dǐng",
  "锭": "dìng",
  "定": "dìng",
  "订": "dìng",
  "丢": "diu1",
  "东": "dōng",
  "冬": "dōng",
  "董": "dǒng",
  "懂": "dǒng",
  "动": "dòng",
  "栋": "dòng",
  "侗": "dòng",
  "恫": "dòng",
  "冻": "dòng",
  "洞": "dòng",
  "兜": "dōu",
  "抖": "dǒu",
  "斗": "dòu",
  "陡": "dǒu",
  "豆": "dòu",
  "逗": "dòu",
  "痘": "dòu",
  "都": "dōu",
  "督": "dū",
  "毒": "dú",
  "犊": "dú",
  "独": "dú",
  "读": "dú",
  "堵": "dǔ",
  "睹": "dǔ",
  "赌": "dǔ",
  "杜": "dù",
  "镀": "dù",
  "肚": "dù",
  "度": "dù",
  "渡": "dù",
  "妒": "dù",
  "端": "duān",
  "短": "duǎn",
  "锻": "duàn",
  "段": "duàn",
  "断": "duàn",
  "缎": "duàn",
  "堆": "duī",
  "兑": "duì",
  "队": "duì",
  "对": "duì",
  "墩": "dūn",
  "吨": "dūn",
  "蹲": "dūn",
  "敦": "dūn",
  "顿": "dùn",
  "囤": "dùn",
  "钝": "dùn",
  "盾": "dùn",
  "遁": "dùn",
  "掇": "duō",
  "哆": "duō",
  "多": "duō",
  "夺": "duó",
  "垛": "duǒ",
  "躲": "duǒ",
  "朵": "duǒ",
  "跺": "duò",
  "舵": "duò",
  "剁": "duò",
  "惰": "duò",
  "堕": "duò",
  "蛾": "é",
  "峨": "é",
  "鹅": "é",
  "俄": "é",
  "额": "é",
  "讹": "é",
  "娥": "é",
  "恶": "è",
  "厄": "è",
  "扼": "è",
  "遏": "è",
  "鄂": "è",
  "饿": "è",
  "恩": "ēn",
  "而": "ér",
  "儿": "ér",
  "耳": "ěr",
  "尔": "ěr",
  "饵": "ěr",
  "洱": "ěr",
  "二": "èr",
  "贰": "èr",
  "发": "fā",
  "罚": "fá",
  "筏": "fá",
  "伐": "fá",
  "乏": "fá",
  "阀": "fá",
  "法": "fǎ",
  "珐": "fà",
  "藩": "fān",
  "帆": "fān",
  "番": "fān",
  "翻": "fān",
  "樊": "fán",
  "矾": "fán",
  "钒": "fán",
  "繁": "fán",
  "凡": "fán",
  "烦": "fán",
  "反": "fǎn",
  "返": "fǎn",
  "范": "fàn",
  "贩": "fàn",
  "犯": "fàn",
  "饭": "fàn",
  "泛": "fàn",
  "坊": "fāng",
  "芳": "fāng",
  "方": "fāng",
  "肪": "fáng",
  "房": "fáng",
  "防": "fáng",
  "妨": "fáng",
  "仿": "fǎng",
  "访": "fǎng",
  "纺": "fǎng",
  "放": "fàng",
  "菲": "fēi",
  "非": "fēi",
  "啡": "fēi",
  "飞": "fēi",
  "肥": "féi",
  "匪": "fěi",
  "诽": "fěi",
  "吠": "fèi",
  "肺": "fèi",
  "废": "fèi",
  "沸": "fèi",
  "费": "fèi",
  "芬": "fēn",
  "酚": "fēn",
  "吩": "fēn",
  "氛": "fēn",
  "分": "fēn",
  "纷": "fēn",
  "坟": "fén",
  "焚": "fén",
  "汾": "fén",
  "粉": "fěn",
  "奋": "fèn",
  "份": "fèn",
  "忿": "fèn",
  "愤": "fèn",
  "粪": "fèn",
  "丰": "fēng",
  "封": "fēng",
  "枫": "fēng",
  "蜂": "fēng",
  "峰": "fēng",
  "锋": "fēng",
  "风": "fēng",
  "疯": "fēng",
  "烽": "fēng",
  "逢": "féng",
  "冯": "féng",
  "缝": "féng",
  "讽": "fěng",
  "奉": "fèng",
  "凤": "fèng",
  "佛": "fó",
  "否": "fǒu",
  "夫": "fū",
  "敷": "fū",
  "肤": "fū",
  "孵": "fū",
  "扶": "fú",
  "拂": "fú",
  "辐": "fú",
  "幅": "fú",
  "氟": "fú",
  "符": "fú",
  "伏": "fú",
  "俘": "fú",
  "服": "fú",
  "浮": "fú",
  "涪": "fú",
  "福": "fú",
  "袱": "fú",
  "弗": "fú",
  "甫": "fǔ",
  "抚": "fǔ",
  "辅": "fǔ",
  "俯": "fǔ",
  "釜": "fǔ",
  "斧": "fǔ",
  "脯": "pú",
  "腑": "fǔ",
  "府": "fǔ",
  "腐": "fǔ",
  "赴": "fù",
  "副": "fù",
  "覆": "fù",
  "赋": "fù",
  "复": "fù",
  "傅": "fù",
  "付": "fù",
  "阜": "fù",
  "父": "fù",
  "腹": "fù",
  "负": "fù",
  "富": "fù",
  "讣": "fù",
  "附": "fù",
  "妇": "fù",
  "缚": "fù",
  "咐": "fù",
  "噶": "gá",
  "嘎": "gā",
  "该": "gāi",
  "改": "gǎi",
  "概": "gài",
  "钙": "gài",
  "盖": "gài",
  "溉": "gài",
  "干": "gàn",
  "甘": "gān",
  "杆": "gǎn",
  "柑": "gān",
  "竿": "gān",
  "肝": "gān",
  "赶": "gǎn",
  "感": "gǎn",
  "秆": "gǎn",
  "敢": "gǎn",
  "赣": "gàn",
  "冈": "gāng",
  "刚": "gāng",
  "钢": "gāng",
  "缸": "gāng",
  "肛": "gāng",
  "纲": "gāng",
  "岗": "gǎng",
  "港": "gǎng",
  "杠": "gàng",
  "篙": "gāo",
  "皋": "gāo",
  "高": "gāo",
  "膏": "gāo",
  "羔": "gāo",
  "糕": "gāo",
  "搞": "gǎo",
  "镐": "gǎo",
  "稿": "gǎo",
  "告": "gào",
  "哥": "gē",
  "歌": "gē",
  "搁": "gē",
  "戈": "gē",
  "鸽": "gē",
  "胳": "gē",
  "疙": "gē",
  "割": "gē",
  "革": "gé",
  "葛": "gě",
  "格": "gé",
  "蛤": "há",
  "阁": "gé",
  "隔": "gé",
  "铬": "gè",
  "个": "gè",
  "各": "gè",
  "给": "gěi",
  "根": "gēn",
  "跟": "gēn",
  "耕": "gēng",
  "更": "gèng",
  "庚": "gēng",
  "羹": "gēng",
  "埂": "gěng",
  "耿": "gěng",
  "梗": "gěng",
  "工": "gōng",
  "攻": "gōng",
  "功": "gōng",
  "恭": "gōng",
  "龚": "gōng",
  "供": "gòng",
  "躬": "gōng",
  "公": "gōng",
  "宫": "gōng",
  "弓": "gōng",
  "巩": "gǒng",
  "汞": "gǒng",
  "拱": "gǒng",
  "贡": "gòng",
  "共": "gòng",
  "钩": "gōu",
  "勾": "gōu",
  "沟": "gōu",
  "苟": "gǒu",
  "狗": "gǒu",
  "垢": "gòu",
  "构": "gòu",
  "购": "gòu",
  "够": "gòu",
  "辜": "gū",
  "菇": "gū",
  "咕": "gū",
  "箍": "gū",
  "估": "gū",
  "沽": "gū",
  "孤": "gū",
  "姑": "gū",
  "鼓": "gǔ",
  "古": "gǔ",
  "蛊": "gǔ",
  "骨": "gǔ",
  "谷": "gǔ",
  "股": "gǔ",
  "故": "gù",
  "顾": "gù",
  "固": "gù",
  "雇": "gù",
  "刮": "guā",
  "瓜": "guā",
  "剐": "guǎ",
  "寡": "guǎ",
  "挂": "guà",
  "褂": "guà",
  "乖": "guāi",
  "拐": "guǎi",
  "怪": "guài",
  "棺": "guān",
  "关": "guān",
  "官": "guān",
  "冠": "guàn",
  "观": "guān",
  "管": "guǎn",
  "馆": "guǎn",
  "罐": "guàn",
  "惯": "guàn",
  "灌": "guàn",
  "贯": "guàn",
  "光": "guāng",
  "广": "guǎng",
  "逛": "guàng",
  "瑰": "guī",
  "规": "guī",
  "圭": "guī",
  "硅": "guī",
  "归": "guī",
  "龟": "guī",
  "闺": "guī",
  "轨": "guǐ",
  "鬼": "guǐ",
  "诡": "guǐ",
  "癸": "guǐ",
  "桂": "guì",
  "柜": "guì",
  "跪": "guì",
  "贵": "guì",
  "刽": "guì",
  "辊": "gǔn",
  "滚": "gǔn",
  "棍": "gùn",
  "锅": "guō",
  "郭": "guō",
  "国": "guó",
  "果": "guǒ",
  "裹": "guǒ",
  "过": "guò",
  "哈": "hā",
  "骸": "hái",
  "孩": "hái",
  "海": "hǎi",
  "氦": "hài",
  "亥": "hài",
  "害": "hài",
  "骇": "hài",
  "酣": "hān",
  "憨": "hān",
  "邯": "hán",
  "韩": "hán",
  "含": "hán",
  "涵": "hán",
  "寒": "hán",
  "函": "hán",
  "喊": "hǎn",
  "罕": "hǎn",
  "翰": "hàn",
  "撼": "hàn",
  "捍": "hàn",
  "旱": "hàn",
  "憾": "hàn",
  "悍": "hàn",
  "焊": "hàn",
  "汗": "hàn",
  "汉": "hàn",
  "夯": "hāng",
  "杭": "háng",
  "航": "háng",
  "壕": "háo",
  "嚎": "háo",
  "豪": "háo",
  "毫": "háo",
  "郝": "hǎo",
  "好": "hǎo",
  "耗": "hào",
  "号": "hào",
  "浩": "hào",
  "呵": "hē",
  "喝": "hē",
  "荷": "hé",
  "菏": "hé",
  "核": "hé",
  "禾": "hé",
  "和": "hé",
  "何": "hé",
  "合": "hé",
  "盒": "hé",
  "貉": "hè",
  "阂": "hé",
  "河": "hé",
  "涸": "hé",
  "赫": "hè",
  "褐": "hè",
  "鹤": "hè",
  "贺": "hè",
  "嘿": "hēi",
  "黑": "hēi",
  "痕": "hén",
  "很": "hěn",
  "狠": "hěn",
  "恨": "hèn",
  "哼": "hēng",
  "亨": "hēng",
  "横": "héng",
  "衡": "héng",
  "恒": "héng",
  "轰": "hōng",
  "哄": "hǒng",
  "烘": "hōng",
  "虹": "hóng",
  "鸿": "hóng",
  "洪": "hóng",
  "宏": "hóng",
  "弘": "hóng",
  "红": "hóng",
  "喉": "hóu",
  "侯": "hòu",
  "猴": "hóu",
  "吼": "hǒu",
  "厚": "hòu",
  "候": "hòu",
  "后": "hòu",
  "呼": "hū",
  "乎": "hū",
  "忽": "hū",
  "瑚": "hú",
  "壶": "hú",
  "葫": "hú",
  "胡": "hú",
  "蝴": "hú",
  "狐": "hú",
  "糊": "hú",
  "湖": "hú",
  "弧": "hú",
  "虎": "hǔ",
  "唬": "hǔ",
  "护": "hù",
  "互": "hù",
  "沪": "hù",
  "户": "hù",
  "花": "huā",
  "哗": "huá",
  "华": "huá",
  "猾": "huá",
  "滑": "huá",
  "画": "huà",
  "划": "huá",
  "化": "huà",
  "话": "huà",
  "槐": "huái",
  "徊": "huái",
  "怀": "huái",
  "淮": "huái",
  "坏": "huài",
  "欢": "huān",
  "环": "huán",
  "桓": "huán",
  "还": "hái",
  "缓": "huǎn",
  "换": "huàn",
  "患": "huàn",
  "唤": "huàn",
  "痪": "huàn",
  "豢": "huàn",
  "焕": "huàn",
  "涣": "huàn",
  "宦": "huàn",
  "幻": "huàn",
  "荒": "huāng",
  "慌": "huāng",
  "黄": "huáng",
  "磺": "huáng",
  "蝗": "huáng",
  "簧": "huáng",
  "皇": "huáng",
  "凰": "huáng",
  "惶": "huáng",
  "煌": "huáng",
  "晃": "huàng",
  "幌": "huǎng",
  "恍": "huǎng",
  "谎": "huǎng",
  "灰": "huī",
  "挥": "huī",
  "辉": "huī",
  "徽": "huī",
  "恢": "huī",
  "蛔": "huí",
  "回": "huí",
  "毁": "huǐ",
  "悔": "huǐ",
  "慧": "huì",
  "卉": "huì",
  "惠": "huì",
  "晦": "huì",
  "贿": "huì",
  "秽": "huì",
  "会": "huì",
  "烩": "huì",
  "汇": "huì",
  "讳": "huì",
  "诲": "huì",
  "绘": "huì",
  "荤": "hūn",
  "昏": "hūn",
  "婚": "hūn",
  "魂": "hún",
  "浑": "hún",
  "混": "hùn",
  "豁": "huō",
  "活": "huó",
  "伙": "huǒ",
  "火": "huǒ",
  "获": "huò",
  "或": "huò",
  "惑": "huò",
  "霍": "huò",
  "货": "huò",
  "祸": "huò",
  "击": "jī",
  "圾": "jī",
  "基": "jī",
  "机": "jī",
  "畸": "jī",
  "稽": "jī",
  "积": "jī",
  "箕": "jī",
  "肌": "jī",
  "饥": "jī",
  "迹": "jì",
  "激": "jī",
  "讥": "jī",
  "鸡": "jī",
  "姬": "jī",
  "绩": "jì",
  "缉": "jī",
  "吉": "jí",
  "极": "jí",
  "棘": "jí",
  "辑": "jí",
  "籍": "jí",
  "集": "jí",
  "及": "jí",
  "急": "jí",
  "疾": "jí",
  "汲": "jí",
  "即": "jí",
  "嫉": "jí",
  "级": "jí",
  "挤": "jǐ",
  "几": "jǐ",
  "脊": "jǐ",
  "己": "jǐ",
  "蓟": "jì",
  "技": "jì",
  "冀": "jì",
  "季": "jì",
  "伎": "jì",
  "祭": "jì",
  "剂": "jì",
  "悸": "jì",
  "济": "jì",
  "寄": "jì",
  "寂": "jì",
  "计": "jì",
  "记": "jì",
  "既": "jì",
  "暨": "jì",
  "忌": "jì",
  "际": "jì",
  "妓": "jì",
  "继": "jì",
  "纪": "jì",
  "嘉": "jiā",
  "枷": "jiā",
  "夹": "jiā",
  "佳": "jiā",
  "家": "jiā",
  "加": "jiā",
  "荚": "jiá",
  "颊": "jiá",
  "贾": "jiǎ",
  "甲": "jiǎ",
  "钾": "jiǎ",
  "假": "jiǎ",
  "稼": "jià",
  "价": "jià",
  "架": "jià",
  "驾": "jià",
  "嫁": "jià",
  "歼": "jiān",
  "监": "jiān",
  "坚": "jiān",
  "尖": "jiān",
  "笺": "jiān",
  "间": "jiān",
  "煎": "jiān",
  "兼": "jiān",
  "肩": "jiān",
  "艰": "jiān",
  "奸": "jiān",
  "缄": "jiān",
  "茧": "jiǎn",
  "检": "jiǎn",
  "柬": "jiǎn",
  "碱": "jiǎn",
  "硷": "jiǎn",
  "拣": "jiǎn",
  "捡": "jiǎn",
  "简": "jiǎn",
  "俭": "jiǎn",
  "剪": "jiǎn",
  "减": "jiǎn",
  "荐": "jiàn",
  "槛": "kǎn",
  "鉴": "jiàn",
  "践": "jiàn",
  "贱": "jiàn",
  "见": "jiàn",
  "键": "jiàn",
  "箭": "jiàn",
  "件": "jiàn",
  "健": "jiàn",
  "舰": "jiàn",
  "剑": "jiàn",
  "饯": "jiàn",
  "渐": "jiàn",
  "溅": "jiàn",
  "涧": "jiàn",
  "建": "jiàn",
  "僵": "jiāng",
  "姜": "jiāng",
  "将": "jiāng",
  "浆": "jiāng",
  "江": "jiāng",
  "疆": "jiāng",
  "蒋": "jiǎng",
  "桨": "jiǎng",
  "奖": "jiǎng",
  "讲": "jiǎng",
  "匠": "jiàng",
  "酱": "jiàng",
  "降": "jiàng",
  "蕉": "jiāo",
  "椒": "jiāo",
  "礁": "jiāo",
  "焦": "jiāo",
  "胶": "jiāo",
  "交": "jiāo",
  "郊": "jiāo",
  "浇": "jiāo",
  "骄": "jiāo",
  "娇": "jiāo",
  "嚼": "jiáo",
  "搅": "jiǎo",
  "铰": "jiǎo",
  "矫": "jiǎo",
  "侥": "yáo",
  "脚": "jiǎo",
  "狡": "jiǎo",
  "角": "jiǎo",
  "饺": "jiǎo",
  "缴": "jiǎo",
  "绞": "jiǎo",
  "剿": "jiǎo",
  "教": "jiào",
  "酵": "jiào",
  "轿": "jiào",
  "较": "jiào",
  "叫": "jiào",
  "窖": "jiào",
  "揭": "jiē",
  "接": "jiē",
  "皆": "jiē",
  "秸": "jiē",
  "街": "jiē",
  "阶": "jiē",
  "截": "jié",
  "劫": "jié",
  "节": "jié",
  "桔": "jú",
  "杰": "jié",
  "捷": "jié",
  "睫": "jié",
  "竭": "jié",
  "洁": "jié",
  "结": "jié",
  "解": "jiě",
  "姐": "jiě",
  "戒": "jiè",
  "藉": "jiè",
  "芥": "jiè",
  "界": "jiè",
  "借": "jiè",
  "介": "jiè",
  "疥": "jiè",
  "诫": "jiè",
  "届": "jiè",
  "巾": "jīn",
  "筋": "jīn",
  "斤": "jīn",
  "金": "jīn",
  "今": "jīn",
  "津": "jīn",
  "襟": "jīn",
  "紧": "jǐn",
  "锦": "jǐn",
  "仅": "jǐn",
  "谨": "jǐn",
  "进": "jìn",
  "靳": "jìn",
  "晋": "jìn",
  "禁": "jìn",
  "近": "jìn",
  "烬": "jìn",
  "浸": "jìn",
  "尽": "jìn",
  "劲": "jìn",
  "荆": "jīng",
  "兢": "jīng",
  "茎": "jīng",
  "睛": "jīng",
  "晶": "jīng",
  "鲸": "jīng",
  "京": "jīng",
  "惊": "jīng",
  "精": "jīng",
  "粳": "jīng",
  "经": "jīng",
  "井": "jǐng",
  "警": "jǐng",
  "景": "jǐng",
  "颈": "jǐng",
  "静": "jìng",
  "境": "jìng",
  "敬": "jìng",
  "镜": "jìng",
  "径": "jìng",
  "痉": "jìng",
  "靖": "jìng",
  "竟": "jìng",
  "竞": "jìng",
  "净": "jìng",
  "炯": "jiǒng",
  "窘": "jiǒng",
  "揪": "jiū",
  "究": "jiū",
  "纠": "jiū",
  "玖": "jiǔ",
  "韭": "jiǔ",
  "久": "jiǔ",
  "灸": "jiǔ",
  "九": "jiǔ",
  "酒": "jiǔ",
  "厩": "jiù",
  "救": "jiù",
  "旧": "jiù",
  "臼": "jiù",
  "舅": "jiù",
  "咎": "jiù",
  "就": "jiù",
  "疚": "jiù",
  "鞠": "jū",
  "拘": "jū",
  "狙": "jū",
  "疽": "jū",
  "居": "jū",
  "驹": "jū",
  "菊": "jú",
  "局": "jú",
  "咀": "jǔ",
  "矩": "jǔ",
  "举": "jǔ",
  "沮": "jǔ",
  "聚": "jù",
  "拒": "jù",
  "据": "jù",
  "巨": "jù",
  "具": "jù",
  "距": "jù",
  "踞": "jù",
  "锯": "jù",
  "俱": "jù",
  "句": "jù",
  "惧": "jù",
  "炬": "jù",
  "剧": "jù",
  "捐": "juān",
  "鹃": "juān",
  "娟": "juān",
  "倦": "juàn",
  "眷": "juàn",
  "卷": "juàn",
  "绢": "juàn",
  "撅": "juē",
  "攫": "jué",
  "抉": "jué",
  "掘": "jué",
  "倔": "juè",
  "爵": "jué",
  "觉": "jué",
  "决": "jué",
  "诀": "jué",
  "绝": "jué",
  "均": "jūn",
  "菌": "jūn",
  "钧": "jūn",
  "军": "jūn",
  "君": "jūn",
  "峻": "jùn",
  "俊": "jùn",
  "竣": "jùn",
  "浚": "xùn",
  "郡": "jùn",
  "骏": "jùn",
  "喀": "kā",
  "咖": "kā",
  "卡": "kǎ",
  "咯": "gē",
  "开": "kāi",
  "揩": "kāi",
  "楷": "kǎi",
  "凯": "kǎi",
  "慨": "kǎi",
  "刊": "kān",
  "堪": "kān",
  "勘": "kān",
  "坎": "kǎn",
  "砍": "kǎn",
  "看": "kàn",
  "康": "kāng",
  "慷": "kāng",
  "糠": "kāng",
  "扛": "káng",
  "抗": "kàng",
  "亢": "kàng",
  "炕": "kàng",
  "考": "kǎo",
  "拷": "kǎo",
  "烤": "kǎo",
  "靠": "kào",
  "坷": "kě",
  "苛": "kē",
  "柯": "kē",
  "棵": "kē",
  "磕": "kē",
  "颗": "kē",
  "科": "kē",
  "壳": "ké",
  "咳": "ké",
  "可": "kě",
  "渴": "kě",
  "克": "kè",
  "刻": "kè",
  "客": "kè",
  "课": "kè",
  "肯": "kěn",
  "啃": "kěn",
  "垦": "kěn",
  "恳": "kěn",
  "坑": "kēng",
  "吭": "kēng",
  "空": "kōng",
  "恐": "kǒng",
  "孔": "kǒng",
  "控": "kòng",
  "抠": "kōu",
  "口": "kǒu",
  "扣": "kòu",
  "寇": "kòu",
  "枯": "kū",
  "哭": "kū",
  "窟": "kū",
  "苦": "kǔ",
  "酷": "kù",
  "库": "kù",
  "裤": "kù",
  "夸": "kuā",
  "垮": "kuǎ",
  "挎": "kuà",
  "跨": "kuà",
  "胯": "kuà",
  "块": "kuài",
  "筷": "kuài",
  "侩": "kuài",
  "快": "kuài",
  "宽": "kuān",
  "款": "kuǎn",
  "匡": "kuāng",
  "筐": "kuāng",
  "狂": "kuáng",
  "框": "kuàng",
  "矿": "kuàng",
  "眶": "kuàng",
  "旷": "kuàng",
  "况": "kuàng",
  "亏": "kuī",
  "盔": "kuī",
  "岿": "kuī",
  "窥": "kuī",
  "葵": "kuí",
  "奎": "kuí",
  "魁": "kuí",
  "傀": "guī",
  "馈": "kuì",
  "愧": "kuì",
  "溃": "kuì",
  "坤": "kūn",
  "昆": "kūn",
  "捆": "kǔn",
  "困": "kùn",
  "括": "kuò",
  "扩": "kuò",
  "廓": "kuò",
  "阔": "kuò",
  "垃": "lā",
  "拉": "lā",
  "喇": "lǎ",
  "蜡": "là",
  "腊": "là",
  "辣": "là",
  "啦": "lā",
  "莱": "lái",
  "来": "lái",
  "赖": "lài",
  "蓝": "lán",
  "婪": "lán",
  "栏": "lán",
  "拦": "lán",
  "篮": "lán",
  "阑": "lán",
  "兰": "lán",
  "澜": "lán",
  "谰": "lán",
  "揽": "lǎn",
  "览": "lǎn",
  "懒": "lǎn",
  "缆": "lǎn",
  "烂": "làn",
  "滥": "làn",
  "琅": "láng",
  "榔": "láng",
  "狼": "láng",
  "廊": "láng",
  "郎": "láng",
  "朗": "lǎng",
  "浪": "làng",
  "捞": "lāo",
  "劳": "láo",
  "牢": "láo",
  "老": "lǎo",
  "佬": "lǎo",
  "姥": "lǎo",
  "酪": "lào",
  "烙": "lào",
  "涝": "lào",
  "勒": "lè",
  "乐": "lè",
  "雷": "léi",
  "镭": "léi",
  "蕾": "lěi",
  "磊": "lěi",
  "累": "lèi",
  "儡": "lěi",
  "垒": "lěi",
  "擂": "lèi",
  "肋": "lèi",
  "类": "lèi",
  "泪": "lèi",
  "棱": "léng",
  "楞": "léng",
  "冷": "lěng",
  "厘": "lí",
  "梨": "lí",
  "犁": "lí",
  "黎": "lí",
  "篱": "lí",
  "狸": "lí",
  "离": "lí",
  "漓": "lí",
  "理": "lǐ",
  "李": "lǐ",
  "里": "lǐ",
  "锂": "lǐ",
  "鲤": "lǐ",
  "礼": "lǐ",
  "莉": "lì",
  "荔": "lì",
  "吏": "lì",
  "栗": "lì",
  "丽": "lì",
  "厉": "lì",
  "励": "lì",
  "砾": "lì",
  "历": "lì",
  "利": "lì",
  "傈": "lì",
  "例": "lì",
  "俐": "lì",
  "痢": "lì",
  "立": "lì",
  "粒": "lì",
  "沥": "lì",
  "隶": "lì",
  "力": "lì",
  "璃": "lí",
  "哩": "lǐ",
  "俩": "liǎng",
  "联": "lián",
  "莲": "lián",
  "连": "lián",
  "镰": "lián",
  "廉": "lián",
  "怜": "lián",
  "涟": "lián",
  "帘": "lián",
  "敛": "liǎn",
  "脸": "liǎn",
  "链": "liàn",
  "恋": "liàn",
  "炼": "liàn",
  "练": "liàn",
  "粮": "liáng",
  "凉": "liáng",
  "梁": "liáng",
  "粱": "liáng",
  "良": "liáng",
  "两": "liǎng",
  "辆": "liàng",
  "量": "liàng",
  "晾": "liàng",
  "亮": "liàng",
  "靓": "liàng",
  "谅": "liàng",
  "撩": "liáo",
  "聊": "liáo",
  "僚": "liáo",
  "疗": "liáo",
  "燎": "liáo",
  "寥": "liáo",
  "辽": "liáo",
  "潦": "liáo",
  "了": "le",
  "撂": "liào",
  "镣": "liào",
  "廖": "liào",
  "料": "liào",
  "列": "liè",
  "裂": "liè",
  "烈": "liè",
  "劣": "liè",
  "猎": "liè",
  "琳": "lín",
  "林": "lín",
  "磷": "lín",
  "霖": "lín",
  "临": "lín",
  "邻": "lín",
  "鳞": "lín",
  "淋": "lín",
  "凛": "lǐn",
  "赁": "lìn",
  "吝": "lìn",
  "拎": "līn",
  "玲": "líng",
  "菱": "líng",
  "零": "líng",
  "龄": "líng",
  "铃": "líng",
  "伶": "líng",
  "羚": "líng",
  "凌": "líng",
  "灵": "líng",
  "陵": "líng",
  "岭": "lǐng",
  "领": "lǐng",
  "另": "lìng",
  "令": "lìng",
  "溜": "liū",
  "琉": "liú",
  "榴": "liú",
  "硫": "liú",
  "馏": "liú",
  "留": "liú",
  "刘": "liú",
  "浏": "liú",
  "瘤": "liú",
  "流": "liú",
  "柳": "liǔ",
  "六": "liù",
  "龙": "lóng",
  "聋": "lóng",
  "咙": "lóng",
  "笼": "lóng",
  "窿": "lóng",
  "隆": "lóng",
  "垄": "lǒng",
  "拢": "lǒng",
  "陇": "lǒng",
  "楼": "lóu",
  "娄": "lóu",
  "搂": "lǒu",
  "篓": "lǒu",
  "漏": "lòu",
  "陋": "lòu",
  "芦": "lú",
  "卢": "lú",
  "颅": "lú",
  "庐": "lú",
  "炉": "lú",
  "掳": "lǔ",
  "卤": "lǔ",
  "虏": "lǔ",
  "鲁": "lǔ",
  "麓": "lù",
  "碌": "lù",
  "露": "lù",
  "路": "lù",
  "赂": "lù",
  "鹿": "lù",
  "潞": "lù",
  "璐": "lù",
  "禄": "lù",
  "录": "lù",
  "陆": "lù",
  "戮": "lù",
  "驴": "lǘ",
  "吕": "lǚ",
  "铝": "lǚ",
  "侣": "lǚ",
  "旅": "lǚ",
  "履": "lǚ",
  "屡": "lǚ",
  "缕": "lǚ",
  "虑": "lǜ",
  "氯": "lǜ",
  "律": "lǜ",
  "率": "lǜ",
  "滤": "lǜ",
  "绿": "lǜ",
  "峦": "luán",
  "挛": "luán",
  "孪": "luán",
  "滦": "luán",
  "卵": "luǎn",
  "乱": "luàn",
  "掠": "lüě",
  "略": "lüè",
  "抡": "lún",
  "轮": "lún",
  "伦": "lún",
  "仑": "lún",
  "沦": "lún",
  "纶": "lún",
  "论": "lùn",
  "萝": "luó",
  "螺": "luó",
  "罗": "luó",
  "逻": "luó",
  "锣": "luó",
  "箩": "luó",
  "骡": "luó",
  "裸": "luǒ",
  "落": "luò",
  "洛": "luò",
  "骆": "luò",
  "络": "luò",
  "妈": "mā",
  "麻": "má",
  "玛": "mǎ",
  "码": "mǎ",
  "蚂": "mǎ",
  "马": "mǎ",
  "骂": "mà",
  "嘛": "ma",
  "吗": "ma",
  "埋": "mái",
  "买": "mǎi",
  "麦": "mài",
  "卖": "mài",
  "迈": "mài",
  "脉": "mài",
  "瞒": "mán",
  "馒": "mán",
  "蛮": "mán",
  "满": "mǎn",
  "蔓": "màn",
  "曼": "màn",
  "慢": "màn",
  "漫": "màn",
  "谩": "màn",
  "芒": "máng",
  "茫": "máng",
  "盲": "máng",
  "氓": "máng",
  "忙": "máng",
  "莽": "mǎng",
  "猫": "māo",
  "茅": "máo",
  "锚": "máo",
  "毛": "máo",
  "矛": "máo",
  "茆": "máo",
  "铆": "mǎo",
  "卯": "mǎo",
  "茂": "mào",
  "冒": "mào",
  "帽": "mào",
  "貌": "mào",
  "贸": "mào",
  "么": "me",
  "玫": "méi",
  "枚": "méi",
  "梅": "méi",
  "酶": "méi",
  "霉": "méi",
  "煤": "méi",
  "没": "méi",
  "眉": "méi",
  "媒": "méi",
  "镁": "měi",
  "每": "měi",
  "美": "měi",
  "昧": "mèi",
  "寐": "mèi",
  "妹": "mèi",
  "媚": "mèi",
  "门": "mén",
  "闷": "mèn",
  "们": "mén",
  "萌": "méng",
  "蒙": "méng",
  "檬": "méng",
  "盟": "méng",
  "锰": "měng",
  "猛": "měng",
  "梦": "mèng",
  "孟": "mèng",
  "眯": "mī",
  "醚": "mí",
  "靡": "mí",
  "糜": "mí",
  "迷": "mí",
  "谜": "mí",
  "弥": "mí",
  "米": "mǐ",
  "秘": "mì",
  "觅": "mì",
  "泌": "mì",
  "蜜": "mì",
  "密": "mì",
  "幂": "mì",
  "棉": "mián",
  "眠": "mián",
  "绵": "mián",
  "冕": "miǎn",
  "免": "miǎn",
  "勉": "miǎn",
  "娩": "miǎn",
  "缅": "miǎn",
  "面": "miàn",
  "苗": "miáo",
  "描": "miáo",
  "瞄": "miáo",
  "藐": "miǎo",
  "秒": "miǎo",
  "渺": "miǎo",
  "庙": "miào",
  "妙": "miào",
  "蔑": "miè",
  "灭": "miè",
  "民": "mín",
  "抿": "mǐn",
  "皿": "mǐn",
  "敏": "mǐn",
  "悯": "mǐn",
  "闽": "mǐn",
  "明": "míng",
  "螟": "míng",
  "鸣": "míng",
  "铭": "míng",
  "名": "míng",
  "命": "mìng",
  "谬": "miù",
  "摸": "mō",
  "摹": "mó",
  "蘑": "mó",
  "模": "mó",
  "膜": "mó",
  "磨": "mó",
  "摩": "mó",
  "魔": "mó",
  "抹": "mò",
  "末": "mò",
  "莫": "mò",
  "墨": "mò",
  "默": "mò",
  "沫": "mò",
  "漠": "mò",
  "寞": "mò",
  "陌": "mò",
  "谋": "móu",
  "牟": "móu",
  "某": "mǒu",
  "拇": "mǔ",
  "牡": "mǔ",
  "亩": "mǔ",
  "姆": "mǔ",
  "母": "mǔ",
  "墓": "mù",
  "暮": "mù",
  "幕": "mù",
  "募": "mù",
  "慕": "mù",
  "木": "mù",
  "目": "mù",
  "睦": "mù",
  "牧": "mù",
  "穆": "mù",
  "拿": "ná",
  "哪": "nǎ",
  "呐": "nà",
  "钠": "nà",
  "那": "nà",
  "娜": "nà",
  "纳": "nà",
  "氖": "nǎi",
  "乃": "nǎi",
  "奶": "nǎi",
  "耐": "nai",
  "奈": "nai",
  "南": "nán",
  "男": "nán",
  "难": "nán",
  "囊": "náng",
  "挠": "náo",
  "脑": "nǎo",
  "恼": "nǎo",
  "闹": "nào",
  "淖": "nào",
  "呢": "ne",
  "馁": "něi",
  "内": "nèi",
  "嫩": "nèn",
  "能": "néng",
  "妮": "nī",
  "霓": "ní",
  "倪": "ní",
  "泥": "ní",
  "尼": "ní",
  "拟": "nǐ",
  "你": "nǐ",
  "匿": "nì",
  "腻": "nì",
  "逆": "nì",
  "溺": "nì",
  "蔫": "niān",
  "拈": "niān",
  "年": "nián",
  "碾": "niǎn",
  "撵": "niǎn",
  "捻": "niǎn",
  "念": "niàn",
  "娘": "niáng",
  "酿": "niàng",
  "鸟": "niǎo",
  "尿": "niào",
  "捏": "niē",
  "聂": "niè",
  "孽": "niè",
  "啮": "niè",
  "镊": "niè",
  "镍": "niè",
  "涅": "niè",
  "您": "nín",
  "柠": "níng",
  "狞": "níng",
  "凝": "níng",
  "宁": "níng",
  "拧": "nǐng",
  "泞": "nìng",
  "牛": "niú",
  "扭": "niǔ",
  "钮": "niǔ",
  "纽": "niǔ",
  "脓": "nóng",
  "浓": "nóng",
  "农": "nóng",
  "弄": "nòng",
  "奴": "nú",
  "努": "nǔ",
  "怒": "nù",
  "女": "nǚ",
  "暖": "nuǎn",
  "虐": "nüè",
  "疟": "nüè",
  "挪": "nuó",
  "懦": "nuò",
  "糯": "nuò",
  "诺": "nuò",
  "哦": "ò",
  "欧": "ōu",
  "鸥": "ōu",
  "殴": "ōu",
  "藕": "ǒu",
  "呕": "ǒu",
  "偶": "ǒu",
  "沤": "ōu",
  "啪": "pā",
  "趴": "pā",
  "爬": "pá",
  "帕": "pà",
  "怕": "pà",
  "琶": "pá",
  "拍": "pāi",
  "排": "pái",
  "牌": "pái",
  "徘": "pái",
  "湃": "pai",
  "派": "pai",
  "攀": "pān",
  "潘": "pān",
  "盘": "pán",
  "磐": "pán",
  "盼": "pàn",
  "畔": "pàn",
  "判": "pàn",
  "叛": "pàn",
  "乓": "pāng",
  "庞": "páng",
  "旁": "páng",
  "耪": "pǎng",
  "胖": "pàng",
  "抛": "pāo",
  "咆": "páo",
  "刨": "páo",
  "炮": "pào",
  "袍": "páo",
  "跑": "pǎo",
  "泡": "pào",
  "呸": "pēi",
  "胚": "pēi",
  "培": "péi",
  "裴": "péi",
  "赔": "péi",
  "陪": "péi",
  "配": "pèi",
  "佩": "pèi",
  "沛": "pèi",
  "喷": "pēn",
  "盆": "pén",
  "砰": "pēng",
  "抨": "pēng",
  "烹": "pēng",
  "澎": "péng",
  "彭": "péng",
  "蓬": "péng",
  "棚": "péng",
  "硼": "péng",
  "篷": "péng",
  "膨": "péng",
  "朋": "péng",
  "鹏": "péng",
  "捧": "pěng",
  "碰": "pèng",
  "坯": "pī",
  "砒": "pī",
  "霹": "pī",
  "批": "pī",
  "披": "pī",
  "劈": "pī",
  "琵": "pí",
  "毗": "pí",
  "啤": "pí",
  "脾": "pí",
  "疲": "pí",
  "皮": "pí",
  "匹": "pǐ",
  "痞": "pǐ",
  "僻": "pì",
  "屁": "pì",
  "譬": "pì",
  "篇": "piān",
  "偏": "piān",
  "片": "piàn",
  "骗": "piàn",
  "飘": "piāo",
  "漂": "piāo",
  "瓢": "piáo",
  "票": "piào",
  "撇": "piě",
  "瞥": "piē",
  "拼": "pīn",
  "频": "pín",
  "贫": "pín",
  "品": "pǐn",
  "聘": "pìn",
  "乒": "pīng",
  "坪": "píng",
  "苹": "píng",
  "萍": "píng",
  "平": "píng",
  "凭": "píng",
  "瓶": "píng",
  "评": "píng",
  "屏": "píng",
  "坡": "pō",
  "泼": "pō",
  "颇": "pō",
  "婆": "pó",
  "破": "pò",
  "魄": "pò",
  "迫": "pò",
  "粕": "pò",
  "剖": "pōu",
  "扑": "pū",
  "铺": "pù",
  "仆": "pú",
  "莆": "pú",
  "葡": "pú",
  "菩": "pú",
  "蒲": "pú",
  "埔": "pǔ",
  "朴": "pǔ",
  "圃": "pǔ",
  "普": "pǔ",
  "浦": "pǔ",
  "谱": "pǔ",
  "曝": "pù",
  "瀑": "bào",
  "期": "qī",
  "欺": "qī",
  "栖": "qī",
  "戚": "qī",
  "妻": "qī",
  "七": "qī",
  "凄": "qī",
  "漆": "qī",
  "柒": "qī",
  "沏": "qī",
  "其": "qí",
  "棋": "qí",
  "奇": "qí",
  "歧": "qí",
  "畦": "qí",
  "崎": "qí",
  "脐": "qí",
  "齐": "qí",
  "旗": "qí",
  "祈": "qí",
  "祁": "qí",
  "骑": "qí",
  "起": "qǐ",
  "岂": "qǐ",
  "乞": "qǐ",
  "企": "qǐ",
  "启": "qǐ",
  "契": "qì",
  "砌": "qì",
  "器": "qì",
  "气": "qì",
  "迄": "qì",
  "弃": "qì",
  "汽": "qì",
  "泣": "qì",
  "讫": "qì",
  "掐": "qiā",
  "恰": "qià",
  "洽": "qià",
  "牵": "qiān",
  "扦": "qiān",
  "钎": "qiān",
  "铅": "qiān",
  "千": "qiān",
  "迁": "qiān",
  "签": "qiān",
  "仟": "qiān",
  "谦": "qiān",
  "乾": "qián",
  "黔": "qián",
  "钱": "qián",
  "钳": "qián",
  "前": "qián",
  "潜": "qián",
  "遣": "qiǎn",
  "浅": "qiǎn",
  "谴": "qiǎn",
  "堑": "qiàn",
  "嵌": "qiàn",
  "欠": "qiàn",
  "歉": "qiàn",
  "枪": "qiāng",
  "呛": "qiàng",
  "腔": "qiāng",
  "羌": "qiāng",
  "墙": "qiáng",
  "蔷": "qiáng",
  "强": "qiáng",
  "抢": "qiǎng",
  "橇": "qiāo",
  "锹": "qiāo",
  "敲": "qiāo",
  "悄": "qiāo",
  "桥": "qiáo",
  "瞧": "qiáo",
  "乔": "qiáo",
  "侨": "qiáo",
  "巧": "qiǎo",
  "鞘": "qiào",
  "撬": "qiào",
  "翘": "qiào",
  "峭": "qiào",
  "俏": "qiào",
  "窍": "qiào",
  "切": "qiē",
  "茄": "qié",
  "且": "qiě",
  "怯": "qiè",
  "窃": "qiè",
  "惬": "qiè",
  "钦": "qīn",
  "侵": "qīn",
  "亲": "qīn",
  "秦": "qín",
  "琴": "qín",
  "勤": "qín",
  "芹": "qín",
  "擒": "qín",
  "禽": "qín",
  "寝": "qǐn",
  "沁": "qìn",
  "青": "qīng",
  "轻": "qīng",
  "氢": "qīng",
  "倾": "qīng",
  "卿": "qīng",
  "清": "qīng",
  "擎": "qíng",
  "晴": "qíng",
  "氰": "qíng",
  "情": "qíng",
  "顷": "qǐng",
  "请": "qǐng",
  "庆": "qìng",
  "琼": "qióng",
  "穷": "qióng",
  "秋": "qiū",
  "丘": "qiū",
  "邱": "qiū",
  "球": "qiú",
  "求": "qiú",
  "囚": "qiú",
  "酋": "qiú",
  "泅": "qiú",
  "趋": "qū",
  "区": "qū",
  "蛆": "qū",
  "曲": "qǔ",
  "躯": "qū",
  "屈": "qū",
  "驱": "qū",
  "渠": "qú",
  "取": "qǔ",
  "娶": "qǔ",
  "龋": "qǔ",
  "趣": "qù",
  "去": "qù",
  "圈": "quān",
  "颧": "quán",
  "权": "quán",
  "醛": "quán",
  "泉": "quán",
  "全": "quán",
  "痊": "quán",
  "拳": "quán",
  "犬": "quǎn",
  "券": "quàn",
  "劝": "quàn",
  "缺": "quē",
  "炔": "quē",
  "瘸": "qué",
  "却": "què",
  "鹊": "què",
  "榷": "què",
  "确": "què",
  "雀": "què",
  "裙": "qún",
  "群": "qún",
  "然": "rán",
  "燃": "rán",
  "冉": "rǎn",
  "染": "rǎn",
  "瓤": "ráng",
  "壤": "rǎng",
  "攘": "rǎng",
  "嚷": "rǎng",
  "让": "ràng",
  "饶": "ráo",
  "扰": "rǎo",
  "绕": "rào",
  "惹": "rě",
  "热": "rè",
  "壬": "rén",
  "仁": "rén",
  "人": "rén",
  "忍": "rěn",
  "韧": "rèn",
  "任": "rèn",
  "认": "rèn",
  "刃": "rèn",
  "妊": "rèn",
  "纫": "rèn",
  "扔": "rēng",
  "仍": "réng",
  "日": "rì",
  "戎": "róng",
  "茸": "róng",
  "蓉": "róng",
  "荣": "róng",
  "融": "róng",
  "熔": "róng",
  "溶": "róng",
  "容": "róng",
  "绒": "róng",
  "冗": "rǒng",
  "揉": "róu",
  "柔": "róu",
  "肉": "ròu",
  "茹": "rú",
  "蠕": "rú",
  "儒": "rú",
  "孺": "rú",
  "如": "rú",
  "辱": "rǔ",
  "乳": "rǔ",
  "汝": "rǔ",
  "入": "rù",
  "褥": "rù",
  "软": "ruǎn",
  "阮": "ruǎn",
  "蕊": "ruǐ",
  "瑞": "ruì",
  "锐": "ruì",
  "闰": "rùn",
  "润": "rùn",
  "若": "ruò",
  "弱": "ruò",
  "撒": "sā",
  "洒": "sǎ",
  "萨": "sà",
  "腮": "sāi",
  "鳃": "sāi",
  "塞": "sāi",
  "赛": "sài",
  "三": "sān",
  "叁": "sān",
  "伞": "sǎn",
  "散": "sàn",
  "桑": "sāng",
  "嗓": "sǎng",
  "丧": "sàng",
  "搔": "sāo",
  "骚": "sāo",
  "扫": "sǎo",
  "嫂": "sǎo",
  "瑟": "sè",
  "色": "sè",
  "涩": "sè",
  "森": "sēn",
  "僧": "sēng",
  "莎": "shā",
  "砂": "shā",
  "杀": "shā",
  "刹": "shā",
  "沙": "shā",
  "纱": "shā",
  "傻": "shǎ",
  "啥": "shá",
  "煞": "shà",
  "筛": "shāi",
  "晒": "shai",
  "珊": "shān",
  "苫": "shān",
  "杉": "shān",
  "山": "shān",
  "删": "shān",
  "煽": "shān",
  "衫": "shān",
  "闪": "shǎn",
  "陕": "shǎn",
  "擅": "shàn",
  "赡": "shàn",
  "膳": "shàn",
  "善": "shàn",
  "汕": "shàn",
  "扇": "shàn",
  "缮": "shàn",
  "墒": "shāng",
  "伤": "shāng",
  "商": "shāng",
  "赏": "shǎng",
  "晌": "shǎng",
  "上": "shàng",
  "尚": "shàng",
  "裳": "shang",
  "梢": "shāo",
  "捎": "shāo",
  "稍": "shāo",
  "烧": "shāo",
  "芍": "sháo",
  "勺": "sháo",
  "韶": "sháo",
  "少": "shǎo",
  "哨": "shào",
  "邵": "shào",
  "绍": "shào",
  "奢": "shē",
  "赊": "shē",
  "蛇": "shé",
  "舌": "shé",
  "舍": "shě",
  "赦": "shè",
  "摄": "shè",
  "射": "shè",
  "慑": "shè",
  "涉": "shè",
  "社": "shè",
  "设": "shè",
  "砷": "shēn",
  "申": "shēn",
  "呻": "shēn",
  "伸": "shēn",
  "身": "shēn",
  "深": "shēn",
  "娠": "shēn",
  "绅": "shēn",
  "神": "shén",
  "沈": "shěn",
  "审": "shěn",
  "婶": "shěn",
  "甚": "shèn",
  "肾": "shèn",
  "慎": "shèn",
  "渗": "shèn",
  "声": "shēng",
  "生": "shēng",
  "甥": "shēng",
  "牲": "shēng",
  "升": "shēng",
  "绳": "shéng",
  "省": "shěng",
  "盛": "shèng",
  "剩": "shèng",
  "胜": "shèng",
  "圣": "shèng",
  "师": "shī",
  "失": "shī",
  "狮": "shī",
  "施": "shī",
  "湿": "shī",
  "诗": "shī",
  "尸": "shī",
  "虱": "shī",
  "十": "shí",
  "石": "shí",
  "拾": "shí",
  "时": "shí",
  "什": "shí",
  "食": "shí",
  "蚀": "shí",
  "实": "shí",
  "识": "shí",
  "史": "shǐ",
  "矢": "shǐ",
  "使": "shǐ",
  "屎": "shǐ",
  "驶": "shǐ",
  "始": "shǐ",
  "式": "shì",
  "示": "shì",
  "士": "shì",
  "世": "shì",
  "柿": "shì",
  "事": "shì",
  "拭": "shì",
  "誓": "shì",
  "逝": "shì",
  "势": "shì",
  "是": "shì",
  "嗜": "shì",
  "噬": "shì",
  "适": "shì",
  "仕": "shì",
  "侍": "shì",
  "释": "shì",
  "饰": "shì",
  "氏": "shì",
  "市": "shì",
  "恃": "shì",
  "室": "shì",
  "视": "shì",
  "试": "shì",
  "收": "shōu",
  "手": "shǒu",
  "首": "shǒu",
  "守": "shǒu",
  "寿": "shòu",
  "授": "shòu",
  "售": "shòu",
  "受": "shòu",
  "瘦": "shòu",
  "兽": "shòu",
  "蔬": "shū",
  "枢": "shū",
  "梳": "shū",
  "殊": "shū",
  "抒": "shū",
  "输": "shū",
  "叔": "shū",
  "纾": "shū",
  "舒": "shū",
  "淑": "shū",
  "姝": "shū",
  "疏": "shū",
  "书": "shū",
  "赎": "shú",
  "孰": "shú",
  "熟": "shú",
  "薯": "shǔ",
  "暑": "shǔ",
  "曙": "shǔ",
  "署": "shǔ",
  "蜀": "shǔ",
  "黍": "shǔ",
  "鼠": "shǔ",
  "属": "shǔ",
  "术": "shù",
  "述": "shù",
  "树": "shù",
  "束": "shù",
  "戍": "shù",
  "竖": "shù",
  "墅": "shù",
  "庶": "shù",
  "数": "shù",
  "漱": "shù",
  "恕": "shù",
  "刷": "shuā",
  "耍": "shuǎ",
  "摔": "shuāi",
  "衰": "shuāi",
  "甩": "shuǎi",
  "帅": "shuài",
  "栓": "shuān",
  "拴": "shuān",
  "霜": "shuāng",
  "双": "shuāng",
  "爽": "shuǎng",
  "谁": "shuí",
  "水": "shuǐ",
  "睡": "shuì",
  "税": "shuì",
  "吮": "shǔn",
  "瞬": "shùn",
  "顺": "shùn",
  "舜": "shùn",
  "说": "shuō",
  "硕": "shuò",
  "朔": "shuò",
  "烁": "shuò",
  "斯": "sī",
  "撕": "sī",
  "嘶": "sī",
  "思": "sī",
  "私": "sī",
  "司": "sī",
  "丝": "sī",
  "死": "sǐ",
  "肆": "sì",
  "寺": "sì",
  "嗣": "sì",
  "四": "sì",
  "伺": "sì",
  "似": "sì",
  "饲": "sì",
  "巳": "sì",
  "松": "sōng",
  "耸": "sǒng",
  "怂": "sǒng",
  "颂": "sòng",
  "送": "sòng",
  "宋": "sòng",
  "讼": "sòng",
  "诵": "sòng",
  "搜": "sōu",
  "艘": "sōu",
  "擞": "sǒu",
  "嗽": "sòu",
  "苏": "sū",
  "酥": "sū",
  "俗": "sú",
  "素": "sù",
  "速": "sù",
  "粟": "sù",
  "僳": "sù",
  "塑": "sù",
  "溯": "sù",
  "宿": "xiǔ",
  "诉": "sù",
  "肃": "sù",
  "酸": "suān",
  "蒜": "suàn",
  "算": "suàn",
  "虽": "suī",
  "隋": "suí",
  "随": "suí",
  "绥": "suí",
  "髓": "suǐ",
  "碎": "suì",
  "岁": "suì",
  "穗": "suì",
  "遂": "suí",
  "隧": "suì",
  "祟": "suì",
  "孙": "sūn",
  "损": "sǔn",
  "笋": "sǔn",
  "蓑": "suō",
  "梭": "suō",
  "唆": "suō",
  "缩": "suō",
  "琐": "suǒ",
  "索": "suǒ",
  "锁": "suǒ",
  "所": "suǒ",
  "塌": "tā",
  "他": "tā",
  "它": "tā",
  "她": "tā",
  "塔": "tǎ",
  "獭": "tǎ",
  "挞": "tà",
  "蹋": "tà",
  "踏": "tà",
  "胎": "tāi",
  "苔": "tái",
  "抬": "tái",
  "台": "tái",
  "泰": "tai",
  "酞": "tai",
  "太": "tai",
  "态": "tai",
  "汰": "tai",
  "坍": "tān",
  "摊": "tān",
  "贪": "tān",
  "瘫": "tān",
  "滩": "tān",
  "坛": "tán",
  "檀": "tán",
  "痰": "tán",
  "潭": "tán",
  "谭": "tán",
  "谈": "tán",
  "坦": "tǎn",
  "毯": "tǎn",
  "袒": "tǎn",
  "碳": "tàn",
  "探": "tàn",
  "叹": "tàn",
  "炭": "tàn",
  "汤": "tāng",
  "塘": "táng",
  "搪": "táng",
  "堂": "táng",
  "棠": "táng",
  "膛": "táng",
  "唐": "táng",
  "糖": "táng",
  "倘": "tǎng",
  "躺": "tǎng",
  "淌": "tǎng",
  "趟": "tàng",
  "烫": "tàng",
  "掏": "tāo",
  "涛": "tāo",
  "滔": "tāo",
  "绦": "tāo",
  "萄": "táo",
  "桃": "táo",
  "逃": "táo",
  "淘": "táo",
  "陶": "táo",
  "讨": "tǎo",
  "套": "tào",
  "特": "tè",
  "藤": "téng",
  "腾": "téng",
  "疼": "téng",
  "誊": "téng",
  "梯": "tī",
  "剔": "tī",
  "踢": "tī",
  "锑": "tī",
  "提": "tí",
  "题": "tí",
  "蹄": "tí",
  "啼": "tí",
  "体": "tǐ",
  "替": "tì",
  "嚏": "tì",
  "惕": "tì",
  "涕": "tì",
  "剃": "tì",
  "屉": "tì",
  "天": "tiān",
  "添": "tiān",
  "填": "tián",
  "田": "tián",
  "甜": "tián",
  "恬": "tián",
  "舔": "tiǎn",
  "腆": "tiǎn",
  "挑": "tiāo",
  "条": "tiáo",
  "迢": "tiáo",
  "眺": "tiào",
  "跳": "tiào",
  "贴": "tiē",
  "铁": "tiě",
  "帖": "tiē",
  "厅": "tīng",
  "听": "tīng",
  "烃": "tīng",
  "汀": "tīng",
  "廷": "tíng",
  "停": "tíng",
  "亭": "tíng",
  "婷": "tíng",
  "庭": "tíng",
  "挺": "tǐng",
  "艇": "tǐng",
  "通": "tōng",
  "桐": "tóng",
  "酮": "tóng",
  "瞳": "tóng",
  "同": "tóng",
  "铜": "tóng",
  "彤": "tóng",
  "童": "tóng",
  "桶": "tǒng",
  "捅": "tǒng",
  "筒": "tǒng",
  "统": "tǒng",
  "痛": "tòng",
  "偷": "tōu",
  "投": "tóu",
  "头": "tóu",
  "透": "tòu",
  "凸": "tū",
  "秃": "tū",
  "突": "tū",
  "图": "tú",
  "徒": "tú",
  "途": "tú",
  "涂": "tú",
  "屠": "tú",
  "土": "tǔ",
  "吐": "tǔ",
  "兔": "tù",
  "湍": "tuān",
  "团": "tuán",
  "推": "tuī",
  "颓": "tuí",
  "腿": "tuǐ",
  "蜕": "tuì",
  "褪": "tuì",
  "退": "tuì",
  "吞": "tūn",
  "屯": "tún",
  "臀": "tún",
  "拖": "tuō",
  "托": "tuō",
  "脱": "tuō",
  "鸵": "tuó",
  "陀": "tuó",
  "驮": "tuó",
  "驼": "tuó",
  "椭": "tuǒ",
  "妥": "tuǒ",
  "拓": "tuò",
  "唾": "tuò",
  "挖": "wā",
  "哇": "wa",
  "蛙": "wā",
  "洼": "wā",
  "娃": "wá",
  "瓦": "wǎ",
  "袜": "wà",
  "歪": "wāi",
  "外": "wai",
  "豌": "wān",
  "弯": "wān",
  "湾": "wān",
  "玩": "wán",
  "顽": "wán",
  "丸": "wán",
  "烷": "wán",
  "完": "wán",
  "碗": "wǎn",
  "挽": "wǎn",
  "晚": "wǎn",
  "皖": "wǎn",
  "惋": "wǎn",
  "宛": "wǎn",
  "婉": "wǎn",
  "万": "wàn",
  "腕": "wàn",
  "汪": "wāng",
  "王": "wáng",
  "亡": "wáng",
  "枉": "wǎng",
  "网": "wǎng",
  "往": "wǎng",
  "旺": "wàng",
  "望": "wàng",
  "忘": "wàng",
  "妄": "wàng",
  "威": "wēi",
  "巍": "wēi",
  "微": "wēi",
  "危": "wēi",
  "韦": "wéi",
  "玮": "wéi",
  "违": "wéi",
  "桅": "wéi",
  "围": "wéi",
  "唯": "wéi",
  "惟": "wéi",
  "炜": "wéi",
  "为": "wéi",
  "潍": "wéi",
  "维": "wéi",
  "苇": "wěi",
  "萎": "wěi",
  "委": "wěi",
  "伟": "wěi",
  "伪": "wěi",
  "尾": "wěi",
  "纬": "wěi",
  "未": "wèi",
  "蔚": "wèi",
  "味": "wèi",
  "畏": "wèi",
  "胃": "wèi",
  "喂": "wèi",
  "魏": "wèi",
  "位": "wèi",
  "渭": "wèi",
  "谓": "wèi",
  "尉": "wèi",
  "慰": "wèi",
  "卫": "wèi",
  "瘟": "wēn",
  "温": "wēn",
  "蚊": "wén",
  "文": "wén",
  "闻": "wén",
  "纹": "wén",
  "吻": "wěn",
  "稳": "wěn",
  "紊": "wěn",
  "问": "wèn",
  "嗡": "wēng",
  "翁": "wēng",
  "瓮": "wèng",
  "挝": "wō",
  "蜗": "wō",
  "涡": "wō",
  "窝": "wō",
  "我": "wǒ",
  "斡": "wò",
  "卧": "wò",
  "握": "wò",
  "沃": "wò",
  "巫": "wū",
  "呜": "wū",
  "钨": "wū",
  "乌": "wū",
  "污": "wū",
  "诬": "wū",
  "屋": "wū",
  "无": "wú",
  "芜": "wú",
  "梧": "wú",
  "吾": "wú",
  "吴": "wú",
  "毋": "wú",
  "武": "wǔ",
  "五": "wǔ",
  "捂": "wǔ",
  "午": "wǔ",
  "舞": "wǔ",
  "伍": "wǔ",
  "侮": "wǔ",
  "坞": "wù",
  "戊": "wù",
  "雾": "wù",
  "晤": "wù",
  "物": "wù",
  "勿": "wù",
  "务": "wù",
  "悟": "wù",
  "误": "wù",
  "昔": "xī",
  "熙": "xī",
  "析": "xī",
  "西": "xī",
  "硒": "xī",
  "矽": "xī",
  "晰": "xī",
  "嘻": "xī",
  "吸": "xī",
  "锡": "xī",
  "牺": "xī",
  "稀": "xī",
  "息": "xī",
  "希": "xī",
  "悉": "xī",
  "膝": "xī",
  "夕": "xī",
  "惜": "xī",
  "熄": "xī",
  "烯": "xī",
  "溪": "xī",
  "汐": "xī",
  "犀": "xī",
  "檄": "xí",
  "袭": "xí",
  "席": "xí",
  "习": "xí",
  "媳": "xí",
  "喜": "xǐ",
  "铣": "xǐ",
  "洗": "xǐ",
  "系": "xì",
  "隙": "xì",
  "戏": "xì",
  "细": "xì",
  "瞎": "xiā",
  "虾": "xiā",
  "匣": "xiá",
  "霞": "xiá",
  "辖": "xiá",
  "暇": "xiá",
  "峡": "xiá",
  "侠": "xiá",
  "狭": "xiá",
  "下": "xià",
  "厦": "shà",
  "夏": "xià",
  "吓": "xià",
  "掀": "xiān",
  "锨": "xiān",
  "先": "xiān",
  "仙": "xiān",
  "鲜": "xiān",
  "纤": "xiān",
  "咸": "xián",
  "贤": "xián",
  "衔": "xián",
  "舷": "xián",
  "闲": "xián",
  "涎": "xián",
  "弦": "xián",
  "嫌": "xián",
  "显": "xiǎn",
  "险": "xiǎn",
  "现": "xiàn",
  "献": "xiàn",
  "县": "xiàn",
  "腺": "xiàn",
  "馅": "xiàn",
  "羡": "xiàn",
  "宪": "xiàn",
  "陷": "xiàn",
  "限": "xiàn",
  "线": "xiàn",
  "相": "xiāng",
  "厢": "xiāng",
  "镶": "xiāng",
  "香": "xiāng",
  "箱": "xiāng",
  "襄": "xiāng",
  "湘": "xiāng",
  "乡": "xiāng",
  "翔": "xiáng",
  "祥": "xiáng",
  "详": "xiáng",
  "想": "xiǎng",
  "响": "xiǎng",
  "享": "xiǎng",
  "项": "xiàng",
  "巷": "xiàng",
  "橡": "xiàng",
  "像": "xiàng",
  "向": "xiàng",
  "象": "xiàng",
  "萧": "xiāo",
  "硝": "xiāo",
  "霄": "xiāo",
  "削": "xuē",
  "哮": "xiāo",
  "嚣": "xiāo",
  "销": "xiāo",
  "消": "xiāo",
  "宵": "xiāo",
  "淆": "xiáo",
  "晓": "xiǎo",
  "小": "xiǎo",
  "孝": "xiào",
  "校": "xiào",
  "肖": "xiāo",
  "啸": "xiào",
  "笑": "xiào",
  "效": "xiào",
  "楔": "xiē",
  "些": "xiē",
  "歇": "xiē",
  "蝎": "xiē",
  "鞋": "xié",
  "协": "xié",
  "挟": "xiā",
  "携": "xié",
  "邪": "xié",
  "斜": "xié",
  "胁": "xié",
  "谐": "xié",
  "写": "xiě",
  "械": "xiè",
  "卸": "xiè",
  "蟹": "xiè",
  "懈": "xiè",
  "泄": "xiè",
  "泻": "xiè",
  "谢": "xiè",
  "屑": "xiè",
  "薪": "xīn",
  "芯": "xīn",
  "锌": "xīn",
  "欣": "xīn",
  "辛": "xīn",
  "新": "xīn",
  "忻": "xīn",
  "心": "xīn",
  "信": "xìn",
  "衅": "xìn",
  "星": "xīng",
  "腥": "xīng",
  "猩": "xīng",
  "惺": "xīng",
  "兴": "xīng",
  "刑": "xíng",
  "型": "xíng",
  "形": "xíng",
  "邢": "xíng",
  "行": "xíng",
  "醒": "xǐng",
  "幸": "xìng",
  "杏": "xìng",
  "性": "xìng",
  "姓": "xìng",
  "兄": "xiōng",
  "凶": "xiōng",
  "胸": "xiōng",
  "匈": "xiōng",
  "汹": "xiōng",
  "雄": "xióng",
  "熊": "xióng",
  "休": "xiū",
  "修": "xiū",
  "羞": "xiū",
  "朽": "xiǔ",
  "嗅": "xiù",
  "锈": "xiù",
  "秀": "xiù",
  "袖": "xiù",
  "绣": "xiù",
  "墟": "xū",
  "戌": "xū",
  "需": "xū",
  "虚": "xū",
  "嘘": "xū",
  "须": "xū",
  "徐": "xú",
  "许": "xǔ",
  "蓄": "xù",
  "酗": "xù",
  "叙": "xù",
  "旭": "xù",
  "序": "xù",
  "畜": "chù",
  "恤": "xù",
  "絮": "xù",
  "婿": "xù",
  "绪": "xù",
  "续": "xù",
  "轩": "xuān",
  "喧": "xuān",
  "宣": "xuān",
  "悬": "xuán",
  "旋": "xuán",
  "玄": "xuán",
  "选": "xuǎn",
  "癣": "xuǎn",
  "眩": "xuàn",
  "绚": "xuàn",
  "靴": "xuē",
  "薛": "xuē",
  "学": "xué",
  "穴": "xué",
  "雪": "xuě",
  "血": "xuè",
  "勋": "xūn",
  "熏": "xūn",
  "循": "xún",
  "旬": "xún",
  "询": "xún",
  "寻": "xún",
  "驯": "xùn",
  "巡": "xún",
  "殉": "xùn",
  "汛": "xùn",
  "训": "xùn",
  "讯": "xùn",
  "逊": "xùn",
  "迅": "xùn",
  "压": "yā",
  "押": "yā",
  "鸦": "yā",
  "鸭": "yā",
  "呀": "ya",
  "丫": "yā",
  "芽": "yá",
  "牙": "yá",
  "蚜": "yá",
  "崖": "yá",
  "衙": "yá",
  "涯": "yá",
  "雅": "yǎ",
  "哑": "yǎ",
  "亚": "yà",
  "讶": "yà",
  "焉": "yān",
  "咽": "yān",
  "阉": "yān",
  "烟": "yān",
  "淹": "yān",
  "盐": "yán",
  "严": "yán",
  "研": "yán",
  "蜒": "yán",
  "岩": "yán",
  "延": "yán",
  "言": "yán",
  "颜": "yán",
  "阎": "yán",
  "炎": "yán",
  "沿": "yán",
  "奄": "yǎn",
  "掩": "yǎn",
  "眼": "yǎn",
  "衍": "yǎn",
  "演": "yǎn",
  "艳": "yàn",
  "堰": "yàn",
  "燕": "yàn",
  "厌": "yàn",
  "砚": "yàn",
  "雁": "yàn",
  "唁": "yàn",
  "彦": "yàn",
  "焰": "yàn",
  "宴": "yàn",
  "谚": "yàn",
  "验": "yàn",
  "殃": "yāng",
  "央": "yāng",
  "鸯": "yāng",
  "秧": "yāng",
  "杨": "yáng",
  "扬": "yáng",
  "佯": "yáng",
  "疡": "yáng",
  "羊": "yáng",
  "洋": "yáng",
  "阳": "yáng",
  "氧": "yǎng",
  "仰": "yǎng",
  "痒": "yǎng",
  "养": "yǎng",
  "样": "yàng",
  "漾": "yàng",
  "邀": "yāo",
  "腰": "yāo",
  "妖": "yāo",
  "瑶": "yáo",
  "摇": "yáo",
  "尧": "yáo",
  "遥": "yáo",
  "窑": "yáo",
  "谣": "yáo",
  "姚": "yáo",
  "咬": "yǎo",
  "舀": "yǎo",
  "药": "yào",
  "要": "yào",
  "耀": "yào",
  "椰": "yē",
  "噎": "yē",
  "耶": "yē",
  "爷": "yé",
  "野": "yě",
  "冶": "yě",
  "也": "yě",
  "页": "yè",
  "掖": "yè",
  "业": "yè",
  "叶": "yè",
  "曳": "yè",
  "腋": "yè",
  "夜": "yè",
  "液": "yè",
  "一": "yī",
  "壹": "yī",
  "医": "yī",
  "揖": "yī",
  "铱": "yī",
  "依": "yī",
  "伊": "yī",
  "衣": "yī",
  "颐": "yí",
  "夷": "yí",
  "遗": "yí",
  "移": "yí",
  "仪": "yí",
  "胰": "yí",
  "疑": "yí",
  "沂": "yí",
  "宜": "yí",
  "姨": "yí",
  "彝": "yí",
  "椅": "yǐ",
  "蚁": "yǐ",
  "倚": "yǐ",
  "已": "yǐ",
  "乙": "yǐ",
  "矣": "yǐ",
  "以": "yǐ",
  "艺": "yì",
  "抑": "yì",
  "易": "yì",
  "邑": "yì",
  "屹": "yì",
  "亿": "yì",
  "役": "yì",
  "臆": "yì",
  "逸": "yì",
  "肄": "yì",
  "疫": "yì",
  "亦": "yì",
  "裔": "yì",
  "意": "yì",
  "毅": "yì",
  "忆": "yì",
  "义": "yì",
  "益": "yì",
  "溢": "yì",
  "诣": "yì",
  "议": "yì",
  "谊": "yì",
  "译": "yì",
  "异": "yì",
  "翼": "yì",
  "翌": "yì",
  "绎": "yì",
  "茵": "yīn",
  "荫": "yīn",
  "因": "yīn",
  "殷": "yīn",
  "音": "yīn",
  "阴": "yīn",
  "姻": "yīn",
  "吟": "yín",
  "银": "yín",
  "淫": "yín",
  "寅": "yín",
  "饮": "yǐn",
  "尹": "yǐn",
  "引": "yǐn",
  "隐": "yǐn",
  "印": "yìn",
  "英": "yīng",
  "樱": "yīng",
  "婴": "yīng",
  "鹰": "yīng",
  "应": "yīng",
  "缨": "yīng",
  "莹": "yíng",
  "萤": "yíng",
  "营": "yíng",
  "荧": "yíng",
  "蝇": "yíng",
  "迎": "yíng",
  "赢": "yíng",
  "瀛": "yíng",
  "盈": "yíng",
  "影": "yǐng",
  "颖": "yǐng",
  "硬": "yìng",
  "映": "yìng",
  "哟": "yō",
  "拥": "yōng",
  "佣": "yòng",
  "臃": "yōng",
  "痈": "yōng",
  "庸": "yōng",
  "雍": "yōng",
  "踊": "yǒng",
  "蛹": "yǒng",
  "咏": "yǒng",
  "泳": "yǒng",
  "涌": "yǒng",
  "永": "yǒng",
  "恿": "yǒng",
  "勇": "yǒng",
  "用": "yòng",
  "幽": "yōu",
  "优": "yōu",
  "悠": "yōu",
  "忧": "yōu",
  "尤": "yóu",
  "由": "yóu",
  "邮": "yóu",
  "铀": "yóu",
  "犹": "yóu",
  "油": "yóu",
  "游": "yóu",
  "酉": "yǒu",
  "有": "yǒu",
  "友": "yǒu",
  "右": "yòu",
  "佑": "yòu",
  "釉": "yòu",
  "诱": "yòu",
  "又": "yòu",
  "幼": "yòu",
  "迂": "yū",
  "淤": "yū",
  "于": "yú",
  "盂": "yú",
  "榆": "yú",
  "虞": "yú",
  "愚": "yú",
  "舆": "yú",
  "余": "yú",
  "俞": "yú",
  "逾": "yú",
  "鱼": "yú",
  "愉": "yú",
  "渝": "yú",
  "渔": "yú",
  "隅": "yú",
  "予": "yǔ",
  "娱": "yú",
  "雨": "yǔ",
  "与": "yǔ",
  "屿": "yǔ",
  "禹": "yǔ",
  "宇": "yǔ",
  "语": "yǔ",
  "羽": "yǔ",
  "煜": "yù",
  "玉": "yù",
  "域": "yù",
  "芋": "yù",
  "郁": "yù",
  "吁": "yù",
  "遇": "yù",
  "喻": "yù",
  "峪": "yù",
  "御": "yù",
  "愈": "yù",
  "欲": "yù",
  "狱": "yù",
  "育": "yù",
  "誉": "yù",
  "浴": "yù",
  "寓": "yù",
  "裕": "yù",
  "预": "yù",
  "豫": "yù",
  "驭": "yù",
  "鸳": "yuān",
  "渊": "yuān",
  "冤": "yuān",
  "元": "yuán",
  "垣": "yuán",
  "袁": "yuán",
  "原": "yuán",
  "援": "yuán",
  "辕": "yuán",
  "园": "yuán",
  "员": "yuán",
  "圆": "yuán",
  "猿": "yuán",
  "源": "yuán",
  "缘": "yuán",
  "远": "yuǎn",
  "苑": "yuàn",
  "愿": "yuàn",
  "怨": "yuàn",
  "院": "yuàn",
  "曰": "yuē",
  "约": "yuē",
  "越": "yuè",
  "跃": "yuè",
  "钥": "yào",
  "岳": "yuè",
  "粤": "yuè",
  "月": "yuè",
  "悦": "yuè",
  "阅": "yuè",
  "耘": "yún",
  "云": "yún",
  "郧": "yún",
  "匀": "yún",
  "陨": "yǔn",
  "允": "yǔn",
  "运": "yùn",
  "蕴": "yùn",
  "酝": "yùn",
  "晕": "yūn",
  "韵": "yùn",
  "孕": "yùn",
  "匝": "zā",
  "砸": "zá",
  "杂": "zá",
  "栽": "zāi",
  "哉": "zāi",
  "灾": "zāi",
  "宰": "zǎi",
  "载": "zǎi",
  "再": "zài",
  "在": "zài",
  "咱": "zán",
  "攒": "zǎn",
  "暂": "zàn",
  "赞": "zàn",
  "赃": "zāng",
  "脏": "zāng",
  "葬": "zàng",
  "遭": "zāo",
  "糟": "zāo",
  "凿": "záo",
  "藻": "zǎo",
  "枣": "zǎo",
  "早": "zǎo",
  "澡": "zǎo",
  "蚤": "zǎo",
  "躁": "zào",
  "噪": "zào",
  "造": "zào",
  "皂": "zào",
  "灶": "zào",
  "燥": "zào",
  "迮": "zé",
  "责": "zé",
  "择": "zé",
  "则": "zé",
  "泽": "zé",
  "贼": "zéi",
  "怎": "zěn",
  "增": "zēng",
  "憎": "zēng",
  "曾": "céng",
  "赠": "zèng",
  "扎": "zhā",
  "喳": "zhā",
  "渣": "zhā",
  "札": "zhá",
  "轧": "zhá",
  "铡": "zhá",
  "闸": "zhá",
  "眨": "zhǎ",
  "栅": "shān",
  "榨": "zhà",
  "咋": "zǎ",
  "乍": "zhà",
  "炸": "zhà",
  "诈": "zhà",
  "摘": "zhāi",
  "斋": "zhāi",
  "宅": "zhái",
  "窄": "zhǎi",
  "债": "zhai",
  "寨": "zhai",
  "瞻": "zhān",
  "毡": "zhān",
  "詹": "zhān",
  "粘": "zhān",
  "沾": "zhān",
  "盏": "zhǎn",
  "斩": "zhǎn",
  "辗": "niǎn",
  "崭": "zhǎn",
  "展": "zhǎn",
  "蘸": "zhàn",
  "栈": "zhàn",
  "占": "zhàn",
  "战": "zhàn",
  "站": "zhàn",
  "湛": "zhàn",
  "绽": "zhàn",
  "樟": "zhāng",
  "章": "zhāng",
  "彰": "zhāng",
  "漳": "zhāng",
  "张": "zhāng",
  "掌": "zhǎng",
  "涨": "zhǎng",
  "杖": "zhàng",
  "丈": "zhàng",
  "帐": "zhàng",
  "账": "zhàng",
  "仗": "zhàng",
  "胀": "zhàng",
  "瘴": "zhàng",
  "障": "zhàng",
  "招": "zhāo",
  "昭": "zhāo",
  "找": "zhǎo",
  "沼": "zhǎo",
  "赵": "zhào",
  "照": "zhào",
  "罩": "zhào",
  "兆": "zhào",
  "肇": "zhào",
  "召": "zhào",
  "遮": "zhē",
  "折": "shé",
  "哲": "zhé",
  "蛰": "zhé",
  "辙": "zhé",
  "者": "zhě",
  "锗": "zhě",
  "蔗": "zhè",
  "这": "zhè",
  "浙": "zhè",
  "珍": "zhēn",
  "斟": "zhēn",
  "真": "zhēn",
  "甄": "zhēn",
  "砧": "zhēn",
  "臻": "zhēn",
  "贞": "zhēn",
  "针": "zhēn",
  "侦": "zhēn",
  "枕": "zhěn",
  "疹": "zhěn",
  "诊": "zhěn",
  "震": "zhèn",
  "振": "zhèn",
  "镇": "zhèn",
  "阵": "zhèn",
  "蒸": "zhēng",
  "挣": "zhèng",
  "睁": "zhēng",
  "征": "zhēng",
  "狰": "zhēng",
  "争": "zhēng",
  "怔": "zhēng",
  "整": "zhěng",
  "拯": "zhěng",
  "正": "zhèng",
  "政": "zhèng",
  "帧": "zhēn",
  "症": "zhèng",
  "郑": "zhèng",
  "证": "zhèng",
  "芝": "zhī",
  "枝": "zhī",
  "支": "zhī",
  "吱": "zī",
  "蜘": "zhī",
  "知": "zhī",
  "肢": "zhī",
  "脂": "zhī",
  "汁": "zhī",
  "之": "zhī",
  "织": "zhī",
  "职": "zhí",
  "直": "zhí",
  "植": "zhí",
  "殖": "zhí",
  "执": "zhí",
  "值": "zhí",
  "侄": "zhí",
  "址": "zhǐ",
  "指": "zhǐ",
  "止": "zhǐ",
  "趾": "zhǐ",
  "只": "zhī",
  "旨": "zhǐ",
  "纸": "zhǐ",
  "志": "zhì",
  "挚": "zhì",
  "掷": "zhì",
  "至": "zhì",
  "致": "zhì",
  "置": "zhì",
  "帜": "zhì",
  "峙": "zhì",
  "制": "zhì",
  "智": "zhì",
  "秩": "zhì",
  "稚": "zhì",
  "质": "zhì",
  "炙": "zhì",
  "痔": "zhì",
  "滞": "zhì",
  "治": "zhì",
  "窒": "zhì",
  "中": "zhōng",
  "盅": "zhōng",
  "忠": "zhōng",
  "钟": "zhōng",
  "衷": "zhōng",
  "终": "zhōng",
  "种": "zhǒng",
  "肿": "zhǒng",
  "重": "zhòng",
  "仲": "zhòng",
  "众": "zhòng",
  "舟": "zhōu",
  "周": "zhōu",
  "州": "zhōu",
  "洲": "zhōu",
  "诌": "zhōu",
  "粥": "zhōu",
  "轴": "zhóu",
  "肘": "zhǒu",
  "帚": "zhǒu",
  "咒": "zhòu",
  "皱": "zhòu",
  "宙": "zhòu",
  "昼": "zhòu",
  "骤": "zhòu",
  "珠": "zhū",
  "株": "zhū",
  "蛛": "zhū",
  "朱": "zhū",
  "猪": "zhū",
  "诸": "zhū",
  "诛": "zhū",
  "逐": "zhú",
  "竹": "zhú",
  "烛": "zhú",
  "煮": "zhǔ",
  "拄": "zhǔ",
  "瞩": "zhǔ",
  "嘱": "zhǔ",
  "主": "zhǔ",
  "著": "zhù",
  "柱": "zhù",
  "助": "zhù",
  "蛀": "zhù",
  "贮": "zhù",
  "铸": "zhù",
  "筑": "zhù",
  "住": "zhù",
  "注": "zhù",
  "祝": "zhù",
  "驻": "zhù",
  "抓": "zhuā",
  "爪": "zhǎo",
  "拽": "zhuài",
  "专": "zhuān",
  "砖": "zhuān",
  "转": "zhuǎn",
  "撰": "zhuàn",
  "赚": "zuàn",
  "篆": "zhuàn",
  "桩": "zhuāng",
  "庄": "zhuāng",
  "装": "zhuāng",
  "妆": "zhuāng",
  "撞": "zhuàng",
  "壮": "zhuàng",
  "状": "zhuàng",
  "椎": "zhuī",
  "锥": "zhuī",
  "追": "zhuī",
  "赘": "zhuì",
  "坠": "zhuì",
  "缀": "zhuì",
  "谆": "zhūn",
  "准": "zhǔn",
  "捉": "zhuō",
  "拙": "zhuō",
  "卓": "zhuó",
  "桌": "zhuō",
  "琢": "zhuó",
  "茁": "zhuó",
  "酌": "zhuó",
  "啄": "zhuó",
  "着": "zhe",
  "灼": "zhuó",
  "浊": "zhuó",
  "兹": "zī",
  "咨": "zī",
  "资": "zī",
  "姿": "zī",
  "滋": "zī",
  "淄": "zī",
  "孜": "zī",
  "紫": "zǐ",
  "仔": "zǎi",
  "籽": "zǐ",
  "滓": "zǐ",
  "子": "zǐ",
  "自": "zì",
  "渍": "zì",
  "字": "zì",
  "鬃": "zōng",
  "棕": "zōng",
  "踪": "zōng",
  "宗": "zōng",
  "综": "zōng",
  "总": "zǒng",
  "纵": "zòng",
  "邹": "zōu",
  "走": "zǒu",
  "奏": "zòu",
  "揍": "zòu",
  "租": "zū",
  "足": "zú",
  "卒": "zú",
  "族": "zú",
  "祖": "zǔ",
  "诅": "zǔ",
  "阻": "zǔ",
  "组": "zǔ",
  "钻": "zuàn",
  "纂": "zuǎn",
  "嘴": "zuǐ",
  "醉": "zuì",
  "最": "zuì",
  "罪": "zuì",
  "尊": "zūn",
  "遵": "zūn",
  "昨": "zuó",
  "左": "zuǒ",
  "佐": "zuǒ",
  "柞": "zhà",
  "做": "zuò",
  "作": "zuò",
  "坐": "zuò",
  "座": "zuò"
};

/***********工具***************/
//浏览器类型判断

function browserFlag() {
  var Sys = {};
  var ua = navigator.userAgent.toLowerCase();
  var s;
  Sys.ie = false;
  Sys.firefox = false;
  Sys.chrome = false;
  Sys.opera = false;
  Sys.safari = false;
  (s = ua.match(/msie ([\d.]+)/)) ? Sys.ie = s[1]:
    (s = ua.match(/firefox\/([\d.]+)/)) ? Sys.firefox = s[1] :
    (s = ua.match(/chrome\/([\d.]+)/)) ? Sys.chrome = s[1] :
    (s = ua.match(/opera.([\d.]+)/)) ? Sys.opera = s[1] :
    (s = ua.match(/version\/([\d.]+).*safari/)) ? Sys.safari = s[1] : 0;
  return Sys;
}
//给某些元素添加 ARIA无障碍网页应用属性 【role 属性值】
function ariaRole() {
  var addElementRole=['button','checkbox','option','radio','input','h1','h2','h3','h4','h5','h6','div','p']// input[type = button],input[type = checkbox],input[type = file],input[type = image],input[type = radio]
  addElementRole.forEach(function(item,index){
    $(item).each(function (){
      // 元素所在的状态 ['aria-checked', 'aria-disabled', 'aria-expanded', 'aria-hidden', 'aria-invalid', 'aria-pressed', 'aria-selected']
      $(this).attr('aria-disabled', $(this).attr('disabled'))
      $(this).attr('aria-max', $(this).attr('max')) //某个元素最大值 
      $(this).attr('aria-min', $(this).attr('min')) //某个元素最小值 
      $(this).attr('aria-valuenow', $(this).attr('value'))//某个元素 当前值
      $(this).attr('aria-autocomplete', $(this).attr('autocomplete'))
      $(this).attr('aria-checked', $(this).attr('checked'))
      $(this).attr('aria-expanded', $(this).attr('open'))// $(this).attr('aria-hidden', $(this).attr('checked')) 对应显示隐藏$(this).attr('aria-invalid', $(this).attr('invalid')) $(this).attr('aria-pressed', $(this).attr('pressed'))// $(this).attr('aria-selected', $(this).attr('selected')) 对应聚焦 元素$(':focus')
      if(item==='input'){// 如果是input模拟的按钮或者其他xxx
        $(this).attr('role', $(this).attr('type'))
        $(this).attr('aria-readonly', $(this).attr('readonly')&&!$(this).attr('readonly')?false:true)//元素readonly
      }else if(item==='h1'||item==='h2'||item==='h3'||item==='h4'||item==='h5'||item==='h6'){//aria-level="2" h1...h6
        $(this).attr('aria-level', item.slice(1))
      }else if(item==='div'){//如果是区块导航模块
        if($(this).attr('ergodic')){
          $(this).attr('aria-region', true)
          $(this).attr('aria-autolabel', true)
          $(this).attr('aria-label', BarrierFreeConfig[$(this).attr('ergodic')+'AreaTitle'])  
        }
      }else if(item==='p'){
        $(this).attr('setedaria', true)
      }else{
        $(this).attr('role', item)
      }
    })
  })
}
//cookie功能--------------------------
//设置cookie//两个参数，一个是cookie的名子，一个是值

function SetCookie(name, value) {
  //此 cookie 将被保存 1 天
  var Days = 1;
  var exp = new Date();
  exp.setTime(exp.getTime() + Days * 24 * 60 * 60 * 1000);
  // document.cookie = name + "=" + escape(value) + ";path: /;expires=" + exp.toGMTString();
  $.cookie(name, value, {
    path: '/',
    expires: exp.toGMTString()
  })
}

//取cookies
function getCookie(name) {
  var arr = document.cookie.match(new RegExp("(^| )" + name + "=([^;]*)(;|$)"));
  if (arr != null) return unescape(arr[2]);
  return null;
}
//删除cookie

function delCookie(name) {
  var exp = new Date();
  exp.setTime(exp.getTime() - 1);
  var cval = getCookie(name);
  // if (cval != null) document.cookie = name + "=" + cval + ";expires=" + exp.toGMTString();
  if (cval != null) {
    $.cookie(name, null, {
      path: '/',
      expires: exp.toGMTString()
    })
  }
}

function getText(element) {
  var elementText;
  if (element.nodeName == "H1" || element.nodeName == "H2" || element.nodeName == "H3" || element.nodeName == "H4" || element.nodeName == "H5" || element.nodeName == "H6")

  {
    element = element.firstChild;
  }
  if (element.nodeName == "#text") {
    elementText = thisElement.nodeValue;
  } else if (element.nodeName == "IMG") {
    if (element.getAttribute("alt")) {
      elementText = element.getAttribute("alt");
    } else if (element.getAttribute("title")) {
      elementText = element.getAttribute("title");
    } else {
      elementText = document.title;
    }
  } else {
    elementText = element.innerText || element.textContent;
  }
  return elementText;
}

// 简繁转换方法

function JTPYStr() {
  return '万与丑专业丛东丝丢两严丧个丬丰临为丽举么义乌乐乔习乡书买乱争于亏云亘亚产亩亲亵亸亿仅从仑仓仪们价众优伙会伛伞伟传伤伥伦伧伪伫体余佣佥侠侣侥侦侧侨侩侪侬俣俦俨俩俪俭债倾偬偻偾偿傥傧储傩儿兑兖党兰关兴兹养兽冁内冈册写军农冢冯冲决况冻净凄凉凌减凑凛几凤凫凭凯击凼凿刍划刘则刚创删别刬刭刽刿剀剂剐剑剥剧劝办务劢动励劲劳势勋勐勚匀匦匮区医华协单卖卢卤卧卫却卺厂厅历厉压厌厍厕厢厣厦厨厩厮县参叆叇双发变叙叠叶号叹叽吁后吓吕吗吣吨听启吴呒呓呕呖呗员呙呛呜咏咔咙咛咝咤咴咸哌响哑哒哓哔哕哗哙哜哝哟唛唝唠唡唢唣唤唿啧啬啭啮啰啴啸喷喽喾嗫呵嗳嘘嘤嘱噜噼嚣嚯团园囱围囵国图圆圣圹场坂坏块坚坛坜坝坞坟坠垄垅垆垒垦垧垩垫垭垯垱垲垴埘埙埚埝埯堑堕塆墙壮声壳壶壸处备复够头夸夹夺奁奂奋奖奥妆妇妈妩妪妫姗姜娄娅娆娇娈娱娲娴婳婴婵婶媪嫒嫔嫱嬷孙学孪宁宝实宠审宪宫宽宾寝对寻导寿将尔尘尧尴尸尽层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岭岳岽岿峃峄峡峣峤峥峦崂崃崄崭嵘嵚嵛嵝嵴巅巩巯币帅师帏帐帘帜带帧帮帱帻帼幂幞干并广庄庆庐庑库应庙庞废庼廪开异弃张弥弪弯弹强归当录彟彦彻径徕御忆忏忧忾怀态怂怃怄怅怆怜总怼怿恋恳恶恸恹恺恻恼恽悦悫悬悭悯惊惧惨惩惫惬惭惮惯愍愠愤愦愿慑慭憷懑懒懔戆戋戏戗战戬户扎扑扦执扩扪扫扬扰抚抛抟抠抡抢护报担拟拢拣拥拦拧拨择挂挚挛挜挝挞挟挠挡挢挣挤挥挦捞损捡换捣据捻掳掴掷掸掺掼揸揽揿搀搁搂搅携摄摅摆摇摈摊撄撑撵撷撸撺擞攒敌敛数斋斓斗斩断无旧时旷旸昙昼昽显晋晒晓晔晕晖暂暧札术朴机杀杂权条来杨杩杰极构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊栋栌栎栏树栖样栾桊桠桡桢档桤桥桦桧桨桩梦梼梾检棂椁椟椠椤椭楼榄榇榈榉槚槛槟槠横樯樱橥橱橹橼檐檩欢欤欧歼殁殇残殒殓殚殡殴毁毂毕毙毡毵氇气氢氩氲汇汉污汤汹沓沟没沣沤沥沦沧沨沩沪沵泞泪泶泷泸泺泻泼泽泾洁洒洼浃浅浆浇浈浉浊测浍济浏浐浑浒浓浔浕涂涌涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渖渗温游湾湿溃溅溆溇滗滚滞滟滠满滢滤滥滦滨滩滪漤潆潇潋潍潜潴澜濑濒灏灭灯灵灾灿炀炉炖炜炝点炼炽烁烂烃烛烟烦烧烨烩烫烬热焕焖焘煅煳熘爱爷牍牦牵牺犊犟状犷犸犹狈狍狝狞独狭狮狯狰狱狲猃猎猕猡猪猫猬献獭玑玙玚玛玮环现玱玺珉珏珐珑珰珲琎琏琐琼瑶瑷璇璎瓒瓮瓯电画畅畲畴疖疗疟疠疡疬疮疯疱疴痈痉痒痖痨痪痫痴瘅瘆瘗瘘瘪瘫瘾瘿癞癣癫癯皑皱皲盏盐监盖盗盘眍眦眬着睁睐睑瞒瞩矫矶矾矿砀码砖砗砚砜砺砻砾础硁硅硕硖硗硙硚确硷碍碛碜碱碹磙礼祎祢祯祷祸禀禄禅离秃秆种积称秽秾稆税稣稳穑穷窃窍窑窜窝窥窦窭竖竞笃笋笔笕笺笼笾筑筚筛筜筝筹签简箓箦箧箨箩箪箫篑篓篮篱簖籁籴类籼粜粝粤粪粮糁糇紧絷纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵罂网罗罚罢罴羁羟羡翘翙翚耢耧耸耻聂聋职聍联聩聪肃肠肤肷肾肿胀胁胆胜胧胨胪胫胶脉脍脏脐脑脓脔脚脱脶脸腊腌腘腭腻腼腽腾膑臜舆舣舰舱舻艰艳艹艺节芈芗芜芦苁苇苈苋苌苍苎苏苘苹茎茏茑茔茕茧荆荐荙荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莅莜莱莲莳莴莶获莸莹莺莼萚萝萤营萦萧萨葱蒇蒉蒋蒌蓝蓟蓠蓣蓥蓦蔷蔹蔺蔼蕲蕴薮藁藓虏虑虚虫虬虮虽虾虿蚀蚁蚂蚕蚝蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蜡蝇蝈蝉蝎蝼蝾螀螨蟏衅衔补衬衮袄袅袆袜袭袯装裆裈裢裣裤裥褛褴襁襕见观觃规觅视觇览觉觊觋觌觍觎觏觐觑觞触觯詟誉誊讠计订讣认讥讦讧讨让讪讫训议讯记讱讲讳讴讵讶讷许讹论讻讼讽设访诀证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赟赠赡赢赣赪赵赶趋趱趸跃跄跖跞践跶跷跸跹跻踊踌踪踬踯蹑蹒蹰蹿躏躜躯车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辞辩辫边辽达迁过迈运还这进远违连迟迩迳迹适选逊递逦逻遗遥邓邝邬邮邹邺邻郁郄郏郐郑郓郦郧郸酝酦酱酽酾酿释里鉅鉴銮錾钆钇针钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铍铎铏铐铑铒铕铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗错锚锜锞锟锠锡锢锣锤锥锦锨锩锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镆镇镈镉镊镌镍镎镏镐镑镒镕镖镗镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲镳镴镶长门闩闪闫闬闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇陈陉陕陧陨险随隐隶隽难雏雠雳雾霁霉霭靓静靥鞑鞒鞯鞴韦韧韨韩韪韫韬韵页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颎颏颐频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风飏飐飑飒飓飔飕飖飗飘飙飚飞飨餍饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋馌馍馎馏馐馑馒馓馔馕马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬓魇魉鱼鱽鱾鱿鲀鲁鲂鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳛鳜鳝鳞鳟鳠鳡鳢鳣鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹯鹰鹱鹲鹳鹴鹾麦麸黄黉黡黩黪黾鼋鼌鼍鼗鼹齄齐齑齿龀龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟志制咨只里系范松没尝尝闹面准钟别闲干尽脏婷姝';
}

function FTPYStr() {
  return '萬與醜專業叢東絲丟兩嚴喪個爿豐臨為麗舉麼義烏樂喬習鄉書買亂爭於虧雲亙亞產畝親褻嚲億僅從侖倉儀們價眾優夥會傴傘偉傳傷倀倫傖偽佇體餘傭僉俠侶僥偵側僑儈儕儂俁儔儼倆儷儉債傾傯僂僨償儻儐儲儺兒兌兗黨蘭關興茲養獸囅內岡冊寫軍農塚馮衝決況凍淨淒涼淩減湊凜幾鳳鳧憑凱擊氹鑿芻劃劉則剛創刪別剗剄劊劌剴劑剮劍剝劇勸辦務勱動勵勁勞勢勳猛勩勻匭匱區醫華協單賣盧鹵臥衛卻巹廠廳曆厲壓厭厙廁廂厴廈廚廄廝縣參靉靆雙發變敘疊葉號歎嘰籲後嚇呂嗎唚噸聽啟吳嘸囈嘔嚦唄員咼嗆嗚詠哢嚨嚀噝吒噅鹹呱響啞噠嘵嗶噦嘩噲嚌噥喲嘜嗊嘮啢嗩唕喚呼嘖嗇囀齧囉嘽嘯噴嘍嚳囁嗬噯噓嚶囑嚕劈囂謔團園囪圍圇國圖圓聖壙場阪壞塊堅壇壢壩塢墳墜壟壟壚壘墾坰堊墊埡墶壋塏堖塒塤堝墊垵塹墮壪牆壯聲殼壺壼處備複夠頭誇夾奪奩奐奮獎奧妝婦媽嫵嫗媯姍薑婁婭嬈嬌孌娛媧嫻嫿嬰嬋嬸媼嬡嬪嬙嬤孫學孿寧寶實寵審憲宮寬賓寢對尋導壽將爾塵堯尷屍盡層屭屜屆屬屢屨嶼歲豈嶇崗峴嶴嵐島嶺嶽崠巋嶨嶧峽嶢嶠崢巒嶗崍嶮嶄嶸嶔崳嶁脊巔鞏巰幣帥師幃帳簾幟帶幀幫幬幘幗冪襆幹並廣莊慶廬廡庫應廟龐廢廎廩開異棄張彌弳彎彈強歸當錄彠彥徹徑徠禦憶懺憂愾懷態慫憮慪悵愴憐總懟懌戀懇惡慟懨愷惻惱惲悅愨懸慳憫驚懼慘懲憊愜慚憚慣湣慍憤憒願懾憖怵懣懶懍戇戔戲戧戰戩戶紮撲扡執擴捫掃揚擾撫拋摶摳掄搶護報擔擬攏揀擁攔擰撥擇掛摯攣掗撾撻挾撓擋撟掙擠揮撏撈損撿換搗據撚擄摑擲撣摻摜摣攬撳攙擱摟攪攜攝攄擺搖擯攤攖撐攆擷擼攛擻攢敵斂數齋斕鬥斬斷無舊時曠暘曇晝曨顯晉曬曉曄暈暉暫曖劄術樸機殺雜權條來楊榪傑極構樅樞棗櫪梘棖槍楓梟櫃檸檉梔柵標棧櫛櫳棟櫨櫟欄樹棲樣欒棬椏橈楨檔榿橋樺檜槳樁夢檮棶檢欞槨櫝槧欏橢樓欖櫬櫚櫸檟檻檳櫧橫檣櫻櫫櫥櫓櫞簷檁歡歟歐殲歿殤殘殞殮殫殯毆毀轂畢斃氈毿氌氣氫氬氳彙漢汙湯洶遝溝沒灃漚瀝淪滄渢溈滬濔濘淚澩瀧瀘濼瀉潑澤涇潔灑窪浹淺漿澆湞溮濁測澮濟瀏滻渾滸濃潯濜塗湧濤澇淶漣潿渦溳渙滌潤澗漲澀澱淵淥漬瀆漸澠漁瀋滲溫遊灣濕潰濺漵漊潷滾滯灩灄滿瀅濾濫灤濱灘澦濫瀠瀟瀲濰潛瀦瀾瀨瀕灝滅燈靈災燦煬爐燉煒熗點煉熾爍爛烴燭煙煩燒燁燴燙燼熱煥燜燾煆糊溜愛爺牘犛牽犧犢強狀獷獁猶狽麅獮獰獨狹獅獪猙獄猻獫獵獼玀豬貓蝟獻獺璣璵瑒瑪瑋環現瑲璽瑉玨琺瓏璫琿璡璉瑣瓊瑤璦璿瓔瓚甕甌電畫暢佘疇癤療瘧癘瘍鬁瘡瘋皰屙癰痙癢瘂癆瘓癇癡癉瘮瘞瘺癟癱癮癭癩癬癲臒皚皺皸盞鹽監蓋盜盤瞘眥矓著睜睞瞼瞞矚矯磯礬礦碭碼磚硨硯碸礪礱礫礎硜矽碩硤磽磑礄確鹼礙磧磣堿镟滾禮禕禰禎禱禍稟祿禪離禿稈種積稱穢穠穭稅穌穩穡窮竊竅窯竄窩窺竇窶豎競篤筍筆筧箋籠籩築篳篩簹箏籌簽簡籙簀篋籜籮簞簫簣簍籃籬籪籟糴類秈糶糲粵糞糧糝餱緊縶糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紖紐紓線紺絏紱練組紳細織終縐絆紼絀紹繹經紿綁絨結絝繞絰絎繪給絢絳絡絕絞統綆綃絹繡綌綏絛繼綈績緒綾緓續綺緋綽緔緄繩維綿綬繃綢綯綹綣綜綻綰綠綴緇緙緗緘緬纜緹緲緝縕繢緦綞緞緶線緱縋緩締縷編緡緣縉縛縟縝縫縗縞纏縭縊縑繽縹縵縲纓縮繆繅纈繚繕繒韁繾繰繯繳纘罌網羅罰罷羆羈羥羨翹翽翬耮耬聳恥聶聾職聹聯聵聰肅腸膚膁腎腫脹脅膽勝朧腖臚脛膠脈膾髒臍腦膿臠腳脫腡臉臘醃膕齶膩靦膃騰臏臢輿艤艦艙艫艱豔艸藝節羋薌蕪蘆蓯葦藶莧萇蒼苧蘇檾蘋莖蘢蔦塋煢繭荊薦薘莢蕘蓽蕎薈薺蕩榮葷滎犖熒蕁藎蓀蔭蕒葒葤藥蒞蓧萊蓮蒔萵薟獲蕕瑩鶯蓴蘀蘿螢營縈蕭薩蔥蕆蕢蔣蔞藍薊蘺蕷鎣驀薔蘞藺藹蘄蘊藪槁蘚虜慮虛蟲虯蟣雖蝦蠆蝕蟻螞蠶蠔蜆蠱蠣蟶蠻蟄蛺蟯螄蠐蛻蝸蠟蠅蟈蟬蠍螻蠑螿蟎蠨釁銜補襯袞襖嫋褘襪襲襏裝襠褌褳襝褲襇褸襤繈襴見觀覎規覓視覘覽覺覬覡覿覥覦覯覲覷觴觸觶讋譽謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥許訛論訩訟諷設訪訣證詁訶評詛識詗詐訴診詆謅詞詘詔詖譯詒誆誄試詿詩詰詼誠誅詵話誕詬詮詭詢詣諍該詳詫諢詡譸誡誣語誚誤誥誘誨誑說誦誒請諸諏諾讀諑誹課諉諛誰諗調諂諒諄誶談誼謀諶諜謊諫諧謔謁謂諤諭諼讒諮諳諺諦謎諞諝謨讜謖謝謠謗諡謙謐謹謾謫譾謬譚譖譙讕譜譎讞譴譫讖穀豶貝貞負貟貢財責賢敗賬貨質販貪貧貶購貯貫貳賤賁貰貼貴貺貸貿費賀貽賊贄賈賄貲賃賂贓資賅贐賕賑賚賒賦賭齎贖賞賜贔賙賡賠賧賴賵贅賻賺賽賾贗讚贇贈贍贏贛赬趙趕趨趲躉躍蹌蹠躒踐躂蹺蹕躚躋踴躊蹤躓躑躡蹣躕躥躪躦軀車軋軌軒軑軔轉軛輪軟轟軲軻轤軸軹軼軤軫轢軺輕軾載輊轎輈輇輅較輒輔輛輦輩輝輥輞輬輟輜輳輻輯轀輸轡轅轄輾轆轍轔辭辯辮邊遼達遷過邁運還這進遠違連遲邇逕跡適選遜遞邐邏遺遙鄧鄺鄔郵鄒鄴鄰鬱郤郟鄶鄭鄆酈鄖鄲醞醱醬釅釃釀釋裏钜鑒鑾鏨釓釔針釘釗釙釕釷釺釧釤鈒釩釣鍆釹鍚釵鈃鈣鈈鈦鈍鈔鍾鈉鋇鋼鈑鈐鑰欽鈞鎢鉤鈧鈁鈥鈄鈕鈀鈺錢鉦鉗鈷缽鈳鉕鈽鈸鉞鑽鉬鉭鉀鈿鈾鐵鉑鈴鑠鉛鉚鈰鉉鉈鉍鈹鐸鉶銬銠鉺銪鋏鋣鐃銍鐺銅鋁銱銦鎧鍘銖銑鋌銩銛鏵銓鉿銚鉻銘錚銫鉸銥鏟銃鐋銨銀銣鑄鐒鋪鋙錸鋱鏈鏗銷鎖鋰鋥鋤鍋鋯鋨鏽銼鋝鋒鋅鋶鐦鐧銳銻鋃鋟鋦錒錆鍺錯錨錡錁錕錩錫錮鑼錘錐錦鍁錈錇錟錠鍵鋸錳錙鍥鍈鍇鏘鍶鍔鍤鍬鍾鍛鎪鍠鍰鎄鍍鎂鏤鎡鏌鎮鎛鎘鑷鐫鎳鎿鎦鎬鎊鎰鎔鏢鏜鏍鏰鏞鏡鏑鏃鏇鏐鐔钁鐐鏷鑥鐓鑭鐠鑹鏹鐙鑊鐳鐶鐲鐮鐿鑔鑣鑞鑲長門閂閃閆閈閉問闖閏闈閑閎間閔閌悶閘鬧閨聞闥閩閭闓閥閣閡閫鬮閱閬闍閾閹閶鬩閿閽閻閼闡闌闃闠闊闋闔闐闒闕闞闤隊陽陰陣階際陸隴陳陘陝隉隕險隨隱隸雋難雛讎靂霧霽黴靄靚靜靨韃鞽韉韝韋韌韍韓韙韞韜韻頁頂頃頇項順須頊頑顧頓頎頒頌頏預顱領頗頸頡頰頲頜潁熲頦頤頻頮頹頷頴穎顆題顒顎顓顏額顳顢顛顙顥纇顫顬顰顴風颺颭颮颯颶颸颼颻飀飄飆飆飛饗饜飣饑飥餳飩餼飪飫飭飯飲餞飾飽飼飿飴餌饒餉餄餎餃餏餅餑餖餓餘餒餕餜餛餡館餷饋餶餿饞饁饃餺餾饈饉饅饊饌饢馬馭馱馴馳驅馹駁驢駔駛駟駙駒騶駐駝駑駕驛駘驍罵駰驕驊駱駭駢驫驪騁驗騂駸駿騏騎騍騅騌驌驂騙騭騤騷騖驁騮騫騸驃騾驄驏驟驥驦驤髏髖髕鬢魘魎魚魛魢魷魨魯魴魺鮁鮃鯰鱸鮋鮓鮒鮊鮑鱟鮍鮐鮭鮚鮳鮪鮞鮦鰂鮜鱠鱭鮫鮮鮺鯗鱘鯁鱺鰱鰹鯉鰣鰷鯀鯊鯇鮶鯽鯒鯖鯪鯕鯫鯡鯤鯧鯝鯢鯰鯛鯨鯵鯴鯔鱝鰈鰏鱨鯷鰮鰃鰓鱷鰍鰒鰉鰁鱂鯿鰠鼇鰭鰨鰥鰩鰟鰜鰳鰾鱈鱉鰻鰵鱅鰼鱖鱔鱗鱒鱯鱤鱧鱣鳥鳩雞鳶鳴鳲鷗鴉鶬鴇鴆鴣鶇鸕鴨鴞鴦鴒鴟鴝鴛鴬鴕鷥鷙鴯鴰鵂鴴鵃鴿鸞鴻鵐鵓鸝鵑鵠鵝鵒鷳鵜鵡鵲鶓鵪鶤鵯鵬鵮鶉鶊鵷鷫鶘鶡鶚鶻鶿鶥鶩鷊鷂鶲鶹鶺鷁鶼鶴鷖鸚鷓鷚鷯鷦鷲鷸鷺鸇鷹鸌鸏鸛鸘鹺麥麩黃黌黶黷黲黽黿鼂鼉鞀鼴齇齊齏齒齔齕齗齟齡齙齠齜齦齬齪齲齷龍龔龕龜誌製谘隻裡係範鬆冇嚐嘗鬨麵準鐘彆閒乾儘臟瀛暨煜茆黛惬炜璐迮纾';
}

function Traditionalized(cc) {
  var str = '',
    ss = JTPYStr(),
    tt = FTPYStr();
  for (var i = 0; i < cc.length; i++) {
    if (cc.charCodeAt(i) > 10000 && ss.indexOf(cc.charAt(i)) != -1) str += tt.charAt(ss.indexOf(cc.charAt(i)));
    else str += cc.charAt(i);
  }
  return str;
}

function Simplized(cc) {
  var str = '',
    ss = JTPYStr(),
    tt = FTPYStr();
  for (var i = 0; i < cc.length; i++) {
    if (cc.charCodeAt(i) > 10000 && tt.indexOf(cc.charAt(i)) != -1) str += ss.charAt(tt.indexOf(cc.charAt(i)));
    else str += cc.charAt(i);
  }
  return str;
}

// HashMap
function HashMap() {
  var size = 0;
  var entry = new Object();
  this.put = function (key, value) {
    if (!this.containsKey(key)) {
      size++;
      entry[key] = value;
    }
  }

  this.get = function (key) {
    return this.containsKey(key) ? entry[key] : null;
  }

  this.remove = function (key) {
    if (this.containsKey(key) && (delete entry[key])) {
      size--;
    }
  }

  /**是否包含Key**/
  this.containsKey = function (key) {
    return (key in entry);
  }

  /**是否包含Value**/
  this.containsValue = function (value) {
    for (var prop in entry) {
      if (entry[prop] == value) {
        return true;
      }
    }
    return false;
  }

  /**所有的Value**/
  this.values = function () {
    var values = new Array();
    for (var prop in entry) {
      values.push(entry[prop]);
    }
    return values;
  }

  /**所有的 Key**/
  this.keys = function () {
    var keys = new Array();
    for (var prop in entry) {
      keys.push(prop);
    }
    return keys;
  }

  /**Map size**/
  this.size = function () {
    return size;
  }

  /**清空Map**/
  this.clear = function () {
    size = 0;
    entry = new Object();
  }
}


// md5
var hexcase = 0; /* hex output format. 0 - lowercase; 1 - uppercase */
var b64pad = ""; /* base-64 pad character. "=" for strict RFC compliance */
var chrsz = 8; /* bits per input character. 8 - ASCII; 16 - Unicode */

function hex_md5(s) {
  return binl2hex(core_md5(str2binl(s), s.length * chrsz));
}

function core_md5(x, len) {
  x[len >> 5] |= 0x80 << ((len) % 32);
  x[(((len + 64) >>> 9) << 4) + 14] = len;

  var a = 1732584193;
  var b = -271733879;
  var c = -1732584194;
  var d = 271733878;

  for (var i = 0; i < x.length; i += 16) {
    var olda = a;
    var oldb = b;
    var oldc = c;
    var oldd = d;

    a = md5_ff(a, b, c, d, x[i + 0], 7, -680876936);
    d = md5_ff(d, a, b, c, x[i + 1], 12, -389564586);
    c = md5_ff(c, d, a, b, x[i + 2], 17, 606105819);
    b = md5_ff(b, c, d, a, x[i + 3], 22, -1044525330);
    a = md5_ff(a, b, c, d, x[i + 4], 7, -176418897);
    d = md5_ff(d, a, b, c, x[i + 5], 12, 1200080426);
    c = md5_ff(c, d, a, b, x[i + 6], 17, -1473231341);
    b = md5_ff(b, c, d, a, x[i + 7], 22, -45705983);
    a = md5_ff(a, b, c, d, x[i + 8], 7, 1770035416);
    d = md5_ff(d, a, b, c, x[i + 9], 12, -1958414417);
    c = md5_ff(c, d, a, b, x[i + 10], 17, -42063);
    b = md5_ff(b, c, d, a, x[i + 11], 22, -1990404162);
    a = md5_ff(a, b, c, d, x[i + 12], 7, 1804603682);
    d = md5_ff(d, a, b, c, x[i + 13], 12, -40341101);
    c = md5_ff(c, d, a, b, x[i + 14], 17, -1502002290);
    b = md5_ff(b, c, d, a, x[i + 15], 22, 1236535329);

    a = md5_gg(a, b, c, d, x[i + 1], 5, -165796510);
    d = md5_gg(d, a, b, c, x[i + 6], 9, -1069501632);
    c = md5_gg(c, d, a, b, x[i + 11], 14, 643717713);
    b = md5_gg(b, c, d, a, x[i + 0], 20, -373897302);
    a = md5_gg(a, b, c, d, x[i + 5], 5, -701558691);
    d = md5_gg(d, a, b, c, x[i + 10], 9, 38016083);
    c = md5_gg(c, d, a, b, x[i + 15], 14, -660478335);
    b = md5_gg(b, c, d, a, x[i + 4], 20, -405537848);
    a = md5_gg(a, b, c, d, x[i + 9], 5, 568446438);
    d = md5_gg(d, a, b, c, x[i + 14], 9, -1019803690);
    c = md5_gg(c, d, a, b, x[i + 3], 14, -187363961);
    b = md5_gg(b, c, d, a, x[i + 8], 20, 1163531501);
    a = md5_gg(a, b, c, d, x[i + 13], 5, -1444681467);
    d = md5_gg(d, a, b, c, x[i + 2], 9, -51403784);
    c = md5_gg(c, d, a, b, x[i + 7], 14, 1735328473);
    b = md5_gg(b, c, d, a, x[i + 12], 20, -1926607734);

    a = md5_hh(a, b, c, d, x[i + 5], 4, -378558);
    d = md5_hh(d, a, b, c, x[i + 8], 11, -2022574463);
    c = md5_hh(c, d, a, b, x[i + 11], 16, 1839030562);
    b = md5_hh(b, c, d, a, x[i + 14], 23, -35309556);
    a = md5_hh(a, b, c, d, x[i + 1], 4, -1530992060);
    d = md5_hh(d, a, b, c, x[i + 4], 11, 1272893353);
    c = md5_hh(c, d, a, b, x[i + 7], 16, -155497632);
    b = md5_hh(b, c, d, a, x[i + 10], 23, -1094730640);
    a = md5_hh(a, b, c, d, x[i + 13], 4, 681279174);
    d = md5_hh(d, a, b, c, x[i + 0], 11, -358537222);
    c = md5_hh(c, d, a, b, x[i + 3], 16, -722521979);
    b = md5_hh(b, c, d, a, x[i + 6], 23, 76029189);
    a = md5_hh(a, b, c, d, x[i + 9], 4, -640364487);
    d = md5_hh(d, a, b, c, x[i + 12], 11, -421815835);
    c = md5_hh(c, d, a, b, x[i + 15], 16, 530742520);
    b = md5_hh(b, c, d, a, x[i + 2], 23, -995338651);

    a = md5_ii(a, b, c, d, x[i + 0], 6, -198630844);
    d = md5_ii(d, a, b, c, x[i + 7], 10, 1126891415);
    c = md5_ii(c, d, a, b, x[i + 14], 15, -1416354905);
    b = md5_ii(b, c, d, a, x[i + 5], 21, -57434055);
    a = md5_ii(a, b, c, d, x[i + 12], 6, 1700485571);
    d = md5_ii(d, a, b, c, x[i + 3], 10, -1894986606);
    c = md5_ii(c, d, a, b, x[i + 10], 15, -1051523);
    b = md5_ii(b, c, d, a, x[i + 1], 21, -2054922799);
    a = md5_ii(a, b, c, d, x[i + 8], 6, 1873313359);
    d = md5_ii(d, a, b, c, x[i + 15], 10, -30611744);
    c = md5_ii(c, d, a, b, x[i + 6], 15, -1560198380);
    b = md5_ii(b, c, d, a, x[i + 13], 21, 1309151649);
    a = md5_ii(a, b, c, d, x[i + 4], 6, -145523070);
    d = md5_ii(d, a, b, c, x[i + 11], 10, -1120210379);
    c = md5_ii(c, d, a, b, x[i + 2], 15, 718787259);
    b = md5_ii(b, c, d, a, x[i + 9], 21, -343485551);

    a = safe_add(a, olda);
    b = safe_add(b, oldb);
    c = safe_add(c, oldc);
    d = safe_add(d, oldd);
  }
  return Array(a, b, c, d);

}

/*
 * These functions implement the four basic operations the algorithm uses.
 */
function md5_cmn(q, a, b, x, s, t) {
  return safe_add(bit_rol(safe_add(safe_add(a, q), safe_add(x, t)), s), b);
}

function md5_ff(a, b, c, d, x, s, t) {
  return md5_cmn((b & c) | ((~b) & d), a, b, x, s, t);
}

function md5_gg(a, b, c, d, x, s, t) {
  return md5_cmn((b & d) | (c & (~d)), a, b, x, s, t);
}

function md5_hh(a, b, c, d, x, s, t) {
  return md5_cmn(b ^ c ^ d, a, b, x, s, t);
}

function md5_ii(a, b, c, d, x, s, t) {
  return md5_cmn(c ^ (b | (~d)), a, b, x, s, t);
}

/*
 * Calculate the HMAC-MD5, of a key and some data
 */
function core_hmac_md5(key, data) {
  var bkey = str2binl(key);
  if (bkey.length > 16) bkey = core_md5(bkey, key.length * chrsz);

  var ipad = Array(16),
    opad = Array(16);
  for (var i = 0; i < 16; i++) {
    ipad[i] = bkey[i] ^ 0x36363636;
    opad[i] = bkey[i] ^ 0x5C5C5C5C;
  }

  var hash = core_md5(ipad.concat(str2binl(data)), 512 + data.length * chrsz);
  return core_md5(opad.concat(hash), 512 + 128);
}

/*
 * Add integers, wrapping at 2^32. This uses 16-bit operations internally
 * to work around bugs in some JS interpreters.
 */
function safe_add(x, y) {
  var lsw = (x & 0xFFFF) + (y & 0xFFFF);
  var msw = (x >> 16) + (y >> 16) + (lsw >> 16);
  return (msw << 16) | (lsw & 0xFFFF);
}

/*
 * Bitwise rotate a 32-bit number to the left.
 */
function bit_rol(num, cnt) {
  return (num << cnt) | (num >>> (32 - cnt));
}

/*
 * Convert a string to an array of little-endian words
 * If chrsz is ASCII, characters >255 have their hi-byte silently ignored.
 */
function str2binl(str) {
  var bin = Array();
  var mask = (1 << chrsz) - 1;
  for (var i = 0; i < str.length * chrsz; i += chrsz)
    bin[i >> 5] |= (str.charCodeAt(i / chrsz) & mask) << (i % 32);
  return bin;
}

/*
 * Convert an array of little-endian words to a hex string.
 */
function binl2hex(binarray) {
  var hex_tab = hexcase ? "0123456789ABCDEF" : "0123456789abcdef";
  var str = "";
  for (var i = 0; i < binarray.length * 4; i++) {
    str += hex_tab.charAt((binarray[i >> 2] >> ((i % 4) * 8 + 4)) & 0xF) +
      hex_tab.charAt((binarray[i >> 2] >> ((i % 4) * 8)) & 0xF);
  }
  return str;
}

/*
 * Convert an array of little-endian words to a base-64 string
 */
function binl2b64(binarray) {
  var tab = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  var str = "";
  for (var i = 0; i < binarray.length * 4; i += 3) {
    var tripvar = (((binarray[i >> 2] >> 8 * (i % 4)) & 0xFF) << 16) |
      (((binarray[i + 1 >> 2] >> 8 * ((i + 1) % 4)) & 0xFF) << 8) |
      ((binarray[i + 2 >> 2] >> 8 * ((i + 2) % 4)) & 0xFF);
    for (var j = 0; j < 4; j++) {
      if (i * 8 + j * 6 > binarray.length * 32) str += b64pad;
      else str += tab.charAt((tripvar >> 6 * (3 - j)) & 0x3F);
    }
  }
  return str;
}

//--------------------------------------公共方法定义结束---------------------------------
//---------------------------文字提示功能定义开始-----------------------------//
var toolbar = new Object();
toolbar.Function = new Object();


function initTextTips() {
  var messageboxText = "";
  messageboxText += "<div class=\"disabilitiesLanguage\">";
  // 解决ie6下拉框浮在工具条上的方法
  messageboxText += "<iframe id=\"bfr_iframe\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;z-index:-1;filter:alpha(opacity=0);\"></iframe>";
  messageboxText += "<div class=\"LanguageMain\" id=\"language\">";
  messageboxText += "<ul class=\"font_titleBar\">";
  messageboxText += "<li><button title=\"转换简体字\" id=\"barrierfree_btn01\" class=\"barrierfree_btn01\" onclick=\"toolbar.Function.textTips.simpleModel()\" value=\"简\"/>简</button></li>";
  messageboxText += "<li><button title=\"转换繁体字\" class=\"barrierfree_btn02\" onclick=\"toolbar.Function.textTips.raditionalModel()\" value=\"繁\"/>繁</button></li>";
  messageboxText += "</ul>";
  messageboxText += "<ul class=\"LanguageSpell\">";
  messageboxText += "<li class=\"barrierfree_btn01\" id=\"spell\"><button title=\"显示拼音\" onclick=\"toolbar.Function.textTips.pinyinControl()\" value=\"拼音\"/>拼音</button></li>";
  messageboxText += "<li class=\"barrierfree_btn02\"><button title=\"关闭文字放大阅读屏幕\" class=\"input\" onclick=\"toolbar.Function.textTips.mainMethod();\" onMouseDown=\"this.className='inputOn'\" onMouseUp=\"this.className=''\" value=\"关闭\"/>关闭</button></li>";
  messageboxText += "</ul>";
  messageboxText += "</div>";
  messageboxText += "<div class=\"Languagetext\">";
  messageboxText += "<div class=\"LanguageTextMin\">";
  messageboxText += "<div class=\"LanguageTextContent\">";
  messageboxText += "<p><table><tr><td id=\"helper_messageBoxText\"></td></tr></table></p>";
  messageboxText += "</div>";
  messageboxText += "</div>";
  messageboxText += "</div>";
  messageboxText += "<div class=\"disabilitiesFooterBg\"></div>";
  messageboxText += "</div>";

  toolbar.Function.textTips = {
    showHTML: function () {
      if (ABTConfig.textTips.functionSwitch) {
        return "<input id=\"texttipsbutton\" type=\"button\" value=\"文字提示\" title=\"文字提示\" onclick=\"toolbar.Function.textTips.mainMethod()\" /><!--<input id=\"pinyinbutton\" type=\"button\" value=\"开启拼音功能\" title=\"开启拼音功能\"onclick=\"toolbar.Function.textTips.pinyinControl()\" />-->";
      } else {
        return "";
      }
    },
    cookieName: "textTips",
    cookieMethod: function () {
      if (ABTConfig.textTips.cookieSwitch && toolbar.cookie.getCookie(this.cookieName) == 1) {
        toolbar.Function.textTips.mainMethod();
      }
    },
    reSetCookie: function () {
      toolbar.cookie.SetCookie(this.cookieName, 0);
    },
    testTipsState: false,
    pinyinState: false,
    allTextNode: new Array(),
    isTextNode: function (element) {
      if (element.tagName == "IMG" || element.tagName == "INPUT" || element.tagName == "OBJECT" || element.tagName == "SELECT" || element.tagName == "H1" || element.tagName == "H2" || element.tagName == "H3" || element.tagName == "H4" || element.tagName == "H5" || element.tagName == "H6" || element.tagName == "A" || element.tagName == "li" || element.tagName == "SPAN" || element.tagName == "a" || element.tagName == "input" || element.tagName == "img") {
        return true;
      } else {
        return false;
      }
    },
    getTextNode: function (element) {
      if (element.nodeName == 'STYLE' || $(element).is(BarrierFreeConfig.exclude)) {
        return;
      }
      var childNodes = element.childNodes;
      for (var i = 0; i < childNodes.length; i++) {
        var thisChild = childNodes[i];
        switch (thisChild.nodeType) {
          case 1:
            this.getTextNode(thisChild);
            break;
          case 3:
            if (this.trim(thisChild.nodeValue).length == 0) {
              break;
            }
            this.allTextNode.push(thisChild);
            break;
        }
        if (thisChild.nodeName == "IMG" || thisChild.nodeName == "INPUT" || thisChild.nodeName == "OBJECT" || thisChild.nodeName == "SELECT") {
          this.allTextNode.push(thisChild);
        }
      }
    },
    trim: function (str) {
      return str.replace(/(^\s*)|(\s*$)/g, "");
    },
    pinyingArray: new Array(),
    TraditionalArray: new Array(),
    simplifiedArray: new Array(),
    makeMsgHTMLText: function (arrayText, arrayPinyin) {
      var htmlText = "";
      var CLOUM = 34;
      htmlText += "<table cellspacing=\"15\";>";
      for (var k = 0; k <= arrayPinyin.length / CLOUM; k++) {
        htmlText += "<tr>";
        for (var i = 0; i + k * CLOUM < arrayPinyin.length && i < CLOUM; i++) {
          htmlText += "<td class=\"barrierfree_pinyin\">";
          htmlText += arrayPinyin[i + k * CLOUM];
          htmlText += "</td>";
        }
        htmlText += "</tr>";

        htmlText += "<tr>";
        for (var i = 0; i + k * CLOUM < arrayText.length && i < CLOUM; i++) {
          htmlText += "<td class=\"barrierfree_text\">";
          htmlText += arrayText[i + k * CLOUM];
          htmlText += "</td>";
        }
        htmlText += "</tr>";
      }

      htmlText += "</table>";

      return htmlText;
    },
    getTextNoParam: function () {
      toolbar.Function.textTips.getText(this);
    },
    getText: function (element) {
      var messagebox = document.getElementById("helper_messageBoxText");
      var textMessage = judgeTag(element);
      if (textMessage) {
        toolbar.Function.textTips.textMessage = textMessage;
        var messageboxWidth = messagebox.offsetWidth;
        var fontRatio = messageboxWidth / textMessage.length;
        if (fontRatio < 30) {
          if (fontRatio > 18) {
            messagebox.style.fontSize = parseInt(fontRatio) + "px";
            messagebox.style.lineHeight = parseInt(fontRatio) + "px";
          }
          if (fontRatio < 10) {
            messagebox.style.fontSize = parseInt(fontRatio * 2) + "px";
            messagebox.style.lineHeight = parseInt(fontRatio * 2) + "px";
          }
        } else {
          messagebox.style.fontSize = "";
        }
  
        if (INSTANCE.pinYing == "1") {
  
          if (INSTANCE.isSimplifiedModel == "0") {
            toolbar.Function.textTips.pinyinText(textMessage);
            var traditionText = Traditionalized(textMessage);
            toolbar.Function.textTips.TraditionalArray = traditionText.split("");
            textMessage = toolbar.Function.textTips.makeMsgHTMLText(toolbar.Function.textTips.TraditionalArray, toolbar.Function.textTips.pinyingArray);
  
          } else {
            toolbar.Function.textTips.simplifiedArray = textMessage.split("");
            toolbar.Function.textTips.pinyinText(textMessage);
            textMessage = toolbar.Function.textTips.makeMsgHTMLText(toolbar.Function.textTips.simplifiedArray, toolbar.Function.textTips.pinyingArray);
          }
  
        } else {
          if (INSTANCE.isSimplifiedModel == "0") {
            textMessage = Traditionalized(textMessage);
          }
        }
  
        // 设置信息框内容
        messagebox.innerHTML = textMessage;
        INSTANCE.messageboxContent = textMessage;
        textMessage = "";
        if (toolbar.Function.textTips.textbgState) {
          ele.style.backgroundColor = "#F00";
          ele.style.color = "#FFF";
        }
      }
    },
    pinyinText: function (text) {
      var messayArray = text.split("");
      var newString = "";
      this.pinyingArray = new Array();
      for (var a = 0; a < messayArray.length; a++) {
        var testVar = "";
        if (pinyin[messayArray[a]]) {
          testVar = pinyin[messayArray[a]];
        } else {
          testVar = "&nbsp;";
        }
        if (messayArray[a] == " ") {
          messayArray[a] = "&nbsp;";
        }
        this.pinyingArray.push(testVar);
      }
      return newString;
    },
    getEvent: function () {
      var mouseEnter = toolbar.Function.textTips.getTextNoParam;
      var mouseOut = toolbar.Function.textTips.clearTextbgNoParam;

      // 绑定事件
      $('#' + BarrierFreeConfig.mainBox).on('mouseenter', '.canRead',  mouseEnter).on('mouseout', '.canRead',  mouseOut).on('focus', '.canRead', mouseEnter)
      // 绑定iframe事件
    var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
    var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
    let iframes = $(hostString).not('[src^="//"]')
    iframes.contents().find(BarrierFreeConfig.readerTags).not(BarrierFreeConfig.exclude).attr('tabindex', 0).addClass('canRead');
    iframes.contents().find("a *").attr('tabindex','-1').removeClass('canRead')
    iframes.contents().on('mouseenter', '.canRead', mouseEnter).on('mouseout', '.canRead', mouseOut)//.on('focus', '.canRead', mouseEnter)
    iframes.contents().find('.canRead').focus(mouseEnter) 
    // js操作的iframe 加载結束后執行iframes 是所有的
    iframes.on('load', function() {
      var iframe = $(this)//定位到当前iframe
      if (iframe.attr('src')) {
        iframe.contents().find(BarrierFreeConfig.readerTags).not(BarrierFreeConfig.exclude).attr('tabindex', 0).addClass('canRead');
        iframe.contents().find("a *").attr('tabindex','-1').removeClass('canRead')
        iframe.contents().on('mouseenter', '.canRead', mouseEnter).on('mouseout', '.canRead', mouseOut)//.on('focus', '.canRead', mouseEnter)
        iframe.contents().find('.canRead').focus(mouseEnter) 
      }
    });
    },
    simpleModel: function () {
      INSTANCE.isSimplifiedModel = INSTANCE.isSimplifiedModel = "1";
      toolbar.Function.textTips.toggle();
    },
    raditionalModel: function () {
      INSTANCE.isSimplifiedModel = INSTANCE.isSimplifiedModel = "0";
      toolbar.Function.textTips.toggle();
    },
    pinyinControl: function () {
      INSTANCE.pinYing = INSTANCE.pinYing == "0" ? "1" : "0";
      toolbar.Function.textTips.toggle();
    },
    textMessage: '',
    toggle: function (text) {
      if ($('#gettextmessagebox').length != 0) {
        var textMessage = toolbar.Function.textTips.textMessage || text ;
        if (INSTANCE.pinYing == "1") {

          if (INSTANCE.isSimplifiedModel == "0") {
            toolbar.Function.textTips.pinyinText(textMessage);
            var traditionText = Traditionalized(textMessage);
            toolbar.Function.textTips.TraditionalArray = traditionText.split("");
            textMessage = toolbar.Function.textTips.makeMsgHTMLText(toolbar.Function.textTips.TraditionalArray, toolbar.Function.textTips.pinyingArray);

          } else {
            toolbar.Function.textTips.simplifiedArray = textMessage.split("");
            toolbar.Function.textTips.pinyinText(textMessage);
            textMessage = toolbar.Function.textTips.makeMsgHTMLText(toolbar.Function.textTips.simplifiedArray, toolbar.Function.textTips.pinyingArray);
          }

        } else {
          if (INSTANCE.isSimplifiedModel == "0") {
            textMessage = Traditionalized(textMessage);
          }
        }
        var messagebox = document.getElementById("helper_messageBoxText");
        messagebox.innerHTML = textMessage;
        INSTANCE.messageboxContent = textMessage;
        textMessage = "";
        if (toolbar.Function.textTips.textbgState) {
          ele.style.backgroundColor = "#F00";
          ele.style.color = "#FFF";
        }
      }

    },
    firstRun: false,
    textbgState: false,
    textGetState: false,
    textbg: function () {
      this.textbgState = this.textbgState ? false : true;
      document.getElementById("textbgbuttonbox").getElementsByTagName("a")[0].innerHTML =
      this.textbgState ? "关闭标记功能" : "开启标记功能";
    },
    clearTextbgNoParam: function () {
      toolbar.Function.textTips.clearTextbg(this);
    },
    clearTextbg: function (element) {
      var ele = element || this;
      ele.style.backgroundColor = "";
      ele.style.color = "";
    },
    mainMethod: function () {
      if ($('.help_screen').is('.barrierfreeActive')) {
        $(".help_screen").removeClass('barrierfreeActive').attr('data-mtpis', '开启辅屏 请按ctrl + alt + B');
        $(".help_screen").attr('audio', 'helpscreen-open')
      } else {
        $(".help_screen").addClass('barrierfreeActive').attr('data-mtpis', '关闭辅屏 请按ctrl + alt + B');
        $(".help_screen").attr('audio', 'helpscreen-close')
      }
      if (!this.textGetState) {
        if ($("#gettextmessagebox").length > 0) {
          this.textGetState = true;
          INSTANCE.textTips = "1";
          SetCookie("textTips", "1");
          document.body.style.paddingBottom = 160 + "px";
          $("#gettextmessagebox").show();
          $("#barrierfree_btn01").get(0).focus();
        } else {
          var newMessageBox = document.createElement("div");
          newMessageBox.setAttribute("id", "gettextmessagebox");
          newMessageBox.innerHTML = messageboxText;
          $('body').append(newMessageBox)
          document.body.style.paddingBottom = 160 + "px";
          document.body.style.width = "100%";
          document.body.style.float = "left";
          this.getTextNode($(mainBoxID).get(0));
          this.getEvent();
          this.textGetState = true;
          INSTANCE.textTips = "1";
          SetCookie("textTips", "1");
          bindMessageBoxJS();
          $("#barrierfree_btn01").get(0).focus();
        }
        $(".help_screen").attr('data-mtpis', '关闭辅屏 请按ctrl + alt + B');
        $('.auxiliary_btn_n').show()
        $('.auxiliary_btn_y').hide()
        readContent('已开启辅屏');
      } else {
        $("#gettextmessagebox").hide();
        document.body.style.paddingBottom = 0 + "px";
        document.body.style.overflow = "";
        this.textGetState = false;
        INSTANCE.textTips = "0";
        SetCookie("textTips", "0");
        $(".help_screen").get(0).focus();

        $('.auxiliary_btn_n').hide()
        $('.auxiliary_btn_y').show()
        $(".help_screen").attr('data-mtpis', '开启辅屏 请按ctrl + alt + B');
        readContent('已关闭辅屏');
      }
      // INSTANCE.textTips = this.textGetState ? "1" : "0";
      // SetCookie("textTips", this.textGetState ? "1" : "0");

    },
    getIframeTextNode: function () {
      // 设置iframe样式
      var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
      if (!iframeNode) {
        return;
      }
      for (var i = 0; i < iframeNode.length; i++) {
        var iframeObject = iframeNode[i].contentWindow;
        try {
          var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0];
          this.getTextNode(iFrameAllNode);
        } catch (e) {
          //alert(e);
        }
      }
    }
  }
}
//---------------------------文字提示定义结束-----------------------------//

//---------------------------页面js定义开始-----------------------------//
var openMsgBoxFlag = 0;

function toggleMsgBoxBtn() {
  if (openMsgBoxFlag == 0) {
    openMsgBox();
  } else {
    closeMsgBox();
  }
}

function openMsgBox() {
  openMsgBoxFlag = 1;
  $("#txt").addClass('barrierfreeActive').attr('data-mtpis', '转换成图文模式(shift+V)');
  $("#txt").css({
    "background-position": "-452px -10px"
  });
  $("#txt").text('图文');
}

function closeMsgBox() {
  openMsgBoxFlag = 0;
  $("#txt").removeClass('barrierfreeActive').attr('data-mtpis', '转换成纯文本模式((shift+V))');
}

function bindPageJS() {
  // 链接点击跳转后  停止语音阅读
  // $('a').click(function () {
  // 	BarrierFreeConfig.reader.stop();
  // })

  // 绑定页面对比度效果脚本
  doorList('tab');
  doorList('language');
  doorList('txt');
  // 声音控制下拉
  if(INSTANCE.openFlag==1){
    if(INSTANCE.toolBarFoldFlag==="1"){
      $("#fold").get(0).setAttribute("data-mtpis", "固定或取消固定工具栏, 请按ctrl + alt +  L");
      document.getElementById('horizontal').classList.add('fold_bfr_nav');
      document.getElementById('wcagnav').classList.add('fold_bfr_nav');
      document.body.style.paddingTop = '0px';
    }
  }else{
    if(INSTANCE.toolBarFoldFlag==="1"){
      $("#fold").get(0).setAttribute("data-mtpis", "固定或取消固定工具栏, 请按ctrl + alt +  L");
      document.getElementById('horizontal').classList.remove('fold_bfr_nav');
      document.getElementById('wcagnav').classList.remove('fold_bfr_nav');
      document.body.style.paddingTop = '55px';
    }
  }
  $('#horizontal').hover(function () {
    if(INSTANCE.toolBarFoldFlag==="1"){
      document.getElementById('horizontal').classList.remove('fold_bfr_nav');
      document.getElementById('wcagnav').classList.remove('fold_bfr_nav');
      document.body.style.paddingTop = '55px';
    }
  })
  $('#horizontal').mouseleave(function () {
    if(INSTANCE.toolBarFoldFlag==="1"){
      document.getElementById('horizontal').classList.add('fold_bfr_nav');
      document.getElementById('wcagnav').classList.add('fold_bfr_nav');
      document.body.style.paddingTop = '0px';
    }
  });
// 折叠按钮点击事件
  $("#fold").click(function () {
    if (INSTANCE.toolBarFoldFlag==="0") {
      foldToolBar();
    } else {
      unfoldToolBar();
    }
  });
}
// 折叠顶部工具条
function foldToolBar() {
  $("#fold").get(0).setAttribute("data-mtpis", "固定或取消固定工具栏, 请按ctrl + alt +  L");
  readContent('工具栏已取消固定，固定工具栏, 请按ctrl加alt加L');
  document.getElementById('horizontal').classList.add('fold_bfr_nav');
  document.getElementById('wcagnav').classList.add('fold_bfr_nav');
  localStorage.setItem("toolBarFoldFlag", "1")
  INSTANCE.toolBarFoldFlag='1'
  document.body.style.paddingTop = '0px';
}
// 固定顶部工具条
function unfoldToolBar() {
  $("#fold").get(0).setAttribute("data-mtpis", "固定或取消固定工具栏, 请按ctrl + alt +  L");
  readContent('工具栏已固定，取消固定工具栏, 请按ctrl加alt加L');
  document.getElementById('horizontal').classList.remove('fold_bfr_nav');
  document.getElementById('wcagnav').classList.remove('fold_bfr_nav');
  INSTANCE.toolBarFoldFlag='0'
  localStorage.setItem("toolBarFoldFlag", "0")
  document.body.style.paddingTop = '55px';
}

// 初始化文字提示框界面

function bindMessageBoxJS() {
  doorList('language');
  $("#spell").toggle(function () {
      $(this).attr('class', 'barrierfree_open')
    },
    function () {
      $(this).attr('class', 'barrierfree_close')
    });
}

function doorList(id) {
  var curentId = 0;
  $("#" + id + " .font_titleBar li:eq(0)").addClass("disabilitiesNow");
  $("#" + id + " .door:eq(0)").show();
  $("#" + id + " .font_titleBar li").click(function () {
    if ($(this).attr('class') == 'link') {
      return;
    }
    if (curentId != $(this).index()) {
      curentId = $(this).index();
      var curentDiv = $("#" + id + " div div.door").eq(curentId);
      var curentHeight = $(curentDiv).height();
      $("#" + id + " .font_titleBar li").removeClass("disabilitiesNow");
      $(this).addClass("disabilitiesNow");
    };
  });
}
//---------------------------页面js定义结束-----------------------------//


function initBarrierFreeEvent() {
  addKeyListenerToIframe();
}
// 初始化工具模块

function initBarrierFree() {
  declareConfig();
  mainBoxID = "#" + BarrierFreeConfig.mainBox;
  // 初始化
  initTextTips();//字符串拼接的工具条
  initData();//存储在cookie中的变量
  ariaRole()//初始给某些html元素添加  ARIA role 属性值 
  // 监听事件
  initKeyEventListener();
  encapsulation();
  // 站外链接跳转
  handleOutSite();
  // 恢复上次状态
  setTimeout(restoreStatus, 300);
}
//处理异步加载区域函数
function encapsulation(iframeBody){
  // 正常html 页面的body内的id
  let mainBox = $('#'+BarrierFreeConfig.mainBox)
  handleAsync(mainBox)
// 如果有iframe
  if(iframeBody){
    handleAsync(iframeBody)
  }
}
function handleAsync(body){
  body.on('DOMNodeInserted',function(e){
    let _that = $(e.target)
      if(_that){
        // 如果当前新增的是声明的可读标签
        if(_that.is(BarrierFreeConfig.readerTags)){
          // 且不是排查标签
           _that.not(BarrierFreeConfig.exclude).attr('tabindex', 0).addClass('canRead')
            // .hover(pointRead, unPointRead)
            // 给添加上tabindex和canRead 可读属性 鼠标移入让其可以聚焦，聚焦后绑定可读
            _that.on('mouseenter', getFocus)
            _that.focus(focusHandle)
            // 如果是可读标签且当前新增的是a标签
            if(_that.is('a')){
              // a标签下的所有标签移除可读属性设置tabindex为-1
              _that.find("*").attr('tabindex','-1').removeClass('canRead');
            } 
        }else{
          _that.find(BarrierFreeConfig.readerTags).not(BarrierFreeConfig.exclude).attr('tabindex', 0).addClass('canRead');
          _that.find("a *").attr('tabindex','-1').removeClass('canRead');
          _that.find('.canRead').hover(pointRead, unPointRead)
          _that.on('mouseenter', '.canRead', getFocus)
          _that.find('.canRead').focus(focusHandle) 
        }
      }
  });
}
//--------------------------------------主方法开始结束-----------------------------------

// 初始化数据

function initData() {
  INSTANCE.openFlag = getCookie("openFlag");
  if (!INSTANCE.openFlag) {
    INSTANCE.openFlag = "0";
  }

  INSTANCE.toolBarFoldFlag = localStorage.getItem("toolBarFoldFlag");
  if (!INSTANCE.toolBarFoldFlag) {
    INSTANCE.toolBarFoldFlag = "0";
  }

  INSTANCE.textFlag = getCookie("textFlag");
  if (!INSTANCE.textFlag) {
    INSTANCE.textFlag = "0";
  }
  INSTANCE.zoomValue = Number(getCookie("zoomValue"));
  if (INSTANCE.zoomValue > 2 || INSTANCE.zoomValue <= 0 || isNaN(INSTANCE.zoomValue)) {
    INSTANCE.zoomValue = 1;
  }

  INSTANCE.fontValue = Number(getCookie("fontValue"));
  INSTANCE.fontValue = 16;
  INSTANCE.colorFlag = getCookie("colorFlag");
  if (!INSTANCE.colorFlag) {
    INSTANCE.colorFlag = "0";
  } else {
    switchTheme();
  }
  INSTANCE.lineFlag = getCookie("lineFlag");
  if (!INSTANCE.lineFlag) {
    INSTANCE.lineFlag = "0";
  }

  INSTANCE.textTips = getCookie("textTips");
  if (!INSTANCE.textTips) {
    INSTANCE.textTips = "0";
  }

  INSTANCE.isSimplifiedModel = getCookie("isSimplifiedModel");
  if (!INSTANCE.isSimplifiedModel) {
    INSTANCE.isSimplifiedModel = "1";
  }
  INSTANCE.pinYing = getCookie("pinYing");
  if (!INSTANCE.pinYing) {
    INSTANCE.pinYing = "0";
    toolbar.Function.textTips.toggle();
  }
  // pinyinControl: function () {
  //   INSTANCE.pinYing = INSTANCE.pinYing == "0" ? "1" : "0";
  //   toolbar.Function.textTips.toggle();
  // },
  // 读屏cookie
  INSTANCE.readFlag = getCookie("readFlag");
  if (!INSTANCE.readFlag) {//'0'代表关闭声音 '1'代表打开声音
    INSTANCE.readFlag = '0';
  }

  INSTANCE.readMode = getCookie("readMode");//'0'代表指读 '1'代表连读
  if (!INSTANCE.readMode) {
    INSTANCE.readMode = '0';
  }
  INSTANCE.speedFlag = getCookie('speedFlag')
  if (INSTANCE.speedFlag === '1') {
    setTimeout(function () {
      fastSpeakSpeed();
    }, 500)
  } else {
    setTimeout(function () {
      normalSpeakSpeed();
    }, 500)

  }
  // 智能导盲cookie
  INSTANCE.blindFlag = getCookie("blindFlag");
  if (!INSTANCE.blindFlag) {
    INSTANCE.blindFlag = '0';
  }
  // 速度模式cookie
  INSTANCE.speedFlag = getCookie("speedFlag");
  if (!INSTANCE.speedFlag) {
    INSTANCE.speedFlag = '0';
  }
  // 大鼠标cookie
  INSTANCE.mouseFlag = localStorage.getItem("mouseFlag");
  if (!INSTANCE.mouseFlag) {
    INSTANCE.mouseFlag = "0"
  }
  INSTANCE.browser = browserFlag();
}
var outHrefVisited = 0;
// 站外链接提示
function handleOutSite() {
  $('body').find('a:not([href^="javascript"])').click(function (event) { // href不是以javascript开头的
    if(BarrierFreeConfig.outlinkTip ===1){//outlinkTip 为1时，站外链接 弹出提醒框 跳转站外无障碍工具条会失效
      if (INSTANCE.openFlag !== '0' && this.href != "" && this.href != "undefined") {
        var h = $(top.document).height();
        var curWwwPathArray = window.document.location.href.split('/');
        var aHrefArray = this.href.split('/');
        if (curWwwPathArray[2] != aHrefArray[2]) {
          event.stopPropagation()
          $(".overlay").css({
            "height": h,
            'display': 'block',
            'opacity': '0.8'
          }); //开启遮罩层
          $("#prompt-href").val(this.href);
          $("#prompt-modal").show();
          $('#prompt-yes').focus();//当外链弹窗出现时 将focus聚焦在 确定按钮上
          event.preventDefault()
          readContent('该链接属站外链接，会导致无障碍工具条失效！继续访问请按回车键。不访问请按esc退出。');
          outHrefVisited = 1;
        }
      }
    } 
  })
}

// 给每个文本标签添加标记
function initTextTag() {
  var arr = new Array();
  var i = 1;
  $('body').find('*:not(.displayClass,' + BarrierFreeConfig.exclude + ')').each(function () {
    var obj = $(this);
    var text = "";
    text = manageText(obj[0]);
    if (text != null && text != "") {
      // obj.attr("tabindex", i).addClass("text-tag"); //为每个带有文本节点的dom增加属性tabindex，并且增加class属性ESDAssetsTextCon
      obj.attr("tabindex", 0).addClass("text-tag"); //为每个带有文本节点的dom增加属性tabindex，并且增加class属性ESDAssetsTextCon
      i++;
    }
  })
  $('body').find("* [tabindex][class$='displayClass']").removeClass("displayClass").addClass("text-tag");
   //为可读标签添加tabindex
   var mainArea = $('#' + BarrierFreeConfig.mainBox)
   mainArea.find(BarrierFreeConfig.readerTags).not(BarrierFreeConfig.exclude).attr('tabindex', 0).addClass('canRead')
   mainArea.find("a *").attr('tabindex','-1').removeClass('canRead')

   var iframesCss = `
   <style id="iframes_css" type="text/css">.canRead:focus{background: #1e9fff !important;}
     .white-black-blue {
       background: #fff !important;
       color: rgba(0, 0, 0, 0.85) !important;
     }
     .blue-yellow-white {
       background: #2274EC !important;
       color: rgba(255, 234, 25, 0.85) !important;
     }
     .yellow-black-blue {
       background: #FFC811 !important;
       color: rgba(0, 0, 0, 0.85) !important;
     }
     .black-yellow-white {
       background: #000000 !important;
       color: #FEC404 !important;
     }
     .default-color {
       color: #000 !important;
     }
     a.link-tag-color-white {
       color: #fff !important;
     }
     
     a.link-tag-color-blue {
       color: #2274EC !important;
     }
     .bl {
      outline: thick solid red;
     }
    .startCricleDot {
      display: block;
      position: absolute;
      width: 1px;
      height: 1px;
      background: none;
      overflow: hidden;
      margin: -5px 0 0 -5px;
      float: left !important;
    }
    .endCricleDot {
      display: block;
      position: absolute;
      width: 1px;
      height: 1px;
      background: none;
      overflow: hidden;
      margin: -5px 0 0 -5px;
      float: left !important;
    }
   </style>`
  // 绑定全局可读对象
  try {
    var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
    var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
    let iframes = $(hostString).not('[src^="//"]')
    if(INSTANCE.textFlag!=='1'){
      iframes.contents().find('body').append(iframesCss)
    }
      let iframesBody= iframes.contents().body
      iframes.contents().find(BarrierFreeConfig.readerTags).not(BarrierFreeConfig.exclude).attr('tabindex', 0).addClass('canRead');
      iframes.contents().find("a *").attr('tabindex','-1').removeClass('canRead')
      iframes.contents().on('mouseenter', '.canRead', getFocus)
      iframes.contents().find('.canRead').focus(focusHandle) 
      encapsulation(iframesBody)
    iframes.on('load', function() {
      var iframe = $(this)
      if (iframe.attr('src')) {
        let allCanReadTag= iframe.contents().find(BarrierFreeConfig.readerTags).not(BarrierFreeConfig.exclude)
        allCanReadTag.attr('tabindex', 0).addClass('canRead');
        iframe.contents().find("a *").attr('tabindex','-1').removeClass('canRead')
        iframe.contents().on('mouseenter', '.canRead', getFocus)
        iframe.contents().find('.canRead').focus(focusHandle) 
        let iframeBody=iframe.contents().find('body')
        if(INSTANCE.textFlag !=='1'){
          iframeBody.append(iframesCss)
        }
        // js操作的进来的iframe
        if(INSTANCE.lineFlag ==='1'){
          setIframeOnMouseMoveEevent()
        }
        if(INSTANCE.textFlag ==='1'){
          textFunction()
        }
        encapsulation(iframeBody)
      }
    });
  } catch (e) {
      console.log("发生异常:" + e)
  }
  $('#' + BarrierFreeConfig.mainBox).on('mouseenter', '.canRead', getFocus).on('focus', '.canRead', focusHandle)
}

function manageText(obj) {
  var text = "";
  // if (findvar(obj.tagName, ['INS'])) {
  if ($(obj).children("script").length > 0) {
    return text;
  }
  if (obj.children.length > 0 && obj.children[0].nodeType == 1) {
    return text;
  }
  //检查display属性是否为none
  var dis = obj.currentStyle ? obj.currentStyle.display /*ie*/ : document.defaultView.getComputedStyle(obj, null).display;
  if (dis == "none") {
    return text;
  }
  // 使用正则表达式将字符串中所有的 HTML 标签替换为一个空字符串，从而去除 HTML 标签。
  text = obj.innerHTML.replace(/<.+?>/g, '');
  // }
  return text;
}

//判断元素是否存在于标签集合中。

function findvar(obj, sz) {
  var b = false;
  for (var i = 0; i < sz.length; i++) {
    if (sz[i] == obj) {
      b = true;
      break;
    }
  }
  return b;
}

// 恢复到上次的状态(刷新)

function restoreStatus() {
  $.fn.extend({
    toggle: function (fn1, fn2) {
      $(this).bind("click", function () {
        if ($(this).attr("lsfAlreadyToggle") && $(this).attr("lsfAlreadyToggle") == "1") {
          $(this).attr("lsfAlreadyToggle", "0");
          if (fn2)
            fn2.call(this);
          else
            $(this).show();
        } else {
          $(this).attr("lsfAlreadyToggle", "1");
          if (fn1)
            fn1.call(this);
          else
            $(this).hide();
        }
      });
    }
  });
  //工具条初始化
  if (INSTANCE.openFlag == "1" || (typeof (BarrierFreeConfig.AutoOpen) != "undefined") && (BarrierFreeConfig.AutoOpen == "1")) { 
    openToolBar();
    if (INSTANCE.colorFlag) {
      switchTheme()
    }
    if (INSTANCE.blindFlag == "1") {
      ergodicToolbar();
    } else {
      readWelcome();
    }
    initTextTag();
    if (INSTANCE.textTips == '1') {
      toolbar.Function.textTips.mainMethod();
    }
    if (INSTANCE.speedFlag == "1") {
      fastSpeakSpeed();
    }
    if (INSTANCE.readMode == "1") {
      $(".toolbar-item-readtype").attr('data-mtpis', '当前为连读模式，切换指读 请按ctrl + alt + F');
    }
    if (INSTANCE.mouseFlag == "1") {
      INSTANCE.mouseFlag = "0"
      bigMouseBtn();
    }
  }
}


// 监听key事件

function initKeyEventListener() {
  // 事件监听
  document.addEventListener('keyup', function(e) {
    $("[markAlink]").attr('markAlink','')//每次将标记重置 移除
    var nodeName=e.target.nodeName||e.srcElement.nodeName
    // 当focus既不是弹框的‘是’也不是弹框的‘否’ 将focus重置回原来的 外链上的tbl
    if($(':focus').attr('id') !=='prompt-yes'&&$(':focus').attr('id') !=='prompt-no'&& nodeName == 'A'){
      var classString =$(':focus').attr('class')
      if(classString!==undefined&&classString.indexOf('tbl')===-1){
        $('.tbl').focus()
      }
    }
    if (e.key==='Escape') {
      if (outHrefVisited) {
        $(".overlay").css({
          'display': 'none',
          'opacity': '0'
        }); //关闭遮罩层
        $("#prompt-modal").hide();
        $("#prompt-no").unbind("click");
        outHrefVisited = 0;
      } else {
        BarrierFreeConfig.reader.stop();
      }
    }
    if ((e.key !== 'Tab' && e.code !== 'Tab') && (nodeName == 'INPUT' || nodeName == 'TEXTAREA')) {
      return;
    }
    // 标记 点击的外链的a标签
    $('.tbl').attr('markAlink', 'markAlink');
    //快捷键获取
    var currkey = 0,
      e = e || event || window.event;
    currkey = e.keyCode || e.which || e.charCode;
    //快捷键键盘监听
    accessKeyboardListener(currkey, e);
    //工具条键盘监听
    toolBarKeyDownEvent(currkey, e);
  })
  // 键盘按下 
  document.addEventListener('keydown', function(event) {
    if(event.key == 'Tab'&&$(':focus')&&$(':focus').closest('[b-panel]')&&$(':focus').closest('[b-panel]').length){  
      // 如果导航栏多于1个
      if(INSTANCE.obj.bHeader.length>1){
        let currentPanelLastCanRead =INSTANCE.obj.bPanel.eq(INSTANCE.obj.currentPanelChildIndex).find('.canRead:last').get(0) === $(':focus').get(0)
        if(currentPanelLastCanRead){
          // 如果来到 单个tab 的二级list 的末尾
          event.returnValue=false
          INSTANCE.obj.bHeader.eq(INSTANCE.obj.currentPanelChildIndex + 1).find('.canRead:first').focus()
          INSTANCE.obj.headerToParentLevel=$(':focus').parentsUntil('[b-header]').length //到父级一共多少层
          // //到父级bHeader的索引【排序】
          INSTANCE.obj.currentHeaderChildIndex=INSTANCE.obj.bHeader.index($(':focus').parentsUntil('[b-header]')[INSTANCE.obj.headerToParentLevel-1]) //当前耳机菜单所在和-tab的索引
          // 如果来到 最后的tab的末尾
          let isPanelLastCanRead =INSTANCE.obj.bPanel.eq(-1).find('.canRead:last').get(0) === $(':focus').get(0)
          //  如果是b-tab嵌套b-tab 最后一个可读元素不在b-pannel内
          let nest_isPanelLastCanRead=INSTANCE.obj.bPanel.closest('[b-tab]').find('.canRead:last').get(0) ===$(':focus').get(0)
          if(isPanelLastCanRead||nest_isPanelLastCanRead){
            // 如果该b-tab下有ergodic属性
            if(INSTANCE.obj.bTab.find('.endCricleDot')&&INSTANCE.obj.bTab.find('.endCricleDot').length){
              INSTANCE.obj.bTab.find('.endCricleDot').focus()
            }else{
              // 如果该b-tab下无ergodic属性
              var currentFocus = $(':focus').get(0); // 获取当前元素
              var canReadElements = $('.canRead'); // 获取所有具有canread类的元素
              var targetElement = null;//将要接 焦点的元素
              if(event.shiftKey&&(event.key === 'Tab')){
                for (var i = 0; i < canReadElements.length; i++) {
                  if (canReadElements[i]===currentFocus) { // 如果当前元素在canread元素内部
                    targetElement = canReadElements[i-1];
                    break;
                  }
                }
                targetElement.focus()
              }else{
              for (var i = 0; i < canReadElements.length; i++) {
                if (canReadElements[i]===currentFocus) { // 如果当前元素在canread元素内部
                  targetElement = canReadElements[i+1];
                  break;
                }
              }
              targetElement.focus()
              }
            }
          }
        }
      }else{
      // 如果 是单个导航栏
        let currentPanelLastCanRead =INSTANCE.obj.bPanel.eq(-1).find('.canRead:last').get(0) === $(':focus').get(0)
        if(currentPanelLastCanRead){
          $(':focus').closest('[b-tab]').find('[b-panel]').css({
            "display": "none"
          })
        }
      }
    }
    // 当是页面最后一个可读标签 将再次循环回页面头部 即无障碍工具条的后面的节点
    if($('#'+BarrierFreeConfig.mainBox).find(".canRead").last().get(0) ===$(':focus').get(0)){
      $("#wcagnav").next().focus()
    }
  })
  //iframe中监听
  $(document).ready(function() {
    // Find the iframe element
    var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
    var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
    let iframes = $(hostString).not('[src^="//"]')
    // Attach the load event listener
    iframes.each(function() {
      var iframe = $(this);
      if (iframe.attr('src')) {
        // 当前xx区 已经加载了的
       // Find the iframe's document and attach the keyup event listener
       var iframeDoc = iframe.contents();
       iframeDoc.on('keyup', function(event) {
        
        var currkey = 0,
        e =  event || window.event;
        currkey = e.keyCode || e.which || e.charCode;
         // Key was released within the iframe
         console.log('Key released within iframe');
         accessKeyboardListener(currkey, e);
         //工具条键盘监听
         toolBarKeyDownEvent(currkey, e);
       });
      }
    });
    iframes.on('load', function() {
      var iframe = $(this)
      // iframe has finished loading
      var iframeDoc = iframe.contents();
      iframeDoc.on('keyup', function(event) {
        var currkey = 0,
        e =  event || window.event;
        currkey = e.keyCode || e.which || e.charCode;
        // Key was released within the iframe
        console.log('Key released within iframe');
        accessKeyboardListener(currkey, e);
        //工具条键盘监听
        toolBarKeyDownEvent(currkey, e);
      });
    });
  });
}

// 标记区域进出点
function initAreaPoint() {
  $('[ergodic]').each(function () {
    $(this).attr('role','region');//ARIA无障碍网页应用属性
    var aNum = $(this).find('a').length; //有多少链接
    var imgNum = $(this).find('img').length; //有多少图片
    var valueArea = $(this).attr('ergodic')
    var valueTitle = valueArea + 'AreaTitle';
    const bfrZoneElems = this.querySelectorAll('[bfr_zone_dsc]');
    // Loop through all the descendant elements and concatenate their text content
    let bfr_zone_text = '';
    if(bfrZoneElems.length){
     bfr_zone_text = '内容主要涉及';
      for (let item of bfrZoneElems) {
        bfr_zone_text += item.textContent.trim()+'、';
      }
      bfr_zone_text = bfr_zone_text.slice(0, -1);
      bfr_zone_text+='...各类信息'
    }
    let text = BarrierFreeConfig[valueTitle] ? ('您已进入' + BarrierFreeConfig[valueTitle] + ',' + (aNum > 0||imgNum > 0 ||bfr_zone_text? '本区域含有' : '') + (aNum > 0 ? aNum + '个链接,' : '') + (imgNum > 0 ? imgNum + '张图片,' : '') + (bfr_zone_text  ? bfr_zone_text + ',' : '') + '按下tab键浏览信息') : "";
    var leavelText = BarrierFreeConfig[valueTitle] ? ('您将离开' + BarrierFreeConfig[valueTitle] + ',按tab键继续浏览信息') : "";
    $(this).prepend('<span class="startCricleDot canRead" tabindex="0">' + text + '</span>');
    $(this).append('<span class="endCricleDot canRead" tabindex="0">' + leavelText + '</span>');
  })
  var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
  var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
  let iframes = $(hostString).not('[src^="//"]')
  iframes.on('load', function() {
    var iframe = $(this);
    if (iframe.attr('src')) {
      iframe.contents().find('[ergodic]').each(function () {
        $(this).attr('role','region');//ARIA无障碍网页应用属性
        var aNum = $(this).find('a').length; //有多少链接
        var imgNum = $(this).find('img').length; //有多少图片
        var valueArea = $(this).attr('ergodic')
        var valueTitle = valueArea + 'AreaTitle';
        const bfrZoneElems = this.querySelectorAll('[bfr_zone_dsc]');
        // Loop through all the descendant elements and concatenate their text content
        let bfr_zone_text = '';
        if(bfrZoneElems.length){
         bfr_zone_text = '内容主要涉及';
          for (let item of bfrZoneElems) {
            bfr_zone_text += item.textContent.trim()+'、';
          }
          bfr_zone_text = bfr_zone_text.slice(0, -1);
          bfr_zone_text+='...各类信息'
        }
        let text = BarrierFreeConfig[valueTitle] ? ('您已进入' + BarrierFreeConfig[valueTitle] + ',' + (aNum > 0||imgNum > 0 ||bfr_zone_text? '本区域含有' : '') + (aNum > 0 ? aNum + '个链接,' : '') + (imgNum > 0 ? imgNum + '张图片,' : '') + (bfr_zone_text  ? bfr_zone_text + ',' : '') + '按下tab键浏览信息') : "";
        var leavelText = BarrierFreeConfig[valueTitle] ? ('您将离开' + BarrierFreeConfig[valueTitle] + ',按tab键继续浏览信息') : "";
        $(this).prepend('<span class="startCricleDot canRead" tabindex="0">' + text + '</span>');
        $(this).append('<span class="endCricleDot canRead" tabindex="0">' + leavelText + '</span>');
      })
    }
  });
}

function removeAreaPoint() {
  $('.startCricleDot, .endCricleDot').remove();
  $('.barrierfree_tips').remove();
   var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
  var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
  let iframes = $(hostString).not('[src^="//"]')
  iframes.each(function() {
    var iframe = $(this);
    iframe.contents().find('.startCricleDot, .endCricleDot, .barrierfree_tips').remove();
  });
}

function initMarkInfoList(){
  $('.barrierfree_infoList').each(function () {
    var imgNum = $(this).find('img').length; //有多少轮播图片
    var text = imgNum > 0 ? '当前浮动区域,本区域含有'+  imgNum + '张图片,按tab键继续浏览信息' : '当前为浮动区域，按tab键继续浏览信息' 
    $(this).prepend('<span class="barrierfree_tips canRead" tabindex="0">' + text + '</span>');
  })
}
//  按键tab操作 添加标记提示进入轮播区，
function initMarkCarousel(){
  $('.barrierfree_carousel').each(function () {
    var imgNum = $(this).find('img').length; //有多少轮播图片
    var text = imgNum > 0 ? '当前为轮播区域,本轮播含有'+  imgNum + '张图片,按tab键继续浏览信息' : '当前为轮播区域，按tab键继续浏览信息' 
    $(this).prepend('<span class="barrierfree_tips canRead" tabindex="0">' + text + '</span>');
  })
}
/*
 * 控制打开／关闭辅助工具条
 */
var toggleOldManModal = false
var initMouseClick;

function toggleToolBar() {
  initMouseClick = 0;
  toggleOldManModal = false
  if (INSTANCE.openFlag == "0") {
    readWelcome();
    initTextTag();
    openToolBar();
    INSTANCE.openFlag = "1";
    SetCookie("openFlag", "1");
    INSTANCE.toolBarFoldFlag = "0";
    localStorage.setItem("toolBarFoldFlag", "0");//默认不折叠
  } else {
    removeAreaPoint();
    if (getCookie('textFlag') == '1') {
      window.location.href = window.location.href;
      window.location.reload();
    }
    pageFunction(1);
    INSTANCE.openFlag = "0";
    SetCookie("openFlag", "0");
    INSTANCE.toolBarFoldFlag = "1";
    localStorage.setItem("toolBarFoldFlag", "1");
    if (INSTANCE.lineFlag == '1') {
      closeLineFunction(); // 关闭辅助线功能
      INSTANCE.lineFlag = '0';
      delCookie('lineFlag');
    }
    closeToolBar();
    closeReadFuction(); //关闭读屏功能，但不清除cookie
    $('.bl').removeClass('bl');
    $(".tbl").removeClass('tbl');
    $("#gettextmessagebox").hide();
    INSTANCE.mouseFlag = '0';
    $('#yx_cursor').remove();
    onClickTool = false
    // INSTANCE.blindFlag = '0';
    delCookie("blindFlag");
    delCookie("textFlag");
    delCookie("zoomValue");
    delCookie("fontValue");
    delCookie("colorFlag");
    delCookie("lineFlag");
    delCookie("readFlag");
    delCookie("readMode");
    localStorage.removeItem("mouseFlag");
    delCookie("speedFlag");
    delCookie("textTips");
    //关闭时清空样式
    if(!INSTANCE.openFlag|| INSTANCE.openFlag ==='0'){
      window.location.reload()
      // window.location.href = window.location.href;//山东有一个cookie直接设置为1 因此做的兼容
    }
  }
}


var currObj;

function judgeTag(currObj) {
  var text;
  var tagType = currObj.tagName;
  var currJq = $(currObj)
  var attr = currObj.hasAttribute("readlabel");
  if (typeof attr !== typeof undefined && attr !== false) {
    text = currJq.attr('readlabel')||currJq.text()||currJq.attr('title')||currJq.attr("alt")||currJq.attr('placeholder')
    text = $.trim(text)
    currObj.addEventListener('click',function () {
      readContent(text);
    });
    if (text.length == 0) {
      text = currJq.text() || currJq.attr('title');
      text = $.trim(text)
    }
  }else if (currJq.is('.startCricleDot') || currJq.is('.endCricleDot')) {
    // 如果是正文区 就不读提示了 因为正文区 是遍历所有文本  会造成两遍的假象
    if(currJq.closest("[ergodic]").attr("ergodic")!=='article'){
      text = "提示：" + $.trim(currJq.text());
    }
  } else if (tagType == 'A') {
    var title =  $.trim(currJq.attr('title')) || $.trim(currJq.text()) || $.trim(currJq.attr('alt'));
    if (title.length > 0) {
      if(currJq.find('img').length === 1 && currJq.find('img').width() > 50){
        text = "图片链接：" + title;
      }else{
        text = "链接：" + title;
      }
    } else {
      text = "链接：" + title;
    }
  } else if (tagType == 'IMG') {
    if (currJq.parent()[0].localName == 'a') {
      text = "图片链接：" + $.trim(currJq.attr("alt") ? currJq.attr("alt") : '');
    } else {
      text = "图片：" + $.trim(currJq.attr("alt") ? currJq.attr("alt") : '');
    }
  } else if (tagType == 'TEXTAREA') {
      text = "文本域：" + $.trim(currObj.value || currObj.placeholder);
  }else if (tagType == 'INPUT') {
    if (currObj.type == "text" || currObj.type == 'password' || currObj.type == 'search' || currObj.type == 'file') {
      text = "文本框：" + $.trim(currObj.value || currObj.placeholder || $(currObj).attr('readContent'));
    } else if (currObj.type == 'button' || currObj.type == 'reset' || currObj.type == 'submit') {
      text = "按钮：" + $.trim(currObj.value || $(currObj).attr('readContent'));
    } else if (currObj.type == 'image') {
      text = "按钮：" + $.trim(currObj.alt || $(currObj).attr('readContent'));
    } else if (currObj.type == 'radio') {
      text = "单选框：" + $.trim(currObj.title || $(currObj).attr('readContent'));
    } else if (currObj.type == 'checkbox') {
      text = "复选框：" + $.trim(currObj.title || $(currObj).attr('readContent'));
    }
  } else if (tagType == 'BUTTON') {
    text = "按钮：" + $.trim(currJq.text() || currObj.title || currObj.innerHTML);
  } else if (tagType == 'SELECT') {
    text = "下拉框" 
  }else if (tagType == 'P' || tagType == 'SPAN' || tagType == 'LI' || tagType == 'H1' || tagType == 'H2' || tagType == 'H3' || tagType == 'H4' || tagType == 'H5' || tagType == 'H6') {
    if(currJq.text().trim().replace(/[\n\r]/g, "")){// 如果可读标签内无可读 文本 不进入 去掉空格，替换掉换行
      var newArr = new Array()
      // 获取所有的当前标签内的可读标签的文本
      currJq.children(BarrierFreeConfig.readerTags).each(function() {newArr.push($(this).text())})
      var childrenTxt = newArr.join('')//所有子节点的可读文本拼接
    // 如果当前标签内的文本 等于 所有子节点的可读文本 则跳过当前可读标签
      if (currJq.text()&&currJq.text().replace(/\n/g, "").replace(/\s/g, "") === childrenTxt.replace(/\n/g, "").replace(/\s/g, "")) {
        currJq.attr('tabindex','-1').removeClass('canRead')
      }else{//当前节点除可读子节点标签外 还有内容
        if(currJq.attr('tabindex')=='-1'){//是否被a标签包含 如果是 直接取 a标签内 内容
        text = "链接：" + $.trim(currJq.closest('a').text());
        }else{//否则 取当前标签内的所有文本 不等于标签内所有子节点的所有文本
          var textTitle = $.trim(currJq.text());//有些li标签 换行了 内容为空 所以读不出来
          if(!textTitle){
            textTitle=$.trim(currJq.attr('title'))
          }
          if(currJq.text() === 'X') {  
            text = "文本：" + "关闭"
          }else{
            if(textTitle.substring(0,5)==='当前为轮播'||textTitle.substring(0,5)==='当前为浮动'){
              text = textTitle;
            }else{
              text = "文本：" + textTitle;
            }
            // 此时整合完内容,只读当前元素整合的内容 当前元素内部的元素文本+当前元素内 不是元素包裹的文本不进入
            currJq.find(BarrierFreeConfig.readerTags).attr('tabindex','-1').removeClass('canRead');
          }
        }
      }
    }
  }
  return text;
}
// 鼠标移入 给予焦点
function getFocus() {
  this.focus()
}
var pointTimer;
var readingFuntion;
// 鼠标读屏事件
function pointRead(e, text) {
    BarrierFreeConfig.readerSentences = new Array();
    if (pointTimer) {
      unPointRead();
    }
    if (typeof text != 'string') {
      // 浮动窗口 头部 提示
      if ($(this)&&$(this).closest('[b-header]')&& $(this).closest('[b-header]').length) {
        if($(this).hasClass('withOutTips')){
          $(this).attr("readlabel", $(this).text().trim());
        }else{
          $(this).attr("readlabel", "浮动窗口"+$(this).text().trim()+":按Ctrl+下箭头进入窗口,按tab键在窗口遍历信息,按esc键返回");
        }
       }
      if (INSTANCE.readMode == '0') {//'0'代表指读 '1'代表连读
        text = judgeTag(this);
      } else {
        text = readContinueBtn(this);
      }
    }

    if (text) {
      var sentenceArray = text.split(/[,?!，。？！“”“”\n]/)
      var temp = ''
      $.each(sentenceArray, function (i, str) {
        var text = $.trim(str);
        temp += text
        if (temp.length > 0) {
          if (temp.length < 30) {
            if (i === sentenceArray.length-1) {
              BarrierFreeConfig.readerSentences.push(temp);
              temp = ''
            } else {
              return;
            }
          } else {
            BarrierFreeConfig.readerSentences.push(temp);
            temp = ''
          }
        }
      });
      text = BarrierFreeConfig.readerSentences.shift()
      readContent(text);
    }
    // e.stopPropagation();
}

function readContent(text) {
  // 如果页面未 执行click事件 不执行读文本操作【页面不报错】 未开启声音不读
  if(!initMouseClick){
    return false
  }
  if (BarrierFreeConfig.reader.isLoaded()) {
    BarrierFreeConfig.reader.read(text);
  } else {
    pointTimer = setTimeout(function() {
      BarrierFreeConfig.reader.read(text);
    }, 150);
  }
}

function playAudio(audio) {
  if (BarrierFreeConfig.reader.isLoaded()) {
    BarrierFreeConfig.reader.play(BarrierFreeConfig.contextPath + 'audio/' + audio + '.mp3');
  } else {
    pointTimer = setTimeout(function () {
      playAudio(audio)
    }, 150);
  }
}

function unPointRead() {
  clearTimeout(pointTimer);
}
// 判断无障碍打开后 鼠标是否移动
function readWelcome() {
  var pageTitle = $('title').text();
  var str2 = '您已进入' + pageTitle + '页面, 请按 ctrl 加 alt 加 R 进入智能导盲';
  setTimeout(function () {
    readContent(str2, true);
  }, 150)
}

/*
 * 打开辅助工具条
 */
//打开工具条 关闭页面上浮动窗口
function closeAllFloatModel() {
  $(".PiaoChuang_switch").css({
    "display": "none",
  })
}
function openToolBar() {
  // 如果是跳转页 可读
   if(document.referrer !== location.href){
    initMouseClick = 1
   }else{
    initMouseClick = 0
   }
  $('body').addClass('active_bfr') //开启无障碍时 对方要更改页面中的样式
  closeAllFloatModel()
  // 给当前页面添加个 焦点聚焦后的样式 初始添加
  $('#' + BarrierFreeConfig.mainBox).append('<style>.canRead:focus{background: #1e9fff !important;}</style>')
  initAreaPoint();
  // 按键tab操作 添加标记提示进入信息列表区
  initMarkInfoList();
  //  按键tab操作 添加标记提示进入轮播区
  initMarkCarousel();
  onClickTool = true
  var wcagNavDiv = $("#wcagnav");
  if (wcagNavDiv.length == 0) {
    creatWcagNav();
    wcagNavDiv = $("#wcagnav");
  }

  wcagNavDiv.show(300, function () {
    document.body.style.paddingTop = wcagNavDiv.get(0).offsetHeight + "px";
  });

  if (INSTANCE.lineFlag == "1") {
    lineFunction();
  }
  if (INSTANCE.mouseFlag == "1") {
    INSTANCE.mouseFlag = "0"
    bigMouseBtn();
  }
  if (INSTANCE.readFlag == "1") {
    $('.voice_btn_close').hide()
    $('.voice_btn_open').show()
    startReadFunction();
  }
  // 已经切换为连读模式 刷新或跳转的页面内icon 保持对应
  if (INSTANCE.readMode == '1') {
    $(".readtype_btnIcon_open").hide();
    $(".readtype_btnIcon_close").show();
    $(".toolbar-item-readtype").attr('data-mtpis', '当前为连读模式，切换指读 请按ctrl + alt + F');
    $(".toolbar-item-readtype").attr('audio', 'read-currentmode-continuous');
  }
  //当前是纯文本
  if(INSTANCE.textFlag==='1'){
    $('#txt').attr('audio', 'viewmode-normal');
    $('#txt').attr('data-mtpis', '恢复图文模式, 请按 alt + shift + 3');
    textFunction()
  }
  createNodeDiv("wcagnav", "工具条已开启,帮助请按ALT+1");
  var readBtnTimeout;
  $('.toolbar-item-audio').hover(
    function () {
      if (!!initMouseClick&&INSTANCE.readFlag==='1') { // 无障碍打开后  鼠标发生移动后 且语音开启 才读取指定图标对应的语音
        var btn = this;
        readBtnTimeout = setTimeout(function () {
          BarrierFreeConfig.readerSentences = new Array();
          playAudio($(btn).attr('audio'))
        }, 100);
      }
    },
    function () {
      clearTimeout(readBtnTimeout);
      unPointRead();
    }
  ).click(function () {
    setTimeout(function () {
      if (BarrierFreeConfig.reader.isLoaded()) {
        BarrierFreeConfig.reader.stop();
      }
    }, 150);
  });

  openPageFunction(INSTANCE.zoomValue);
}

/*
 * 关闭辅助工具条
 */

function closeToolBar() {
  $('body').removeClass('active_bfr')
  onClickTool = false
  var wcagNavDiv = $("#wcagnav");
  wcagNavDiv.hide(300, function () {
    wcagNavDiv.get(0).style.display = "none";
    document.body.style.paddingTop = wcagNavDiv.get(0).offsetHeight + "px";
  });

  createNodeDiv("wcagnav", "工具条已关闭");
  $('#' + BarrierFreeConfig.mainBox).find('.canRead').unbind('mouseenter', pointRead).unbind('mouseout', unPointRead).removeClass("canRead");
  // 关闭工具条  将所有的CanRead 移除
}

/*
 * 创建辅助工具条
 */

function creatWcagNav() {

  var toolbarinnerText = getToolbarInnerText();
  //工具条创建
  var navToolbarDiv = document.createElement("div");
  navToolbarDiv.setAttribute("id", "wcagnav");
  navToolbarDiv.style.display = "none";
  navToolbarDiv.innerHTML = toolbarinnerText;
  document.body.insertBefore(navToolbarDiv, document.body.firstChild);

  // 绑定外链提示按钮
  $("#prompt-yes").click(function () {
    $(".overlay").css({
      'display': 'none',
      'opacity': '0'
    }); //关闭遮罩层
    var outHref = $("#prompt-href").val();
    window.open(outHref);
    $("#prompt-modal").hide();
    outHrefVisited = 0;
  });
  $("#prompt-no").click(function () {
    $(".overlay").css({
      'display': 'none',
      'opacity': '0'
    }); //关闭遮罩层
    $("#prompt-modal").hide();
    outHrefVisited = 0;
  });

  //语速，指读，连读等模式开关
  $('#read').mouseenter(function () {
      $('.toolbar_top').next('.toolbar_bottom').slideDown(100);
    }),
    $('.toolbar_bottom').mouseenter(function () {
      $('.toolbar_top').next('.toolbar_bottom').show();
      $('#read').addClass('hover');
    }),
    $('#read').mouseleave(function () {
      $('.toolbar_top').next('.toolbar_bottom').hide();
    });
  $('.toolbar_bottom').mouseleave(function () {
    $('.toolbar_top').next('.toolbar_bottom').slideUp(100);
    $('#read').removeClass('hover');
  });
  // 绑定页面效果脚本
  bindPageJS();
}

function getToolbarInnerText() {
  // var textHTML = "";
  textHTML = '<div class="overlay"></div>' +
    '<div id="prompt-modal" role="alertdialog" aria-hidden="false" style="display: none;">' +
    '<span tabindex="0" class="canRead">该链接属站外链接，会导致无障碍工具条失效！</span>' +
    '<br>' +
    '<span tabindex="0" class="canRead">是否继续访问？</span><br>' +
    '<input id="prompt-yes" tabindex="0" class="canRead" type="button" value="是" style="font-size: 25px;color:#FFFFFF;background: #b73535;width:50px;height:30px;line-height:18px;border:0;" class="ESDAssetsTextCon">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;' +
    '<input id="prompt-no" tabindex="0" class="canRead" type="button" value="否" style="font-size: 25px;color:#FFFFFF;background: #b73535;width:50px;height:30px;line-height:18px;border:0;" class="ESDAssetsTextCon">' +
    '<input id="prompt-href" type="hidden" value="">' +
    '</div>' +
    '<div id="horizontal" class="accessiblereading-toolbar-contain" >' +
    '<div class="accessiblereading-toolbar-contain-body accessiblereading-toolbar toolbar-normal">' +
     // 读屏专用
    '<div class="fun_button_list width_f toolbar-item-audio blind" id="ergodic" audio="bfr-reduction-mode" onclick="ergodicToolbar();"  data-mtpis="当前为老人模式, 进入智能导盲请按ctrl + alt + R">'+
      '<div class="dpzy_icon">' +
        '<svg xmlns="http://www.w3.org/2000/svg" width="29.035" height="27.222" viewBox="0 0 29.035 27.222">\
          <g data-name="组 85" fill="currentColor">\
            <path data-name="路径 117" d="M1227.416-3167.752v19.282a5.433,5.433,0,0,1-.258.8,2.516,2.516,0,0,1-2.422,1.465q-4.195.006-8.389,0h-.367c.281.565.532,1.08.8,1.587a.3.3,0,0,0,.224.109c.349.013.7,0,1.048.012a.842.842,0,0,1,.782.667.849.849,0,0,1-.416.915l-.187.113h-10.661c-.037-.024-.073-.052-.112-.073a.858.858,0,0,1-.491-.955.861.861,0,0,1,.867-.673,1.7,1.7,0,0,1,.368,0,.879.879,0,0,0,1.126-.694,8.331,8.331,0,0,1,.487-1.011h-.391q-4.18,0-8.361,0a2.553,2.553,0,0,1-2.677-2.643q-.008-9.268.009-18.537a2.854,2.854,0,0,1,.258-1.173,2.491,2.491,0,0,1,2.447-1.464h15.276q4.166,0,8.332,0a2.474,2.474,0,0,1,2.2,1.06A6.625,6.625,0,0,1,1227.416-3167.752Zm-1.7,16.435v-.312q0-7.81,0-15.62c0-.765-.3-1.07-1.057-1.07H1201.13c-.74,0-1.047.309-1.047,1.051q0,7.824,0,15.648v.3Zm-25.629,1.722c0,.312-.012.594,0,.876.027.515.4.816.993.816h23.609c.076,0,.152,0,.227,0a.812.812,0,0,0,.769-.676,8.221,8.221,0,0,0,.009-1.012Zm14.832,5.086c-.28-.562-.535-1.084-.806-1.6-.03-.057-.154-.09-.234-.091-.5-.008-1,.037-1.5-.016a.794.794,0,0,0-.961.6,10.7,10.7,0,0,1-.538,1.1Z" transform="translate(-1198.38 3170.021)"/>\
            <path data-name="路径 118" d="M1241.131-3150.894a4.516,4.516,0,0,1,1.7-1.353,4.32,4.32,0,0,1,1.76-.369q1.63,0,3.26,0a.86.86,0,0,1,.953.945q0,5,0,10.006a.865.865,0,0,1-.969.957q-2.409,0-4.818,0a.878.878,0,0,0-1.02.912.857.857,0,0,1-.852.788.855.855,0,0,1-.843-.8.873.873,0,0,0-1-.9q-2.395,0-4.79,0c-.7,0-1.018-.32-1.018-1.023q0-4.932,0-9.864c0-.7.318-1.021,1.02-1.022,1.011,0,2.022.008,3.033,0a4.275,4.275,0,0,1,3.488,1.57A1.664,1.664,0,0,1,1241.131-3150.894Zm-.852,8.584a.206.206,0,0,0,.016-.055c0-2.013.026-4.026-.008-6.039a2.443,2.443,0,0,0-2.3-2.474c-.91-.081-1.831-.024-2.747-.027-.014,0-.027.023-.032.029v8.467c.355,0,.693-.007,1.032,0A35.164,35.164,0,0,1,1240.279-3142.31Zm6.819-8.6c-.807,0-1.59,0-2.372,0a4.314,4.314,0,0,0-.452.028,2.1,2.1,0,0,0-.361.064,2.539,2.539,0,0,0-1.912,2.563c-.005,1.909,0,3.819,0,5.728,0,.079.012.158.016.211,1.7-.193,3.394-.022,5.081-.108Z" transform="translate(-1226.631 3156.019)"/>\
          </g>\
        </svg>'+
      '</div>' +
      '<div class="text_color" style="margin-left:16px;">读屏专用</div>' +
    '</div>' +
    // 声音开关
    '<div class="fun_button_list width_e  change_voice_btn toolbar-item-audio" onclick="readFunctionBtn()" audio="read-close"  data-mtpis="关闭读屏, 请按ctrl + alt + V">' +
      '<div class="button_list voice_set toolbar-item-bg ">' +
        // 声音关着的icon
        '<div class="voice_btn_close">'+
          '<svg width="26.827" height="26.814" viewBox="0 0 26.827 26.814">\
             <g id="组_100" data-name="组 100" transform="translate(-300.675 -315.001)">\
               <path id="联合_2" data-name="联合 2" d="M0,9.43C.04,9.288.074,9.144.12,9A2.362,2.362,0,0,1,2.313,7.39c.506-.009,1.012-.01,1.518,0a.43.43,0,0,0,.39-.193Q6.863,3.8,9.513.406A.957.957,0,0,1,10.341,0c.794.011,1.589,0,2.383,0a.8.8,0,0,1,.893.886c0,2.138.005,4.276-.006,6.414,0,.233.06.337.284.4.427.122.846.27,1.265.418a2.333,2.333,0,0,1,1.6,2.23q.009,3.05,0,6.1A2.337,2.337,0,0,1,15.147,18.7c-.411.145-.82.3-1.24.409-.249.065-.3.186-.294.42.009,2.077,0,4.154.012,6.23a1.006,1.006,0,0,1-.583,1.055H10a5.039,5.039,0,0,1-.6-.557q-2.61-3.321-5.2-6.66a.384.384,0,0,0-.348-.17c-.514.009-1.03.01-1.544,0A2.361,2.361,0,0,1,.12,17.813c-.046-.14-.08-.283-.12-.425ZM12.036,1.575c-.429,0-.83.008-1.231,0a.382.382,0,0,0-.346.175q-2.547,3.275-5.1,6.546a.576.576,0,0,0-.118.327q-.01,4.792,0,9.582a.5.5,0,0,0,.088.286Q7.907,21.8,10.5,25.113a.3.3,0,0,0,.18.124c.45.01.9.006,1.36.006ZM3.648,17.858V8.976a.416.416,0,0,0-.068-.015c-.375,0-.75,0-1.125,0a.8.8,0,0,0-.883.9q0,1.936,0,3.871c0,1.1,0,2.2,0,3.3a.776.776,0,0,0,.73.832C2.745,17.873,3.189,17.858,3.648,17.858Zm9.98-.3c.387-.134.763-.243,1.122-.394a.708.708,0,0,0,.436-.691q.006-3.062,0-6.124a.707.707,0,0,0-.436-.69c-.359-.151-.735-.26-1.122-.393Z" transform="translate(300.675 315)" fill="currentColor"/>\
               <path id="路径_145" data-name="路径 145" d="M2959.61-1932.639c1.063,0,2.076,0,3.089,0a1.912,1.912,0,0,0,.462-.036,1.084,1.084,0,0,0,.8-1.128,1.091,1.091,0,0,0-1.094-.983c-.943-.011-1.887,0-2.83,0h-.431v-1.521c0-.561,0-1.123,0-1.684a1.081,1.081,0,0,0-1.075-1.141,1.086,1.086,0,0,0-1.074,1.147c-.007,1.049,0,2.1,0,3.2h-.4c-.907,0-1.815,0-2.723,0a1.1,1.1,0,0,0-1.225,1.069,1.092,1.092,0,0,0,1.207,1.081c1.026,0,2.052,0,3.122,0,.006.139.016.264.016.39,0,.908,0,1.815,0,2.723a1.116,1.116,0,0,0,1.088,1.246,1.1,1.1,0,0,0,1.063-1.229C2959.611-1930.535,2959.61-1931.56,2959.61-1932.639Z" transform="translate(-3135.095 -395.789) rotate(45)" fill="currentColor"/>\
             </g></svg>'+
           '</div>' +
           // 声音开着的icon
           '<div class="voice_btn_open">'+
               '<svg width="26.827" height="26.814" viewBox="0 0 26.827 26.814">\
               <path id="联合_2" data-name="联合 2" d="M10,26.815a5.056,5.056,0,0,1-.6-.557Q6.792,22.937,4.2,19.6a.385.385,0,0,0-.347-.17q-.772.014-1.544,0A2.361,2.361,0,0,1,.12,17.813c-.046-.14-.08-.283-.12-.424V9.43C.04,9.288.074,9.144.12,9A2.362,2.362,0,0,1,2.313,7.39c.506-.009,1.013-.01,1.518,0a.43.43,0,0,0,.39-.193Q6.863,3.8,9.513.406A.954.954,0,0,1,10.34,0c.514.006,1.028.005,1.542,0h.841a.8.8,0,0,1,.893.886c0,2.137.005,4.276-.005,6.413,0,.233.059.338.284.4.427.121.846.27,1.265.418a2.333,2.333,0,0,1,1.6,2.23q.009,3.05,0,6.1A2.336,2.336,0,0,1,15.146,18.7c-.41.145-.82.3-1.24.409-.248.066-.3.185-.294.42.009,2.077,0,4.154.013,6.231a1.008,1.008,0,0,1-.583,1.056Zm.455-25.069Q7.912,5.02,5.361,8.292a.572.572,0,0,0-.118.328q-.009,4.791,0,9.581a.5.5,0,0,0,.088.286Q7.908,21.8,10.5,25.113a.3.3,0,0,0,.18.124c.451.01.9.005,1.36.005V1.575c-.429,0-.83.007-1.231,0h-.017A.378.378,0,0,0,10.459,1.746Zm-8,7.213a.8.8,0,0,0-.883.9q0,1.936,0,3.871c0,1.1,0,2.2,0,3.3a.776.776,0,0,0,.73.832c.443.02.886,0,1.346,0V8.976a.418.418,0,0,0-.068-.015l-.855,0Zm11.174,8.6c.387-.134.763-.243,1.121-.394a.708.708,0,0,0,.436-.69q.005-3.062,0-6.125a.708.708,0,0,0-.436-.69c-.358-.151-.735-.259-1.121-.393Zm9.56,1.973a.791.791,0,0,1,.05-1.183,6.942,6.942,0,0,0,2-5.093,6.874,6.874,0,0,0-1.948-4.72.9.9,0,0,1-.328-.81A.751.751,0,0,1,23.5,7.11a.763.763,0,0,1,.812.22,8.187,8.187,0,0,1,2.171,3.758c.193.755.274,1.538.341,1.936a8.936,8.936,0,0,1-2.458,6.41.926.926,0,0,1-.659.313A.748.748,0,0,1,23.188,19.528Zm-2.219-2.22a.808.808,0,0,1,.046-1.185A3.917,3.917,0,0,0,21,10.68a.807.807,0,0,1-.215-.884.731.731,0,0,1,.65-.495.8.8,0,0,1,.7.287,5.485,5.485,0,0,1,.038,7.6.951.951,0,0,1-.682.339A.741.741,0,0,1,20.969,17.308ZM18.757,15.1a.759.759,0,0,1-.071-1.08.793.793,0,0,0,.008-1.208.783.783,0,0,1,1.169-1.04,2.342,2.342,0,0,1,0,3.281.809.809,0,0,1-.581.252A.78.78,0,0,1,18.757,15.1Z" transform="translate(0 -0.001)" fill="currentColor"/>\
               </svg>'+
          '</div>' +
        '<div class="text_color">声音开关</div>' +
      '</div>' +
    '</div>' +
    // 语速
    '<div class="fun_button_list speak_speed toolbar-item-audio" onclick="readSpeedBtn()" audio="read-speed-normal"  data-mtpis="当前为正常语速，加快语速请按ctrl + alt + K">' +
      '<div class="button_list voice_set">' +
        // 声音关着的icon
        '<div class="voice_btn_speed_q">'+
          '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 26.377 26.393"  width="26.377" height="26.393">\
            <g data-name="组 74">\
              <path data-name="联合 5" d="M8.849,26.346A21.5,21.5,0,0,1,8.8,23.773c0-1.921,0-3.842,0-5.472a19.25,19.25,0,0,1-2.626-1.515,1.963,1.963,0,0,1-.423-1.422c.038-1.34.974-2.017,3.049-2.264V10.565c0-2.785-.017-5.568.018-8.352A6.2,6.2,0,0,1,9.182.766h.825a7.149,7.149,0,0,1,.361,1.551c.031,3.57.016,7.142.016,10.419a19.183,19.183,0,0,1,2.629,1.515,1.97,1.97,0,0,1,.42,1.423c-.04,1.341-.967,2.01-3.049,2.266v7.176a3.745,3.745,0,0,1-.04,1.226c-.119.322-.491.55-.752.818C9.333,26.89,8.886,26.643,8.849,26.346ZM8.012,14.81a.976.976,0,0,0-.655.7,1.01,1.01,0,0,0,.651.714,3.811,3.811,0,0,0,1.07.048c.154-.007.308-.015.461-.014a7.756,7.756,0,0,0,1.632-.033,1.012,1.012,0,0,0,.661-.706.971.971,0,0,0-.646-.712c-.528-.04-1.06-.061-1.591-.061S8.536,14.769,8.012,14.81ZM2.65,26.135a7.522,7.522,0,0,1-.035-1.658A19.171,19.171,0,0,1-.038,23.015,1.984,1.984,0,0,1-.483,21.6c0-1.376.934-2.06,3.1-2.313V18.2C2.614,12.9,2.6,7.61,2.63,2.316A7.05,7.05,0,0,1,2.991.766h.826a7.048,7.048,0,0,1,.362,1.551c.025,5.26.016,10.518.016,15.777v.833A19.042,19.042,0,0,1,6.822,20.44a1.965,1.965,0,0,1,.422,1.422c-.04,1.342-.97,2.014-3.051,2.266a10.9,10.9,0,0,1-.035,2.013c-.071.373-.493.681-.757,1.018C3.139,26.821,2.725,26.512,2.65,26.135Zm-.833-5.142c-.263.019-.5.434-.745.667.25.265.458.68.759.76a6.033,6.033,0,0,0,1.527.035v-.005a7.755,7.755,0,0,0,1.632-.033,1,1,0,0,0,.652-.712A.976.976,0,0,0,4.987,21q-.8-.062-1.613-.062C2.854,20.937,2.333,20.957,1.816,20.993Zm20.135,6.137c-.872-.023-.76-.807-.768-1.42-.005-.51,0-1.021,0-1.256A18.024,18.024,0,0,1,18.6,23.042a2,2,0,0,1-.477-1.4c-.018-1.352.933-2.068,3.056-2.361V18.183c0-5.289-.01-10.579.016-15.868A7.045,7.045,0,0,1,21.561.766h.824a7.048,7.048,0,0,1,.363,1.549c.027,5.288.016,10.574.016,15.862v1.214a2.93,2.93,0,0,1,3.129,1.6V22.43a2.95,2.95,0,0,1-3.129,1.6c0,.642,0,1.184,0,1.726,0,.611.065,1.372-.775,1.372ZM20.456,21c-.276.024-.513.485-.768.745.277.24.521.606.84.69a5.616,5.616,0,0,0,1.427.029,6.506,6.506,0,0,0,1.529-.031c.314-.078.553-.459.825-.7-.26-.256-.5-.707-.786-.732-.506-.044-1.015-.066-1.523-.066S20.967,20.95,20.456,21Zm-4.748,6.117c-.211,0-.535-.358-.661-.62a2.264,2.264,0,0,1-.052-.913q0-7.108,0-14.215v-1.1c-2.386-.631-3.127-1.253-3.081-2.549.049-1.351.868-2,3.081-2.364,0-1.03-.039-2.087.017-3.138A7.558,7.558,0,0,1,15.371.766H16.2a20.376,20.376,0,0,1,.364,2.066c.063.843.015,1.7.015,2.52,2.236.366,3.106,1.086,3.078,2.467s-.905,2.075-3.078,2.372v1.072q0,7.159,0,14.318a2,2,0,0,1-.057.911,1.27,1.27,0,0,1-.79.622Zm-1.5-20.068c-.252.02-.7.52-.656.71a1.235,1.235,0,0,0,.74.769,5.168,5.168,0,0,0,1.428.033V8.551a7.607,7.607,0,0,0,1.635-.034,1.025,1.025,0,0,0,.664-.724.986.986,0,0,0-.633-.743c-.535-.043-1.075-.065-1.615-.065C15.249,6.985,14.725,7,14.207,7.045Z" transform="translate(.483 -.766)" fill="currentColor"/>\
            </g>\
          </svg>'+
          '</div>' +
          // 声音开着的icon
          '<div class="voice_btn_speed_n">'+
          '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 26.377 26.393"  width="26.377" height="26.393">\
          <g data-name="组 74">\
            <path data-name="联合 5" d="M8.849,26.346A21.5,21.5,0,0,1,8.8,23.773c0-1.921,0-3.842,0-5.472a19.25,19.25,0,0,1-2.626-1.515,1.963,1.963,0,0,1-.423-1.422c.038-1.34.974-2.017,3.049-2.264V10.565c0-2.785-.017-5.568.018-8.352A6.2,6.2,0,0,1,9.182.766h.825a7.149,7.149,0,0,1,.361,1.551c.031,3.57.016,7.142.016,10.419a19.183,19.183,0,0,1,2.629,1.515,1.97,1.97,0,0,1,.42,1.423c-.04,1.341-.967,2.01-3.049,2.266v7.176a3.745,3.745,0,0,1-.04,1.226c-.119.322-.491.55-.752.818C9.333,26.89,8.886,26.643,8.849,26.346ZM8.012,14.81a.976.976,0,0,0-.655.7,1.01,1.01,0,0,0,.651.714,3.811,3.811,0,0,0,1.07.048c.154-.007.308-.015.461-.014a7.756,7.756,0,0,0,1.632-.033,1.012,1.012,0,0,0,.661-.706.971.971,0,0,0-.646-.712c-.528-.04-1.06-.061-1.591-.061S8.536,14.769,8.012,14.81ZM2.65,26.135a7.522,7.522,0,0,1-.035-1.658A19.171,19.171,0,0,1-.038,23.015,1.984,1.984,0,0,1-.483,21.6c0-1.376.934-2.06,3.1-2.313V18.2C2.614,12.9,2.6,7.61,2.63,2.316A7.05,7.05,0,0,1,2.991.766h.826a7.048,7.048,0,0,1,.362,1.551c.025,5.26.016,10.518.016,15.777v.833A19.042,19.042,0,0,1,6.822,20.44a1.965,1.965,0,0,1,.422,1.422c-.04,1.342-.97,2.014-3.051,2.266a10.9,10.9,0,0,1-.035,2.013c-.071.373-.493.681-.757,1.018C3.139,26.821,2.725,26.512,2.65,26.135Zm-.833-5.142c-.263.019-.5.434-.745.667.25.265.458.68.759.76a6.033,6.033,0,0,0,1.527.035v-.005a7.755,7.755,0,0,0,1.632-.033,1,1,0,0,0,.652-.712A.976.976,0,0,0,4.987,21q-.8-.062-1.613-.062C2.854,20.937,2.333,20.957,1.816,20.993Zm20.135,6.137c-.872-.023-.76-.807-.768-1.42-.005-.51,0-1.021,0-1.256A18.024,18.024,0,0,1,18.6,23.042a2,2,0,0,1-.477-1.4c-.018-1.352.933-2.068,3.056-2.361V18.183c0-5.289-.01-10.579.016-15.868A7.045,7.045,0,0,1,21.561.766h.824a7.048,7.048,0,0,1,.363,1.549c.027,5.288.016,10.574.016,15.862v1.214a2.93,2.93,0,0,1,3.129,1.6V22.43a2.95,2.95,0,0,1-3.129,1.6c0,.642,0,1.184,0,1.726,0,.611.065,1.372-.775,1.372ZM20.456,21c-.276.024-.513.485-.768.745.277.24.521.606.84.69a5.616,5.616,0,0,0,1.427.029,6.506,6.506,0,0,0,1.529-.031c.314-.078.553-.459.825-.7-.26-.256-.5-.707-.786-.732-.506-.044-1.015-.066-1.523-.066S20.967,20.95,20.456,21Zm-4.748,6.117c-.211,0-.535-.358-.661-.62a2.264,2.264,0,0,1-.052-.913q0-7.108,0-14.215v-1.1c-2.386-.631-3.127-1.253-3.081-2.549.049-1.351.868-2,3.081-2.364,0-1.03-.039-2.087.017-3.138A7.558,7.558,0,0,1,15.371.766H16.2a20.376,20.376,0,0,1,.364,2.066c.063.843.015,1.7.015,2.52,2.236.366,3.106,1.086,3.078,2.467s-.905,2.075-3.078,2.372v1.072q0,7.159,0,14.318a2,2,0,0,1-.057.911,1.27,1.27,0,0,1-.79.622Zm-1.5-20.068c-.252.02-.7.52-.656.71a1.235,1.235,0,0,0,.74.769,5.168,5.168,0,0,0,1.428.033V8.551a7.607,7.607,0,0,0,1.635-.034,1.025,1.025,0,0,0,.664-.724.986.986,0,0,0-.633-.743c-.535-.043-1.075-.065-1.615-.065C15.249,6.985,14.725,7,14.207,7.045Z" transform="translate(.483 -.766)" fill="currentColor"/>\
          </g>\
        </svg>'+
          '</div>' +
        '<div class="text_color">语速</div>' +
      '</div>' +
    '</div>' +
    // 阅读方式
    '<div class="fun_button_list width_e  toolbar-item-readtype toolbar-item-audio" onclick="readModelBtn()" audio="read-currentmode-mouse" data-mtpis="当前为指读模式，切换连读 请按ctrl + alt + F">' +
      '<div class="button_list">' +
        '<div class="read_set" >'+
          // 指读的icon
          '<div class="readtype_btnIcon_open">'+
            '<svg xmlns="http://www.w3.org/2000/svg" width="25.861" height="26.815" viewBox="0 0 25.861 26.815">\
            <g id="组_70" data-name="组 70" fill="currentColor">\
              <path id="路径_110" data-name="路径 110" d="M924.951-3491.017h15.544c.313.308.631.611.94.923q2.963,2.993,5.923,5.99v19.482a4.654,4.654,0,0,1-1.292.4c-6.722.025-13.444.019-20.166.017-1.219,0-1.348-.136-1.357-1.364-.005-.766,0-1.531,0-2.316-2.286-.849-3.12-2.574-3.041-4.978.078-2.369.013-4.743.019-7.114a4.044,4.044,0,0,1,2.417-3.986.907.907,0,0,0,.614-1.008c-.027-1.569-.04-3.14.009-4.708A5.5,5.5,0,0,1,924.951-3491.017Zm20.839,8.131c-1.251,0-2.452.015-3.653,0-1.805-.027-2.656-.916-2.668-2.767-.008-1.213,0-2.426,0-3.685h-13.34v4.929a1.53,1.53,0,0,0,.277.069c2.321.007,4.641-.008,6.962.021a4.035,4.035,0,0,1,4.082,4.233q.043,4.031,0,8.063a4.067,4.067,0,0,1-4.105,4.228c-2.085.03-4.171,0-6.256.009-.321,0-.642.039-.945.059v1.878h19.649Zm-16.36,13.5h3.729c.067,0,.134,0,.2,0a2.441,2.441,0,0,0,2.542-2.622q.061-4.025,0-8.053a2.431,2.431,0,0,0-2.491-2.683q-3.929-.092-7.86,0a2.4,2.4,0,0,0-2.5,2.575q-.079,4.077,0,8.157a2.434,2.434,0,0,0,2.644,2.625C926.943-3469.369,928.186-3469.39,929.429-3469.389Zm14.81-15.11-3.282-3.523c0,.838-.011,1.7,0,2.563.01.623.307.969.94.963C942.738-3484.505,943.575-3484.5,944.239-3484.5Z" transform="translate(-921.497 3491.017)"/>\
              <path id="路径_111" data-name="路径 111" d="M950.314-3439.021c0,1.862.006,3.454,0,5.046,0,.574.139,1.309-.742,1.333s-.784-.7-.787-1.286c-.008-1.6,0-3.195,0-5.06-.413.368-.638.7-.942.808a5.272,5.272,0,0,1-1.275.146c.049-.4-.042-.914.173-1.175.638-.775,1.394-1.453,2.109-2.164a.906.906,0,0,1,1.449.035c.662.666,1.323,1.332,1.991,1.992.412.408.71.93.172,1.319-.249.18-.854-.043-1.256-.2C950.934-3438.321,950.743-3438.62,950.314-3439.021Z" transform="translate(-941.269 3452.128)"/>\
            </g></svg>'+
          '</div>' +
          // 连读的icon
          '<div class="readtype_btnIcon_close">'+
            '<svg xmlns="http://www.w3.org/2000/svg" width="25.861" height="26.815" viewBox="0 0 25.861 26.815">\
            <g id="组_99" data-name="组 99" transform="translate(-434.498 -402.592)">\
              <path id="路径_110" data-name="路径 110" d="M924.951-3491.017h15.544c.313.308.631.611.94.923q2.963,2.993,5.923,5.99v19.482a4.654,4.654,0,0,1-1.292.4c-6.722.025-13.444.019-20.166.017-1.219,0-1.348-.136-1.357-1.364-.005-.766,0-1.531,0-2.316-2.286-.849-3.12-2.574-3.041-4.978.078-2.369.013-4.743.019-7.114a4.044,4.044,0,0,1,2.417-3.986.907.907,0,0,0,.614-1.008c-.027-1.569-.04-3.14.009-4.708A5.5,5.5,0,0,1,924.951-3491.017Zm20.839,8.131c-1.251,0-2.452.015-3.653,0-1.805-.027-2.656-.916-2.668-2.767-.008-1.213,0-2.426,0-3.685h-13.34v4.929a1.53,1.53,0,0,0,.277.069c2.321.007,4.641-.008,6.962.021a4.035,4.035,0,0,1,4.082,4.233q.043,4.031,0,8.063a4.067,4.067,0,0,1-4.105,4.228c-2.085.03-4.171,0-6.256.009-.321,0-.642.039-.945.059v1.878h19.649Zm-16.36,13.5h3.729c.067,0,.134,0,.2,0a2.441,2.441,0,0,0,2.542-2.622q.061-4.025,0-8.053a2.431,2.431,0,0,0-2.491-2.683q-3.929-.092-7.86,0a2.4,2.4,0,0,0-2.5,2.575q-.079,4.077,0,8.157a2.434,2.434,0,0,0,2.644,2.625C926.943-3469.369,928.186-3469.39,929.429-3469.389Zm14.81-15.11-3.282-3.523c0,.838-.011,1.7,0,2.563.01.623.307.969.94.963C942.738-3484.505,943.575-3484.5,944.239-3484.5Z" transform="translate(-486.999 3893.609)" fill="currentColor"/>\
              <path id="路径_111" data-name="路径 111" d="M950.314-3435.337c0-1.862.006-3.454,0-5.046,0-.574.139-1.309-.742-1.333s-.784.7-.787,1.286c-.008,1.6,0,3.195,0,5.06-.413-.368-.638-.7-.942-.808a5.272,5.272,0,0,0-1.275-.146c.049.4-.042.914.173,1.175.638.775,1.394,1.453,2.109,2.164a.906.906,0,0,0,1.449-.035c.662-.666,1.323-1.332,1.991-1.992.412-.408.71-.93.172-1.319-.249-.18-.854.043-1.256.2C950.934-3436.037,950.743-3435.738,950.314-3435.337Z" transform="translate(-506.771 3854.721)" fill="currentColor"/>\
              <text id="A_Z" data-name="AZ" transform="translate(452 418)" fill="currentColor" font-size="8" font-family="SourceHanSansCN-Medium, Source Han Sans CN" font-weight="500"><tspan x="0" y="0">A</tspan><tspan x="0" y="7">Z</tspan></text>\
            </g></svg>'+
          '</div>' +
        '</div>'+
        '<div class="text_color">阅读方式</div>' +
      '</div>' +
    '</div>' +
    '<div class="color-toolbar-pannel fun_button_list_color toolbar-item-audio" audio="color-ysps" data-mtpis="当前为页面原始配色,调整配色请按 ctrl + alt + T" style="display: block;" onclick="setColorFunction()">'+
      // '页面原始配色'
      '<div class="color-item default-color showChangeColor">'+
        '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 28.32 27.747"  width="28.32" height="27.747">\
          <path data-name="路径 171" d="M-665.04-2072.453a4.308,4.308,0,0,1,.747.485q2.645,2.614,5.263,5.255a1.908,1.908,0,0,1,.184.262c.129-.122.2-.189.273-.259l3.05-3.05a.873.873,0,0,1,1.428,0q5.562,5.562,11.125,11.123a18.313,18.313,0,0,1,2.518,2.892,4.322,4.322,0,0,1,.856,2.464,3.723,3.723,0,0,1-3.164,3.518,3.757,3.757,0,0,1-4.269-3.161c-.093.089-.169.157-.241.229q-3.529,3.529-7.06,7.056a3.305,3.305,0,0,1-4.121.391,3.421,3.421,0,0,1-.508-.423q-4-3.994-8-7.994a3.161,3.161,0,0,1-.911-1.79.655.655,0,0,0-.047-.125v-.83a.232.232,0,0,0,.039-.071,3.361,3.361,0,0,1,1.034-1.961q3.322-3.3,6.626-6.618a2.015,2.015,0,0,1,.283-.2c-.127-.135-.193-.209-.263-.28l-5.332-5.333a2.321,2.321,0,0,1-.209-.22.826.826,0,0,1,.407-1.3l.18-.06Zm6.191,8.327a2.354,2.354,0,0,1-.167.2q-3.332,3.335-6.666,6.668a1.642,1.642,0,0,0,.01,2.526l7.761,7.762a1.645,1.645,0,0,0,2.566,0q5.318-5.318,10.638-10.633a.6.6,0,0,1,.21-.107l-10.306-10.307-2.768,2.768c.643.64,1.319,1.306,1.985,1.983.116.118.2.065.314.021a2.647,2.647,0,0,1,2.758.394,2.519,2.519,0,0,1,.965,2.552,2.591,2.591,0,0,1-1.837,2.154,2.548,2.548,0,0,1-2.766-.689,2.666,2.666,0,0,1-.519-3.118Zm15.517,7.471c-.26.266-.508.5-.733.756a5.8,5.8,0,0,0-1.2,1.9,1.811,1.811,0,0,0,.458,2,2.112,2.112,0,0,0,2.754.185,1.891,1.891,0,0,0,.491-2.579A11.093,11.093,0,0,0-643.332-2056.655Zm-10.894-3.017a1.062,1.062,0,0,0,1.073-1.033,1.065,1.065,0,0,0-1.048-1.088,1.068,1.068,0,0,0-1.088,1.077A1.065,1.065,0,0,0-654.225-2059.672Z" transform="translate(667.916 2072.453)" fill="currentColor"/>\
        </svg>'+
      '</div>' +
      // 白底黑字蓝链接
      '<div class="color-item white-black-blue hideChangeColor ">'+
        '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 28.32 27.747"  width="28.32" height="27.747">\
          <path data-name="路径 171" d="M-665.04-2072.453a4.308,4.308,0,0,1,.747.485q2.645,2.614,5.263,5.255a1.908,1.908,0,0,1,.184.262c.129-.122.2-.189.273-.259l3.05-3.05a.873.873,0,0,1,1.428,0q5.562,5.562,11.125,11.123a18.313,18.313,0,0,1,2.518,2.892,4.322,4.322,0,0,1,.856,2.464,3.723,3.723,0,0,1-3.164,3.518,3.757,3.757,0,0,1-4.269-3.161c-.093.089-.169.157-.241.229q-3.529,3.529-7.06,7.056a3.305,3.305,0,0,1-4.121.391,3.421,3.421,0,0,1-.508-.423q-4-3.994-8-7.994a3.161,3.161,0,0,1-.911-1.79.655.655,0,0,0-.047-.125v-.83a.232.232,0,0,0,.039-.071,3.361,3.361,0,0,1,1.034-1.961q3.322-3.3,6.626-6.618a2.015,2.015,0,0,1,.283-.2c-.127-.135-.193-.209-.263-.28l-5.332-5.333a2.321,2.321,0,0,1-.209-.22.826.826,0,0,1,.407-1.3l.18-.06Zm6.191,8.327a2.354,2.354,0,0,1-.167.2q-3.332,3.335-6.666,6.668a1.642,1.642,0,0,0,.01,2.526l7.761,7.762a1.645,1.645,0,0,0,2.566,0q5.318-5.318,10.638-10.633a.6.6,0,0,1,.21-.107l-10.306-10.307-2.768,2.768c.643.64,1.319,1.306,1.985,1.983.116.118.2.065.314.021a2.647,2.647,0,0,1,2.758.394,2.519,2.519,0,0,1,.965,2.552,2.591,2.591,0,0,1-1.837,2.154,2.548,2.548,0,0,1-2.766-.689,2.666,2.666,0,0,1-.519-3.118Zm15.517,7.471c-.26.266-.508.5-.733.756a5.8,5.8,0,0,0-1.2,1.9,1.811,1.811,0,0,0,.458,2,2.112,2.112,0,0,0,2.754.185,1.891,1.891,0,0,0,.491-2.579A11.093,11.093,0,0,0-643.332-2056.655Zm-10.894-3.017a1.062,1.062,0,0,0,1.073-1.033,1.065,1.065,0,0,0-1.048-1.088,1.068,1.068,0,0,0-1.088,1.077A1.065,1.065,0,0,0-654.225-2059.672Z" transform="translate(667.916 2072.453)" fill="currentColor"/>\
        </svg>'+
      '</div>' +
      // 蓝底黄字白链接
      '<div class="color-item blue-yellow-white hideChangeColor ">'+
        '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 28.32 27.747"  width="28.32" height="27.747">\
          <path data-name="路径 171" d="M-665.04-2072.453a4.308,4.308,0,0,1,.747.485q2.645,2.614,5.263,5.255a1.908,1.908,0,0,1,.184.262c.129-.122.2-.189.273-.259l3.05-3.05a.873.873,0,0,1,1.428,0q5.562,5.562,11.125,11.123a18.313,18.313,0,0,1,2.518,2.892,4.322,4.322,0,0,1,.856,2.464,3.723,3.723,0,0,1-3.164,3.518,3.757,3.757,0,0,1-4.269-3.161c-.093.089-.169.157-.241.229q-3.529,3.529-7.06,7.056a3.305,3.305,0,0,1-4.121.391,3.421,3.421,0,0,1-.508-.423q-4-3.994-8-7.994a3.161,3.161,0,0,1-.911-1.79.655.655,0,0,0-.047-.125v-.83a.232.232,0,0,0,.039-.071,3.361,3.361,0,0,1,1.034-1.961q3.322-3.3,6.626-6.618a2.015,2.015,0,0,1,.283-.2c-.127-.135-.193-.209-.263-.28l-5.332-5.333a2.321,2.321,0,0,1-.209-.22.826.826,0,0,1,.407-1.3l.18-.06Zm6.191,8.327a2.354,2.354,0,0,1-.167.2q-3.332,3.335-6.666,6.668a1.642,1.642,0,0,0,.01,2.526l7.761,7.762a1.645,1.645,0,0,0,2.566,0q5.318-5.318,10.638-10.633a.6.6,0,0,1,.21-.107l-10.306-10.307-2.768,2.768c.643.64,1.319,1.306,1.985,1.983.116.118.2.065.314.021a2.647,2.647,0,0,1,2.758.394,2.519,2.519,0,0,1,.965,2.552,2.591,2.591,0,0,1-1.837,2.154,2.548,2.548,0,0,1-2.766-.689,2.666,2.666,0,0,1-.519-3.118Zm15.517,7.471c-.26.266-.508.5-.733.756a5.8,5.8,0,0,0-1.2,1.9,1.811,1.811,0,0,0,.458,2,2.112,2.112,0,0,0,2.754.185,1.891,1.891,0,0,0,.491-2.579A11.093,11.093,0,0,0-643.332-2056.655Zm-10.894-3.017a1.062,1.062,0,0,0,1.073-1.033,1.065,1.065,0,0,0-1.048-1.088,1.068,1.068,0,0,0-1.088,1.077A1.065,1.065,0,0,0-654.225-2059.672Z" transform="translate(667.916 2072.453)" fill="currentColor"/>\
        </svg>'+
      '</div>' +
      // 黄底黑字蓝链接
      '<div class="color-item yellow-black-blue hideChangeColor " >'+
        '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 28.32 27.747"  width="28.32" height="27.747">\
          <path data-name="路径 171" d="M-665.04-2072.453a4.308,4.308,0,0,1,.747.485q2.645,2.614,5.263,5.255a1.908,1.908,0,0,1,.184.262c.129-.122.2-.189.273-.259l3.05-3.05a.873.873,0,0,1,1.428,0q5.562,5.562,11.125,11.123a18.313,18.313,0,0,1,2.518,2.892,4.322,4.322,0,0,1,.856,2.464,3.723,3.723,0,0,1-3.164,3.518,3.757,3.757,0,0,1-4.269-3.161c-.093.089-.169.157-.241.229q-3.529,3.529-7.06,7.056a3.305,3.305,0,0,1-4.121.391,3.421,3.421,0,0,1-.508-.423q-4-3.994-8-7.994a3.161,3.161,0,0,1-.911-1.79.655.655,0,0,0-.047-.125v-.83a.232.232,0,0,0,.039-.071,3.361,3.361,0,0,1,1.034-1.961q3.322-3.3,6.626-6.618a2.015,2.015,0,0,1,.283-.2c-.127-.135-.193-.209-.263-.28l-5.332-5.333a2.321,2.321,0,0,1-.209-.22.826.826,0,0,1,.407-1.3l.18-.06Zm6.191,8.327a2.354,2.354,0,0,1-.167.2q-3.332,3.335-6.666,6.668a1.642,1.642,0,0,0,.01,2.526l7.761,7.762a1.645,1.645,0,0,0,2.566,0q5.318-5.318,10.638-10.633a.6.6,0,0,1,.21-.107l-10.306-10.307-2.768,2.768c.643.64,1.319,1.306,1.985,1.983.116.118.2.065.314.021a2.647,2.647,0,0,1,2.758.394,2.519,2.519,0,0,1,.965,2.552,2.591,2.591,0,0,1-1.837,2.154,2.548,2.548,0,0,1-2.766-.689,2.666,2.666,0,0,1-.519-3.118Zm15.517,7.471c-.26.266-.508.5-.733.756a5.8,5.8,0,0,0-1.2,1.9,1.811,1.811,0,0,0,.458,2,2.112,2.112,0,0,0,2.754.185,1.891,1.891,0,0,0,.491-2.579A11.093,11.093,0,0,0-643.332-2056.655Zm-10.894-3.017a1.062,1.062,0,0,0,1.073-1.033,1.065,1.065,0,0,0-1.048-1.088,1.068,1.068,0,0,0-1.088,1.077A1.065,1.065,0,0,0-654.225-2059.672Z" transform="translate(667.916 2072.453)" fill="currentColor"/>\
        </svg>'+
      '</div>' +
      // 黑底黄字白链接
      '<div class="color-item black-yellow-white hideChangeColor " >'+
        '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 28.32 27.747"  width="28.32" height="27.747">\
          <path data-name="路径 171" d="M-665.04-2072.453a4.308,4.308,0,0,1,.747.485q2.645,2.614,5.263,5.255a1.908,1.908,0,0,1,.184.262c.129-.122.2-.189.273-.259l3.05-3.05a.873.873,0,0,1,1.428,0q5.562,5.562,11.125,11.123a18.313,18.313,0,0,1,2.518,2.892,4.322,4.322,0,0,1,.856,2.464,3.723,3.723,0,0,1-3.164,3.518,3.757,3.757,0,0,1-4.269-3.161c-.093.089-.169.157-.241.229q-3.529,3.529-7.06,7.056a3.305,3.305,0,0,1-4.121.391,3.421,3.421,0,0,1-.508-.423q-4-3.994-8-7.994a3.161,3.161,0,0,1-.911-1.79.655.655,0,0,0-.047-.125v-.83a.232.232,0,0,0,.039-.071,3.361,3.361,0,0,1,1.034-1.961q3.322-3.3,6.626-6.618a2.015,2.015,0,0,1,.283-.2c-.127-.135-.193-.209-.263-.28l-5.332-5.333a2.321,2.321,0,0,1-.209-.22.826.826,0,0,1,.407-1.3l.18-.06Zm6.191,8.327a2.354,2.354,0,0,1-.167.2q-3.332,3.335-6.666,6.668a1.642,1.642,0,0,0,.01,2.526l7.761,7.762a1.645,1.645,0,0,0,2.566,0q5.318-5.318,10.638-10.633a.6.6,0,0,1,.21-.107l-10.306-10.307-2.768,2.768c.643.64,1.319,1.306,1.985,1.983.116.118.2.065.314.021a2.647,2.647,0,0,1,2.758.394,2.519,2.519,0,0,1,.965,2.552,2.591,2.591,0,0,1-1.837,2.154,2.548,2.548,0,0,1-2.766-.689,2.666,2.666,0,0,1-.519-3.118Zm15.517,7.471c-.26.266-.508.5-.733.756a5.8,5.8,0,0,0-1.2,1.9,1.811,1.811,0,0,0,.458,2,2.112,2.112,0,0,0,2.754.185,1.891,1.891,0,0,0,.491-2.579A11.093,11.093,0,0,0-643.332-2056.655Zm-10.894-3.017a1.062,1.062,0,0,0,1.073-1.033,1.065,1.065,0,0,0-1.048-1.088,1.068,1.068,0,0,0-1.088,1.077A1.065,1.065,0,0,0-654.225-2059.672Z" transform="translate(667.916 2072.453)" fill="currentColor"/>\
        </svg>'+
      '</div>' +
      '<div class="text_color" >颜色</div>' +
    '</div>' +
      // 放大
    '<div class="fun_button_list button_list width_b">' +
      '<div class="toolbar-item-bg bg-left page_plus toolbar-item-audio" id="barrierfree_zoom_in" audio="zoom-out"  onclick="openPageFunction(0);"  data-mtpis="页面放大,请按ctrl + alt + 加号">' +
        '<svg xmlns="http://www.w3.org/2000/svg" data-name="组 63" viewBox="0 0 27.82 27.821" width="28.82" height="27.821">\
          <path data-name="路径 53" d="M2732.284-2026.533c-.044-.174-.084-.348-.133-.521a3.655,3.655,0,0,0-.973-1.605q-3.548-3.538-7.091-7.08a.384.384,0,0,1-.1-.507,10.171,10.171,0,0,0-6.948-13.854c-.561-.131-1.137-.195-1.706-.29h-1.413c-.525.087-1.055.149-1.573.267a10.109,10.109,0,0,0-7.731,8.183,10.155,10.155,0,0,0,8.011,11.693,9.9,9.9,0,0,0,6.007-.628.354.354,0,0,1,.464.1q3.565,3.581,7.144,7.148a3.515,3.515,0,0,0,5.64-.836,8.3,8.3,0,0,0,.406-1.2Zm-17.648-5.15a8.528,8.528,0,0,1-8.546-8.522,8.531,8.531,0,0,1,8.517-8.554,8.523,8.523,0,0,1,8.554,8.511A8.52,8.52,0,0,1,2714.636-2031.683Zm9.378,3.5,2.639-2.638c1.174,1.16,2.389,2.314,3.546,3.522a1.832,1.832,0,0,1-.111,2.556,1.849,1.849,0,0,1-2.581.065C2726.316-2025.829,2725.167-2027.024,2724.014-2028.186Zm-3.629-3.646a10.525,10.525,0,0,0,2.639-2.635l2.42,2.419-2.629,2.643Z" transform="translate(-2704.464 2050.39)" fill="currentColor"/>\
          <path data-name="路径 54" d="M2958.035-1934.213c.805,0,1.573,0,2.34,0a1.445,1.445,0,0,0,.35-.027.821.821,0,0,0,.61-.854.827.827,0,0,0-.829-.745c-.715-.009-1.43,0-2.145,0h-.327V-1937c0-.425,0-.851,0-1.276a.819.819,0,0,0-.814-.865.823.823,0,0,0-.814.869c-.005.8,0,1.59,0,2.425h-.3c-.688,0-1.375,0-2.063,0a.836.836,0,0,0-.928.81.827.827,0,0,0,.915.819c.778,0,1.555,0,2.366,0,0,.106.012.2.012.3,0,.688,0,1.375,0,2.063a.846.846,0,0,0,.825.944.835.835,0,0,0,.805-.931C2958.037-1932.619,2958.035-1933.4,2958.035-1934.213Z" transform="translate(-2947.059 1945.195)" fill="currentColor"/>\
        </svg>'+
        '<div class="text_color" onclick="openPageFunction(0);">放大</div>' +
      '</div>' +
    '</div>' +
      // 缩小
    '<div class="fun_button_list button_list width_b" >' +
      '<div class="toolbar-item-bg page_minus toolbar-item-audio" id="barrierfree_zoom_out" audio="zoom-in" onclick="openPageFunction(1);" data-mtpis="页面缩小,请按ctrl + alt + 减号">' +
        '<svg xmlns="http://www.w3.org/2000/svg" data-name="组 65" viewBox="0 0 27.82 27.821" width="28.82" height="27.821">\
          <path data-name="路径 53" d="M2732.284-2026.533c-.044-.174-.084-.348-.133-.521a3.655,3.655,0,0,0-.973-1.605q-3.548-3.538-7.091-7.08a.384.384,0,0,1-.1-.507,10.171,10.171,0,0,0-6.948-13.854c-.561-.131-1.137-.195-1.706-.29h-1.413c-.525.087-1.055.149-1.573.267a10.109,10.109,0,0,0-7.731,8.183,10.155,10.155,0,0,0,8.011,11.693,9.9,9.9,0,0,0,6.007-.628.354.354,0,0,1,.464.1q3.565,3.581,7.144,7.148a3.515,3.515,0,0,0,5.64-.836,8.3,8.3,0,0,0,.406-1.2Zm-17.648-5.15a8.528,8.528,0,0,1-8.546-8.522,8.531,8.531,0,0,1,8.517-8.554,8.523,8.523,0,0,1,8.554,8.511A8.52,8.52,0,0,1,2714.636-2031.683Zm9.378,3.5,2.639-2.638c1.174,1.16,2.389,2.314,3.546,3.522a1.832,1.832,0,0,1-.111,2.556,1.849,1.849,0,0,1-2.581.065C2726.316-2025.829,2725.167-2027.024,2724.014-2028.186Zm-3.629-3.646a10.525,10.525,0,0,0,2.639-2.635l2.42,2.419-2.629,2.643Z" transform="translate(-2704.464 2050.39)" fill="currentColor"/>\
          <path data-name="路径 54" d="M2960.376-1934.214a1.445,1.445,0,0,0,.35-.027.821.821,0,0,0,.61-.854.827.827,0,0,0-.829-.745c-.715-.009-1.43,0-2.145,0h-2.26c-.688,0-1.375,0-2.063,0a.836.836,0,0,0-.928.81.827.827,0,0,0,.915.819c.778,0,1.555,0,2.366,0Z" transform="translate(-2947.059 1945.195)" fill="currentColor"/>\
        </svg>'+
        '<div class="text_color" onclick="openPageFunction(1);">缩小</div>' +
      '</div>' +
    '</div>' +
    //鼠标样式
    '<div class="fun_button_list toolbar-item-audio" id="mouse" audio="bigmouse-open" onclick="bigMouseBtn();" data-mtpis="开启大鼠标, 请按ctrl + alt + M">'+
      '<div class="button_list voice_set">' +
        // 关闭大鼠表icon
        '<div class="mouse_btn_n">'+
          '<svg id="组_66" data-name="组 66" xmlns="http://www.w3.org/2000/svg" width="29.004" height="29" viewBox="0 0 29.004 29">\
            <path id="路径_39" data-name="路径 39" d="M832.429-2066.64c.28.727.568,1.451.839,2.182q4.622,12.429,9.238,24.859a.972.972,0,0,0,.668.7.865.865,0,0,0,1.03-.625q.882-2.281,1.759-4.564l1.025-2.665a.75.75,0,0,1,.178-.268,1.517,1.517,0,0,0,.181.288q3.72,3.73,7.45,7.45c.21.209.456.381.686.57h.453a7.81,7.81,0,0,0,.651-.525q2.24-2.225,4.467-4.463a.89.89,0,0,0,0-1.461l-7.667-7.67c-.066-.066-.128-.135-.223-.235l1.616-.625,5.774-2.228c.507-.2.718-.45.714-.868s-.217-.662-.707-.844l-17.668-6.571q-4.53-1.684-9.059-3.369c-.729-.271-1.014-.177-1.4.474Zm10.954,24.517-8.66-23.3,23.286,8.66c-.165.065-.277.111-.389.154q-3.1,1.193-6.2,2.385a.9.9,0,0,0-.622.641.932.932,0,0,0,.33.91q4.008,4,8.01,8.008c.077.077.15.157.187.2l-3.68,3.682a2.68,2.68,0,0,0-.193-.235q-3.992-4-7.987-7.991a.867.867,0,0,0-1.553.322q-.768,1.991-1.534,3.983C844.056-2043.864,843.731-2043.023,843.383-2042.122Z" transform="translate(-832.429 2067.709)" fill="currentColor"/>\
          </svg>'+
          '</div>' +
          // 开启大鼠表icon
          '<div class="mouse_btn_big">'+
            '<svg id="组_66" data-name="组 66" xmlns="http://www.w3.org/2000/svg" width="29.004" height="29" viewBox="0 0 29.004 29">\
              <path id="路径_39" data-name="路径 39" d="M832.429-2066.64c.28.727.568,1.451.839,2.182q4.622,12.429,9.238,24.859a.972.972,0,0,0,.668.7.865.865,0,0,0,1.03-.625q.882-2.281,1.759-4.564l1.025-2.665a.75.75,0,0,1,.178-.268,1.517,1.517,0,0,0,.181.288q3.72,3.73,7.45,7.45c.21.209.456.381.686.57h.453a7.81,7.81,0,0,0,.651-.525q2.24-2.225,4.467-4.463a.89.89,0,0,0,0-1.461l-7.667-7.67c-.066-.066-.128-.135-.223-.235l1.616-.625,5.774-2.228c.507-.2.718-.45.714-.868s-.217-.662-.707-.844l-17.668-6.571q-4.53-1.684-9.059-3.369c-.729-.271-1.014-.177-1.4.474Zm10.954,24.517-8.66-23.3,23.286,8.66c-.165.065-.277.111-.389.154q-3.1,1.193-6.2,2.385a.9.9,0,0,0-.622.641.932.932,0,0,0,.33.91q4.008,4,8.01,8.008c.077.077.15.157.187.2l-3.68,3.682a2.68,2.68,0,0,0-.193-.235q-3.992-4-7.987-7.991a.867.867,0,0,0-1.553.322q-.768,1.991-1.534,3.983C844.056-2043.864,843.731-2043.023,843.383-2042.122Z" transform="translate(-832.429 2067.709)" fill="currentColor"/>\
            </svg>'+
          '</div>' +
        '<div class="text_color">鼠标样式</div>' +
      '</div>' +
    '</div>' +
    // 辅助线
    '<div class="fun_button_list toolbar-item-audio" id="line" audio="bfr-line-open" onclick="openLineFunction();" data-mtpis="开启辅助线, 请按ctrl + alt + N">'+
      '<div class="button_list voice_set">' +
        // 关闭十字线icon
        '<div class="line_btn_n">'+
          '<svg xmlns="http://www.w3.org/2000/svg" width="29.657" height="29.635" viewBox="0 0 29.657 29.635">\
              <g id="组_72" data-name="组 72" transform="translate(-1455.14 3385.492)">\
                <g id="组_87" data-name="组 87">\
                  <path id="路径_113" data-name="路径 113" d="M1515.915-3385.492a5.252,5.252,0,0,1,.483,1.468c.048,2.661.016,5.322.027,7.984,0,.717-.1,1.4-.975,1.4s-.976-.687-.973-1.4c.011-2.662-.021-5.323.027-7.984a5.245,5.245,0,0,1,.483-1.467Z" transform="translate(-45.465)" fill="currentColor"/>\
                  <path id="路径_114" data-name="路径 114" d="M1455.14-3325.646a5.23,5.23,0,0,1,1.467-.483c2.661-.048,5.322-.016,7.984-.027.716,0,1.4.1,1.4.973s-.685.978-1.4.975c-2.661-.011-5.323.021-7.984-.027a5.249,5.249,0,0,1-1.468-.483Z" transform="translate(0 -45.464)" fill="currentColor"/>\
                  <path id="路径_115" data-name="路径 115" d="M1541.126-3324.21c-1.385,0-2.771-.009-4.156,0-.7.006-1.278-.206-1.263-.994s.615-.955,1.305-.952q4.1.016,8.2,0c.683,0,1.3.142,1.319.937.02.874-.637,1.016-1.362,1.01C1543.82-3324.219,1542.473-3324.21,1541.126-3324.21Z" transform="translate(-61.732 -45.466)" fill="currentColor"/>\
                  <path id="路径_116" data-name="路径 116" d="M1514.49-3299.444c0-1.385.008-2.771,0-4.156-.006-.706.239-1.345.992-1.213a1.542,1.542,0,0,1,.905,1.162q.12,4.21,0,8.425a1.537,1.537,0,0,1-.911,1.155c-.76.132-.992-.516-.986-1.217C1514.5-3296.674,1514.49-3298.059,1514.49-3299.444Z" transform="translate(-45.472 -61.804)" fill="currentColor"/>\
                </g>\
              </g>\
            </svg>'+
          '</div>' +
          // 开启十字线icon
          '<div class="line_btn_y">'+
            '<svg xmlns="http://www.w3.org/2000/svg" width="29.657" height="29.635" viewBox="0 0 29.657 29.635">\
              <g id="组_72" data-name="组 72" transform="translate(-1455.14 3385.492)">\
                <g id="组_87" data-name="组 87">\
                  <path id="路径_113" data-name="路径 113" d="M1515.915-3385.492a5.252,5.252,0,0,1,.483,1.468c.048,2.661.016,5.322.027,7.984,0,.717-.1,1.4-.975,1.4s-.976-.687-.973-1.4c.011-2.662-.021-5.323.027-7.984a5.245,5.245,0,0,1,.483-1.467Z" transform="translate(-45.465)" fill="currentColor"/>\
                  <path id="路径_114" data-name="路径 114" d="M1455.14-3325.646a5.23,5.23,0,0,1,1.467-.483c2.661-.048,5.322-.016,7.984-.027.716,0,1.4.1,1.4.973s-.685.978-1.4.975c-2.661-.011-5.323.021-7.984-.027a5.249,5.249,0,0,1-1.468-.483Z" transform="translate(0 -45.464)" fill="currentColor"/>\
                  <path id="路径_115" data-name="路径 115" d="M1541.126-3324.21c-1.385,0-2.771-.009-4.156,0-.7.006-1.278-.206-1.263-.994s.615-.955,1.305-.952q4.1.016,8.2,0c.683,0,1.3.142,1.319.937.02.874-.637,1.016-1.362,1.01C1543.82-3324.219,1542.473-3324.21,1541.126-3324.21Z" transform="translate(-61.732 -45.466)" fill="currentColor"/>\
                  <path id="路径_116" data-name="路径 116" d="M1514.49-3299.444c0-1.385.008-2.771,0-4.156-.006-.706.239-1.345.992-1.213a1.542,1.542,0,0,1,.905,1.162q.12,4.21,0,8.425a1.537,1.537,0,0,1-.911,1.155c-.76.132-.992-.516-.986-1.217C1514.5-3296.674,1514.49-3298.059,1514.49-3299.444Z" transform="translate(-45.472 -61.804)" fill="currentColor"/>\
                </g>\
              </g>\
            </svg>'+
          '</div>' +
        '<div class="text_color">十字线</div>' +
      '</div>' +
    '</div>' +
     // 辅屏
    '<div class="fun_button_list toolbar-item-audio help_screen" id="screen" audio="helpscreen-open" onclick="toolbar.Function.textTips.mainMethod();" data-mtpis="开启辅屏 请按ctrl + alt + B">'+
      '<div class="button_list voice_set">' +
        // 关闭辅屏icon
        '<div class="auxiliary_btn_n">'+
              '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32.498 29.391" width="32.498" height="29.391">\
                <g data-name="组 82" fill="currentColor">\
                  <path data-name="路径 127" d="M1346.751-2991.417v-10.856c.016-.049.037-.1.049-.146a2.136,2.136,0,0,1,1.107-1.456,5.75,5.75,0,0,1,.716-.269h16.7a.193.193,0,0,0,.055.035,2.18,2.18,0,0,1,1.815,2.26q0,5,0,10.009a2.686,2.686,0,0,1-.068.631,2.176,2.176,0,0,1-2.2,1.661q-5.6,0-11.2,0c-1.589,0-3.178,0-4.767,0a2.19,2.19,0,0,1-2.1-1.5C1346.821-2991.172,1346.787-2991.295,1346.751-2991.417Zm10.227.411h7.894a.753.753,0,0,0,.862-.867q0-4.972,0-9.944a.754.754,0,0,0-.862-.867h-15.788c-.607,0-.873.268-.873.877v9.921c0,.606.271.879.873.879Z" transform="translate(-1346.751 3013.42)"/>\
                  <path data-name="路径 128" d="M1348.751-2814.744c.113-.5.314-.666.6-.666,3.941.011,3.883.007,7.824.007.362,0,.577.328.577.877s-.215.878-.576.878c-3.942,0-3.883,0-7.824.007-.285,0-.485-.167-.6-.666Z" transform="translate(-1342.751 2843.032)"/>\
                  <path data-name="减去 1" d="M-218-417.448h0V-419.2h5.2a.906.906,0,0,0,1.037-1.042c0-3.984,0-10.973,0-14.956a.906.906,0,0,0-1.036-1.042h-18.984c-.725,0-1.049.325-1.05,1.055v3.546h-1.755v-4.108l.018-.052a1.126,1.126,0,0,0,.04-.124,2.566,2.566,0,0,1,1.33-1.75,3.793,3.793,0,0,1,.586-.23c.09-.03.184-.061.274-.094h20.083l.017.013a.131.131,0,0,0,.049.029A2.619,2.619,0,0,1-210-435.24c0,6.874,0,12.073,0,15.035a3.215,3.215,0,0,1-.083.759,2.62,2.62,0,0,1-2.646,2Z" transform="translate(242 438.501)" stroke="transparent" stroke-miterlimit="10"/>\
                  <path data-name="路径 128" d="M1346.751-2814.744c.106-.5.3-.666.566-.666,3.726.011,2.452.007,6.178.007.342,0,.546.328.546.877s-.2.878-.545.878c-3.726,0-2.452,0-6.178.007-.27,0-.459-.167-.566-.666Z" transform="translate(-1327.042 2841.032)"/>\
                </g>\
              </svg>'+
          '</div>' +
          // 开启辅屏icon
          '<div class="auxiliary_btn_y">'+
          '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32.498 29.391" width="32.498" height="29.391">\
            <g data-name="组 82" fill="currentColor">\
              <path data-name="路径 127" d="M1346.751-2991.417v-10.856c.016-.049.037-.1.049-.146a2.136,2.136,0,0,1,1.107-1.456,5.75,5.75,0,0,1,.716-.269h16.7a.193.193,0,0,0,.055.035,2.18,2.18,0,0,1,1.815,2.26q0,5,0,10.009a2.686,2.686,0,0,1-.068.631,2.176,2.176,0,0,1-2.2,1.661q-5.6,0-11.2,0c-1.589,0-3.178,0-4.767,0a2.19,2.19,0,0,1-2.1-1.5C1346.821-2991.172,1346.787-2991.295,1346.751-2991.417Zm10.227.411h7.894a.753.753,0,0,0,.862-.867q0-4.972,0-9.944a.754.754,0,0,0-.862-.867h-15.788c-.607,0-.873.268-.873.877v9.921c0,.606.271.879.873.879Z" transform="translate(-1346.751 3013.42)"/>\
              <path data-name="路径 128" d="M1348.751-2814.744c.113-.5.314-.666.6-.666,3.941.011,3.883.007,7.824.007.362,0,.577.328.577.877s-.215.878-.576.878c-3.942,0-3.883,0-7.824.007-.285,0-.485-.167-.6-.666Z" transform="translate(-1342.751 2843.032)"/>\
              <path data-name="减去 1" d="M-218-417.448h0V-419.2h5.2a.906.906,0,0,0,1.037-1.042c0-3.984,0-10.973,0-14.956a.906.906,0,0,0-1.036-1.042h-18.984c-.725,0-1.049.325-1.05,1.055v3.546h-1.755v-4.108l.018-.052a1.126,1.126,0,0,0,.04-.124,2.566,2.566,0,0,1,1.33-1.75,3.793,3.793,0,0,1,.586-.23c.09-.03.184-.061.274-.094h20.083l.017.013a.131.131,0,0,0,.049.029A2.619,2.619,0,0,1-210-435.24c0,6.874,0,12.073,0,15.035a3.215,3.215,0,0,1-.083.759,2.62,2.62,0,0,1-2.646,2Z" transform="translate(242 438.501)" stroke="transparent" stroke-miterlimit="10"/>\
              <path data-name="路径 128" d="M1346.751-2814.744c.106-.5.3-.666.566-.666,3.726.011,2.452.007,6.178.007.342,0,.546.328.546.877s-.2.878-.545.878c-3.726,0-2.452,0-6.178.007-.27,0-.459-.167-.566-.666Z" transform="translate(-1327.042 2841.032)"/>\
            </g>\
          </svg>'+
          '</div>' +
        '<div class="text_color">辅屏</div>' +
      '</div>' +
    '</div>' +
    // 纯文本
    '<div class="fun_button_list toolbar-item-audio" id="txt" audio="viewmode-text" onclick="openTextFunction();"  data-mtpis="进入纯文本模式, 请按 alt + shift + 3" >'+
      '<div class="button_list voice_set">' +
        // 关闭纯文本icon
        '<div class="only_text_btn_n">'+
            '<svg xmlns="http://www.w3.org/2000/svg" width="27.601" height="27.598" viewBox="0 0 27.601 27.598">\
              <g data-name="组 76">\
                <g data-name="组 88" fill="currentColor">\
                  <path data-name="路径 31" d="M129.974-1231.372h5.658a1.236,1.236,0,0,1,.593.593v5.658a1,1,0,0,1-1.083.6c-.5-.028-1-.006-1.517-.006v13.9c.517,0,1.018.022,1.517-.006a.994.994,0,0,1,1.083.6v5.658a1.031,1.031,0,0,1-1.085.6c-1.607-.021-3.215-.007-4.822-.008a.83.83,0,0,1-.938-.946c0-.546,0-1.092,0-1.652h-13.9c0,.565,0,1.112,0,1.659a.831.831,0,0,1-.944.939h-4.957a.832.832,0,0,1-.943-.941c0-1.544.026-3.09-.01-4.633-.023-.994.279-1.334,1.27-1.275.443.026.889,0,1.339,0V-1224.5a.244.244,0,0,0-.064-.026l-1.589-.005a.831.831,0,0,1-.946-.938c0-1.607.013-3.215-.008-4.822a1.031,1.031,0,0,1,.6-1.085h5.658a1,1,0,0,1,.6,1.083c-.028.5-.006,1-.006,1.517h13.9c0-.526.022-1.036-.006-1.545A.983.983,0,0,1,129.974-1231.372Zm-14.494,23.333h13.9c0-.6,0-1.17,0-1.743a.806.806,0,0,1,.847-.845c.135,0,.269,0,.4,0h1.345v-13.9H131.7c-.476,0-.952,0-1.428,0a.814.814,0,0,1-.892-.882c0-.377,0-.754,0-1.131v-.58H115.513c-.014.033-.027.049-.027.065q0,.781-.006,1.562c0,.667-.3.966-.97.967h-1.621v13.9c.576,0,1.131,0,1.686,0a.817.817,0,0,1,.9.9C115.482-1209.175,115.48-1208.62,115.48-1208.039Zm-1.629-21.7h-3.578v3.578h3.578Zm20.738,3.581v-3.579h-3.578v3.579Zm-20.732,17.167H110.27v3.569h3.588ZM134.6-1209h-3.583v3.579H134.6Z" transform="translate(-108.625 1231.372)"/>\
                  <path data-name="路径 32" d="M257.66-1089.787v-11.3h-3.443c0,.386.005.769,0,1.152a.736.736,0,0,1-.436.69.8.8,0,0,1-.842-.069.754.754,0,0,1-.329-.646c-.01-.655-.016-1.311,0-1.966a.809.809,0,0,1,.9-.8q4.31,0,8.621,0c.566,0,1.132,0,1.7,0a.8.8,0,0,1,.83.81c.014.646.015,1.293,0,1.94a.784.784,0,0,1-.823.81.784.784,0,0,1-.787-.841c0-.269,0-.539,0-.808v-.279h-3.729v11.3c.09,0,.185.012.28.012.548,0,1.1,0,1.643,0a.787.787,0,0,1,.844.817.783.783,0,0,1-.835.8q-2.761.007-5.523,0a.777.777,0,0,1-.826-.8.782.782,0,0,1,.821-.809C256.354-1089.793,256.991-1089.787,257.66-1089.787Z" transform="translate(-244.831 1109.248)"/>\
                </g>\
              </g>\
            </svg>'+
          '</div>' +
          // 开启纯文本icon
          '<div class="only_text_btn_y">'+
              '<svg xmlns="http://www.w3.org/2000/svg" width="27.601" height="27.598" viewBox="0 0 27.601 27.598">\
                <g data-name="组 76">\
                  <g data-name="组 88" fill="currentColor">\
                    <path data-name="路径 31" d="M129.974-1231.372h5.658a1.236,1.236,0,0,1,.593.593v5.658a1,1,0,0,1-1.083.6c-.5-.028-1-.006-1.517-.006v13.9c.517,0,1.018.022,1.517-.006a.994.994,0,0,1,1.083.6v5.658a1.031,1.031,0,0,1-1.085.6c-1.607-.021-3.215-.007-4.822-.008a.83.83,0,0,1-.938-.946c0-.546,0-1.092,0-1.652h-13.9c0,.565,0,1.112,0,1.659a.831.831,0,0,1-.944.939h-4.957a.832.832,0,0,1-.943-.941c0-1.544.026-3.09-.01-4.633-.023-.994.279-1.334,1.27-1.275.443.026.889,0,1.339,0V-1224.5a.244.244,0,0,0-.064-.026l-1.589-.005a.831.831,0,0,1-.946-.938c0-1.607.013-3.215-.008-4.822a1.031,1.031,0,0,1,.6-1.085h5.658a1,1,0,0,1,.6,1.083c-.028.5-.006,1-.006,1.517h13.9c0-.526.022-1.036-.006-1.545A.983.983,0,0,1,129.974-1231.372Zm-14.494,23.333h13.9c0-.6,0-1.17,0-1.743a.806.806,0,0,1,.847-.845c.135,0,.269,0,.4,0h1.345v-13.9H131.7c-.476,0-.952,0-1.428,0a.814.814,0,0,1-.892-.882c0-.377,0-.754,0-1.131v-.58H115.513c-.014.033-.027.049-.027.065q0,.781-.006,1.562c0,.667-.3.966-.97.967h-1.621v13.9c.576,0,1.131,0,1.686,0a.817.817,0,0,1,.9.9C115.482-1209.175,115.48-1208.62,115.48-1208.039Zm-1.629-21.7h-3.578v3.578h3.578Zm20.738,3.581v-3.579h-3.578v3.579Zm-20.732,17.167H110.27v3.569h3.588ZM134.6-1209h-3.583v3.579H134.6Z" transform="translate(-108.625 1231.372)"/>\
                    <path data-name="路径 32" d="M257.66-1089.787v-11.3h-3.443c0,.386.005.769,0,1.152a.736.736,0,0,1-.436.69.8.8,0,0,1-.842-.069.754.754,0,0,1-.329-.646c-.01-.655-.016-1.311,0-1.966a.809.809,0,0,1,.9-.8q4.31,0,8.621,0c.566,0,1.132,0,1.7,0a.8.8,0,0,1,.83.81c.014.646.015,1.293,0,1.94a.784.784,0,0,1-.823.81.784.784,0,0,1-.787-.841c0-.269,0-.539,0-.808v-.279h-3.729v11.3c.09,0,.185.012.28.012.548,0,1.1,0,1.643,0a.787.787,0,0,1,.844.817.783.783,0,0,1-.835.8q-2.761.007-5.523,0a.777.777,0,0,1-.826-.8.782.782,0,0,1,.821-.809C256.354-1089.793,256.991-1089.787,257.66-1089.787Z" transform="translate(-244.831 1109.248)"/>\
                  </g>\
                </g>\
              </svg>'+
          '</div>' +
        '<div class="text_color">纯文本</div>' +
      '</div>' +
    '</div>' +
    // 重置
    '<div class="fun_button_list width_c double_btn">' +
      '<div class="button_list toolbar-item-audio" onclick="resetNavToolbar();" audio="reset" data-mtpis="重置, 请按ctrl + alt + C">'+
        '<div class="reset" >' +
          '<svg xmlns="http://www.w3.org/2000/svg" width="29.159" height="29.157" viewBox="0 0 29.159 29.157">\
            <g data-name="组 17" fill="currentColor">\
              <path data-name="路径 58" d="M1623.245-2736.4c.038.024.074.051.114.073a.862.862,0,0,1,.493.959.856.856,0,0,1-.87.676,12.932,12.932,0,0,0-3.454.483,12.656,12.656,0,0,0-7.16,5.169,12.835,12.835,0,0,0,.472,15.1c.034.045.071.087.134.163.049-.125.091-.222.126-.323.159-.456.306-.917.478-1.368a.846.846,0,0,1,1.069-.51.839.839,0,0,1,.541,1.052c-.346,1.042-.7,2.084-1.091,3.11a1,1,0,0,1-.529.506c-.991.377-2,.714-3,1.053a.842.842,0,0,1-1.121-.534.85.85,0,0,1,.578-1.079c.579-.208,1.161-.406,1.769-.617-.054-.08-.093-.149-.142-.21a14.377,14.377,0,0,1-3.164-8.022,2.147,2.147,0,0,0-.047-.245v-1.708a2.015,2.015,0,0,0,.047-.246,12.928,12.928,0,0,1,.807-3.8,14.383,14.383,0,0,1,11.214-9.462c.527-.105,1.067-.15,1.6-.222Z" transform="translate(-1608.436 2736.401)"/>\
              <path data-name="路径 59" d="M1859.9-2680.875c-.2.563-.386,1.1-.573,1.633a.824.824,0,0,1-.692.6.837.837,0,0,1-.94-1.077c.343-1.054.7-2.1,1.1-3.136a1,1,0,0,1,.54-.494c.982-.373,1.981-.706,2.976-1.044a.849.849,0,0,1,1.115.5.843.843,0,0,1-.538,1.1c-.592.219-1.191.422-1.773.627.414.608.851,1.183,1.221,1.8a14.323,14.323,0,0,1,1.944,9.644,14.526,14.526,0,0,1-11.93,12.249,21.74,21.74,0,0,1-2.377.217.85.85,0,0,1-.964-.85.87.87,0,0,1,.941-.852,12.647,12.647,0,0,0,9.354-4.136,12.393,12.393,0,0,0,3.323-7.121,12.641,12.641,0,0,0-2.57-9.465C1860.02-2680.743,1859.969-2680.8,1859.9-2680.875Z" transform="translate(-1835.286 2687.415)"/>\
              <path data-name="路径 60" d="M1782.112-2557.742a4.963,4.963,0,0,1-4.955-4.966,4.97,4.97,0,0,1,4.954-4.942,4.965,4.965,0,0,1,4.954,4.969A4.958,4.958,0,0,1,1782.112-2557.742Zm-.024-1.709a3.25,3.25,0,0,0,3.268-3.212,3.255,3.255,0,0,0-3.234-3.277,3.261,3.261,0,0,0-3.256,3.23A3.254,3.254,0,0,0,1782.087-2559.451Z" transform="translate(-1767.528 2577.28)"/>\
            </g>\
          </svg>'+
          '<div class="text_color">重置</div>' +
        '</div>' +
      '</div>' +
    '</div>' +
    // 固定btn
    '<div class="fun_button_list width_c double_btn">' +
      '<div class="button_list toolbar-item-audio toolbar-item-lockType" audio="bfrmode-toggle" id="fold" data-mtpis="固定或取消固定工具栏, 请按ctrl + alt +  L" >'+
          '<div class="help" >' +
            '<svg t="1685598747576" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2687" xmlns:xlink="http://www.w3.org/1999/xlink" width="200" height="200">\
              <path d="M958.9 895.8L732 668.9l-63 63 227 226.9 64 1.3zM792.3 379l-102.5-12.7-311-284.7c-25.2-24-65.7-23.4-90.1 1l-206 205.9c-24.6 24.6-25 65.1-1.1 90.2l284.8 311.1 12.7 102.5c0 74.7 55.1 104.7 108 51.7L844 487.1c53-53 23.1-108.1-51.7-108.1zM439.7 610.1c-4.2 4.2-9.7 6.4-15.6 6.4s-11.4-2.3-15.7-6.5l-254-254.3c-8.4-8.4-8.6-22.5-0.2-31l43.7-45c4.2-4.4 9.7-6.7 15.9-6.7 5.7 0 11.2 2.3 15.3 6.3 4.3 4 6.5 9.6 6.8 15.4 0.1 5.9-2.1 11.5-6.3 15.8l-28.5 29.3 238.6 239c8.6 8.6 8.5 22.6 0 31.3z" p-id="2688" fill="currentColor"></path>' +
            '</svg>'+
            '<div class="text_color">固定</div>' +
          '</div>' +
      '</div>' +
    '</div>' +
    // 说明btn
    '<div class="fun_button_list width_c double_btn">' +
      '<div class="button_list toolbar-item-audio " audio="help" onclick="navToolbarHelp();" data-mtpis="进入帮助, 请按ctrl + alt + ？">'+
          '<div class="help" >' +
            '<svg xmlns="http://www.w3.org/2000/svg" width="28.167" height="28.172" viewBox="0 0 28.167 28.172">\
              <g id="组_68" data-name="组 68" transform="translate(0 0)">\
                <path id="联合_5" data-name="联合 5" d="M13.065,28.172c-.632-.1-1.271-.167-1.9-.3a14.139,14.139,0,1,1,5.923-.041c-.7.152-1.42.23-2.131.342ZM2.159,14.024A11.921,11.921,0,1,0,14.1,2.175h-.039A11.924,11.924,0,0,0,2.159,14.024Zm10.477,5.963a1.044,1.044,0,0,1,1.076-1.057,1.056,1.056,0,0,1,1.082,1.058,1.068,1.068,0,0,1-1.064,1.078h-.014A1.061,1.061,0,0,1,12.636,19.987Zm1.03-2.172A1.088,1.088,0,0,1,12.631,16.7,4.231,4.231,0,0,1,14.07,13.36c.378-.372.769-.73,1.149-1.1a1.585,1.585,0,0,0,.6-1.772,1.9,1.9,0,0,0-1.7-1.209,2.052,2.052,0,0,0-2.493,1.588,1.086,1.086,0,1,1-2.075-.64,4.26,4.26,0,0,1,4.5-3.144A4.061,4.061,0,0,1,17.76,9.531a3.415,3.415,0,0,1-.593,3.791,16.413,16.413,0,0,1-1.41,1.412,2.555,2.555,0,0,0-.977,2.024,1.019,1.019,0,0,1-1.074,1.057Z" transform="translate(0 0)" fill="currentColor"/>\
              </g>\
            </svg>'+
            '<div class="text_color">说明</div>' +
          '</div>' +
      '</div>' +
    '</div>' +
    // 退出服务
    '<div class="fun_button_list width_c double_btn">' +
      '<div class="toolbar-item-audio allkeep_red" onclick="toggleToolBar();" data-mtpis="退出服务, 请按alt + shift + J" audio="login-out">'+
        '<div class="bfr_close " >' +
          '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 27.797 27.992" width="27.797" height="27.992">\
            <g data-name="组 21">\
              <path data-name="联合 6" d="M.535,17.236a26.156,26.156,0,0,1-.487-2.857c-.022-.131-.032-.261-.048-.393v-.628c.053-.546.084-1.1.163-1.639A13.4,13.4,0,0,1,7.969,1.37a1.22,1.22,0,0,1,1.48.281,1.143,1.143,0,0,1,.108,1.425,1.862,1.862,0,0,1-.673.54A11.7,11.7,0,0,0,6,5.538,10.51,10.51,0,0,0,2.636,11.7,10.612,10.612,0,0,0,6.453,22.042a10.377,10.377,0,0,0,8.739,2.35A10.628,10.628,0,0,0,23,18.857a10.292,10.292,0,0,0,1.255-6.6,10.765,10.765,0,0,0-6.242-8.579,1.56,1.56,0,0,1-.857-.747,1.215,1.215,0,0,1,.261-1.342,1.186,1.186,0,0,1,1.37-.233,17.233,17.233,0,0,1,1.733.922A12.846,12.846,0,0,1,26.186,9.7a13.009,13.009,0,0,1-2.951,12.968,12.773,12.773,0,0,1-7.952,4.191,13.6,13.6,0,0,1-1.905.135A13.333,13.333,0,0,1,.535,17.236ZM12.2,12.309c-.013-.142-.013-.285-.013-.427,0-3.452.011-6.9-.009-10.355A1.385,1.385,0,0,1,13.175,0h.456a1.386,1.386,0,0,1,.992,1.528c-.02,3.5-.008,7-.01,10.5a1.208,1.208,0,0,1-1.1,1.35,1.14,1.14,0,0,1-.131.008A1.2,1.2,0,0,1,12.2,12.309Z" transform="translate(.5 .5)" fill="currentColor"/>\
              <path data-name="联合 6 - 轮廓" d="M13.378,27.492A13.833,13.833,0,0,1,.053,17.371a14.873,14.873,0,0,1-.373-2.036c-.039-.289-.079-.587-.126-.875-.017-.1-.027-.2-.037-.289,0-.041-.009-.082-.014-.124l0-.03,0-.706c.016-.169.031-.344.045-.512.032-.376.064-.764.12-1.15A13.9,13.9,0,0,1,7.764.914,1.915,1.915,0,0,1,8.553.738a1.665,1.665,0,0,1,1.273.586A1.641,1.641,0,0,1,9.96,3.373a2.34,2.34,0,0,1-.856.693A11.179,11.179,0,0,0,6.343,5.9a10.038,10.038,0,0,0-3.213,5.872A10.119,10.119,0,0,0,6.775,21.66a9.772,9.772,0,0,0,6.439,2.4,11.417,11.417,0,0,0,1.895-.163,10.148,10.148,0,0,0,7.454-5.287,9.79,9.79,0,0,0,1.2-6.289,10.7,10.7,0,0,0-1.9-4.885,10.967,10.967,0,0,0-4.071-3.316,2.024,2.024,0,0,1-1.1-1,1.711,1.711,0,0,1,.368-1.892A1.685,1.685,0,0,1,19,.9l.07.034a16.979,16.979,0,0,1,1.713.916A13.332,13.332,0,0,1,26.666,9.56a14.224,14.224,0,0,1,.314,7.136A14.143,14.143,0,0,1,23.607,23a13.256,13.256,0,0,1-8.255,4.353A14.156,14.156,0,0,1,13.378,27.492ZM.5,13.956c0,.036.008.072.012.108.009.082.017.159.029.231.05.3.091.61.131.905a13.912,13.912,0,0,0,.345,1.9,12.833,12.833,0,0,0,12.361,9.391,13.153,13.153,0,0,0,1.835-.13,12.282,12.282,0,0,0,7.649-4.03,12.529,12.529,0,0,0,2.843-12.5A12.359,12.359,0,0,0,20.25,2.7a16.229,16.229,0,0,0-1.613-.86l-.07-.034a.685.685,0,0,0-.8.137.716.716,0,0,0-.153.793c.094.222.306.34.619.495a11.27,11.27,0,0,1,6.515,8.957A10.768,10.768,0,0,1,23.435,19.1a11.106,11.106,0,0,1-8.16,5.784,12.419,12.419,0,0,1-2.061.177,10.747,10.747,0,0,1-7.083-2.638,11.546,11.546,0,0,1-3.5-4.84,11.781,11.781,0,0,1-.487-5.965A11.015,11.015,0,0,1,5.662,5.171a12.159,12.159,0,0,1,3-2,1.367,1.367,0,0,0,.488-.385.648.648,0,0,0-.082-.8.669.669,0,0,0-.517-.24.924.924,0,0,0-.379.088A12.9,12.9,0,0,0,.657,11.792c-.052.356-.082.712-.113,1.09-.014.164-.028.333-.044.5Zm12.884-.074a1.7,1.7,0,0,1-1.678-1.528c-.015-.165-.015-.321-.015-.473q0-1.5,0-2.993c0-2.412,0-4.906-.01-7.359A1.879,1.879,0,0,1,13.021-.476L13.1-.5h.614l.076.025a1.882,1.882,0,0,1,1.337,2.006c-.014,2.438-.012,4.918-.011,7.317q0,1.589,0,3.178a1.707,1.707,0,0,1-1.541,1.847A1.643,1.643,0,0,1,13.384,13.882ZM13.259.5c-.36.134-.58.368-.576,1.024.014,2.456.012,4.951.01,7.365q0,1.5,0,2.992c0,.135,0,.263.011.382a.7.7,0,0,0,.682.619.642.642,0,0,0,.074,0c.163-.019.655-.075.655-.853q0-1.589,0-3.177c0-2.4,0-4.881.011-7.323,0-.655-.216-.89-.576-1.025Z" transform="translate(.5 .5)" fill="transparent"/>\
            </g>\
          </svg>'+
        '<div class="text_color">退出服务</div>' +
        '</div>' +
      '</div>' +
    '</div>' +
    '</div>' +
    '<div class="accessiblereading-toolbar toolbar-toggle">' +
    '<div class="toolbar-toggle-left">' +
    '<div class="page-type ymlx">' +
    '<div class="page-type-title">页面类型</div>' +
    '<div class="page-type-value" id="type_page"></div>' +
    '</div>' +
    '<div class="mark_bl nav-area w_h" onclick=changeArea(BarrierFreeConfig.navigationArea)>' +
    '<div class="mark_bl area-title nav-area-title">导航区<span id="dhq" class="bfr_ergodic_span"></span></div>' +
    '<div class="mark_bl nav-area-value">Alt+1</div>' +
    ' </div>' +
    '<div class="mark_bl window-area w_h" onclick=changeArea(BarrierFreeConfig.viewArea)>' +
    '<div class="mark_bl area-title window-area-title" >视窗区<span id="scq" class="bfr_ergodic_span"></span></div>' +
    '<div class="mark_bl window-area-value">Alt+2</div>' +
    '</div>' +
    '<div class="mark_bl service-area w_h" onclick=changeArea(BarrierFreeConfig.serveArea)>' +
    '<div class="mark_bl area-title service-area-title" >服务区<span id="fwq" class="bfr_ergodic_span"></span></div>' +
    '<div class="mark_bl service-area-value">Alt+3</div>' +
    '</div>' +
    '<div class="mark_bl article-area w_h" onclick=changeArea(BarrierFreeConfig.articleArea)>' +
    '<div class="mark_bl area-title article-area-title" >正文区<span id="zwq" class="bfr_ergodic_span"></span></div>' +
    '<div class="mark_bl article-area-value">Alt+4</div>' +
    '</div>' +
    '</div>' +
    '<div class="toolbar-toggle-right">' +
  // 读屏专用
    '<div class="accessiblereading-toolbar-item toolbar-item-back toolbar-item-audio dpzy_bg" audio="bfr-Intelligent-mode" onclick="readToolBar()" data-mtpis="当前为智能导盲模式, 进入老人模式请按ctrl + alt + R">' +
      '<div class="toolbar-item-bg dpzy_icon">' +
      '<svg xmlns="http://www.w3.org/2000/svg" width="29.035" height="27.222" viewBox="0 0 29.035 27.222">\
        <g data-name="组 85" fill="currentColor">\
          <path data-name="路径 117" d="M1227.416-3167.752v19.282a5.433,5.433,0,0,1-.258.8,2.516,2.516,0,0,1-2.422,1.465q-4.195.006-8.389,0h-.367c.281.565.532,1.08.8,1.587a.3.3,0,0,0,.224.109c.349.013.7,0,1.048.012a.842.842,0,0,1,.782.667.849.849,0,0,1-.416.915l-.187.113h-10.661c-.037-.024-.073-.052-.112-.073a.858.858,0,0,1-.491-.955.861.861,0,0,1,.867-.673,1.7,1.7,0,0,1,.368,0,.879.879,0,0,0,1.126-.694,8.331,8.331,0,0,1,.487-1.011h-.391q-4.18,0-8.361,0a2.553,2.553,0,0,1-2.677-2.643q-.008-9.268.009-18.537a2.854,2.854,0,0,1,.258-1.173,2.491,2.491,0,0,1,2.447-1.464h15.276q4.166,0,8.332,0a2.474,2.474,0,0,1,2.2,1.06A6.625,6.625,0,0,1,1227.416-3167.752Zm-1.7,16.435v-.312q0-7.81,0-15.62c0-.765-.3-1.07-1.057-1.07H1201.13c-.74,0-1.047.309-1.047,1.051q0,7.824,0,15.648v.3Zm-25.629,1.722c0,.312-.012.594,0,.876.027.515.4.816.993.816h23.609c.076,0,.152,0,.227,0a.812.812,0,0,0,.769-.676,8.221,8.221,0,0,0,.009-1.012Zm14.832,5.086c-.28-.562-.535-1.084-.806-1.6-.03-.057-.154-.09-.234-.091-.5-.008-1,.037-1.5-.016a.794.794,0,0,0-.961.6,10.7,10.7,0,0,1-.538,1.1Z" transform="translate(-1198.38 3170.021)"/>\
          <path data-name="路径 118" d="M1241.131-3150.894a4.516,4.516,0,0,1,1.7-1.353,4.32,4.32,0,0,1,1.76-.369q1.63,0,3.26,0a.86.86,0,0,1,.953.945q0,5,0,10.006a.865.865,0,0,1-.969.957q-2.409,0-4.818,0a.878.878,0,0,0-1.02.912.857.857,0,0,1-.852.788.855.855,0,0,1-.843-.8.873.873,0,0,0-1-.9q-2.395,0-4.79,0c-.7,0-1.018-.32-1.018-1.023q0-4.932,0-9.864c0-.7.318-1.021,1.02-1.022,1.011,0,2.022.008,3.033,0a4.275,4.275,0,0,1,3.488,1.57A1.664,1.664,0,0,1,1241.131-3150.894Zm-.852,8.584a.206.206,0,0,0,.016-.055c0-2.013.026-4.026-.008-6.039a2.443,2.443,0,0,0-2.3-2.474c-.91-.081-1.831-.024-2.747-.027-.014,0-.027.023-.032.029v8.467c.355,0,.693-.007,1.032,0A35.164,35.164,0,0,1,1240.279-3142.31Zm6.819-8.6c-.807,0-1.59,0-2.372,0a4.314,4.314,0,0,0-.452.028,2.1,2.1,0,0,0-.361.064,2.539,2.539,0,0,0-1.912,2.563c-.005,1.909,0,3.819,0,5.728,0,.079.012.158.016.211,1.7-.193,3.394-.022,5.081-.108Z" transform="translate(-1226.631 3156.019)"/>\
        </g>\
      </svg>'+
      '</div>' +
      '<div class="toolbar-item-title" style="margin-left:10px;">读屏专用</div>' +
    '</div>' +
    // 声音开关
    '<div class="accessiblereading-toolbar-item toolbar-item-voice toolbar-item-audio change_voice_btn" onclick="readFunctionBtn()" id="read" audio="read-close"  data-mtpis="开启读屏, 请按ctrl + alt + V">' +
    '<div class="toolbar-item-bg">'+
      // 声音关着的icon
      '<div class="voice_btn_close">'+
        '<svg xmlns="http://www.w3.org/2000/svg" width="31.25" height="26.814" viewBox="0 0 31.25 26.814">\
          <g id="组_100" data-name="组 100" transform="translate(-300.675 -315.001)">\
            <path id="联合_2" data-name="联合 2" d="M0,9.43C.04,9.288.074,9.144.12,9A2.362,2.362,0,0,1,2.313,7.39c.506-.009,1.012-.01,1.518,0a.43.43,0,0,0,.39-.193Q6.863,3.8,9.513.406A.957.957,0,0,1,10.341,0c.794.011,1.589,0,2.383,0a.8.8,0,0,1,.893.886c0,2.138.005,4.276-.006,6.414,0,.233.06.337.284.4.427.122.846.27,1.265.418a2.333,2.333,0,0,1,1.6,2.23q.009,3.05,0,6.1A2.337,2.337,0,0,1,15.147,18.7c-.411.145-.82.3-1.24.409-.249.065-.3.186-.294.42.009,2.077,0,4.154.012,6.23a1.006,1.006,0,0,1-.583,1.055H10a5.039,5.039,0,0,1-.6-.557q-2.61-3.321-5.2-6.66a.384.384,0,0,0-.348-.17c-.514.009-1.03.01-1.544,0A2.361,2.361,0,0,1,.12,17.813c-.046-.14-.08-.283-.12-.425ZM12.036,1.575c-.429,0-.83.008-1.231,0a.382.382,0,0,0-.346.175q-2.547,3.275-5.1,6.546a.576.576,0,0,0-.118.327q-.01,4.792,0,9.582a.5.5,0,0,0,.088.286Q7.907,21.8,10.5,25.113a.3.3,0,0,0,.18.124c.45.01.9.006,1.36.006ZM3.648,17.858V8.976a.416.416,0,0,0-.068-.015c-.375,0-.75,0-1.125,0a.8.8,0,0,0-.883.9q0,1.936,0,3.871c0,1.1,0,2.2,0,3.3a.776.776,0,0,0,.73.832C2.745,17.873,3.189,17.858,3.648,17.858Zm9.98-.3c.387-.134.763-.243,1.122-.394a.708.708,0,0,0,.436-.691q.006-3.062,0-6.124a.707.707,0,0,0-.436-.69c-.359-.151-.735-.26-1.122-.393Z" transform="translate(300.675 315)" fill="currentColor"/>\
            <path id="路径_145" data-name="路径 145" d="M2959.61-1932.639c1.063,0,2.076,0,3.089,0a1.912,1.912,0,0,0,.462-.036,1.084,1.084,0,0,0,.8-1.128,1.091,1.091,0,0,0-1.094-.983c-.943-.011-1.887,0-2.83,0h-.431v-1.521c0-.561,0-1.123,0-1.684a1.081,1.081,0,0,0-1.075-1.141,1.086,1.086,0,0,0-1.074,1.147c-.007,1.049,0,2.1,0,3.2h-.4c-.907,0-1.815,0-2.723,0a1.1,1.1,0,0,0-1.225,1.069,1.092,1.092,0,0,0,1.207,1.081c1.026,0,2.052,0,3.122,0,.006.139.016.264.016.39,0,.908,0,1.815,0,2.723a1.116,1.116,0,0,0,1.088,1.246,1.1,1.1,0,0,0,1.063-1.229C2959.611-1930.535,2959.61-1931.56,2959.61-1932.639Z" transform="translate(-3135.095 -395.789) rotate(45)" fill="currentColor"/>\
          </g>\
        </svg>'+
      '</div>' +
       // 声音开着的icon
       '<div class="voice_btn_open">'+
          '<svg xmlns="http://www.w3.org/2000/svg" width="26.827" height="26.814" viewBox="0 0 26.827 26.814">\
            <path id="联合_2" data-name="联合 2" d="M10,26.815a5.056,5.056,0,0,1-.6-.557Q6.792,22.937,4.2,19.6a.385.385,0,0,0-.347-.17q-.772.014-1.544,0A2.361,2.361,0,0,1,.12,17.813c-.046-.14-.08-.283-.12-.424V9.43C.04,9.288.074,9.144.12,9A2.362,2.362,0,0,1,2.313,7.39c.506-.009,1.013-.01,1.518,0a.43.43,0,0,0,.39-.193Q6.863,3.8,9.513.406A.954.954,0,0,1,10.34,0c.514.006,1.028.005,1.542,0h.841a.8.8,0,0,1,.893.886c0,2.137.005,4.276-.005,6.413,0,.233.059.338.284.4.427.121.846.27,1.265.418a2.333,2.333,0,0,1,1.6,2.23q.009,3.05,0,6.1A2.336,2.336,0,0,1,15.146,18.7c-.41.145-.82.3-1.24.409-.248.066-.3.185-.294.42.009,2.077,0,4.154.013,6.231a1.008,1.008,0,0,1-.583,1.056Zm.455-25.069Q7.912,5.02,5.361,8.292a.572.572,0,0,0-.118.328q-.009,4.791,0,9.581a.5.5,0,0,0,.088.286Q7.908,21.8,10.5,25.113a.3.3,0,0,0,.18.124c.451.01.9.005,1.36.005V1.575c-.429,0-.83.007-1.231,0h-.017A.378.378,0,0,0,10.459,1.746Zm-8,7.213a.8.8,0,0,0-.883.9q0,1.936,0,3.871c0,1.1,0,2.2,0,3.3a.776.776,0,0,0,.73.832c.443.02.886,0,1.346,0V8.976a.418.418,0,0,0-.068-.015l-.855,0Zm11.174,8.6c.387-.134.763-.243,1.121-.394a.708.708,0,0,0,.436-.69q.005-3.062,0-6.125a.708.708,0,0,0-.436-.69c-.358-.151-.735-.259-1.121-.393Zm9.56,1.973a.791.791,0,0,1,.05-1.183,6.942,6.942,0,0,0,2-5.093,6.874,6.874,0,0,0-1.948-4.72.9.9,0,0,1-.328-.81A.751.751,0,0,1,23.5,7.11a.763.763,0,0,1,.812.22,8.187,8.187,0,0,1,2.171,3.758c.193.755.274,1.538.341,1.936a8.936,8.936,0,0,1-2.458,6.41.926.926,0,0,1-.659.313A.748.748,0,0,1,23.188,19.528Zm-2.219-2.22a.808.808,0,0,1,.046-1.185A3.917,3.917,0,0,0,21,10.68a.807.807,0,0,1-.215-.884.731.731,0,0,1,.65-.495.8.8,0,0,1,.7.287,5.485,5.485,0,0,1,.038,7.6.951.951,0,0,1-.682.339A.741.741,0,0,1,20.969,17.308ZM18.757,15.1a.759.759,0,0,1-.071-1.08.793.793,0,0,0,.008-1.208.783.783,0,0,1,1.169-1.04,2.342,2.342,0,0,1,0,3.281.809.809,0,0,1-.581.252A.78.78,0,0,1,18.757,15.1Z" transform="translate(0 -0.001)" fill="currentColor"/>\
          </svg>'+
       '</div>' +
    '</div>' +
    '<div class="toolbar-item-title">声音开关</div>' +
    '</div>' +
    // 辅屏
    '<div class="accessiblereading-toolbar-item toolbar-item-auxiliaryScreen toolbar-item-audio help_screen" onclick="toolbar.Function.textTips.mainMethod();" id="screen" audio="helpscreen-open" data-mtpis="开启辅屏, 请按 ctrl + alt + B">' +
    '<div class="toolbar-item-bg">'+
      // 辅屏关着的icon
      '<div class="auxiliary_btn_n">'+
          '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32.498 29.391" width="32.498" height="29.391">\
          <g data-name="组 82" fill="currentColor">\
            <path data-name="路径 127" d="M1346.751-2991.417v-10.856c.016-.049.037-.1.049-.146a2.136,2.136,0,0,1,1.107-1.456,5.75,5.75,0,0,1,.716-.269h16.7a.193.193,0,0,0,.055.035,2.18,2.18,0,0,1,1.815,2.26q0,5,0,10.009a2.686,2.686,0,0,1-.068.631,2.176,2.176,0,0,1-2.2,1.661q-5.6,0-11.2,0c-1.589,0-3.178,0-4.767,0a2.19,2.19,0,0,1-2.1-1.5C1346.821-2991.172,1346.787-2991.295,1346.751-2991.417Zm10.227.411h7.894a.753.753,0,0,0,.862-.867q0-4.972,0-9.944a.754.754,0,0,0-.862-.867h-15.788c-.607,0-.873.268-.873.877v9.921c0,.606.271.879.873.879Z" transform="translate(-1346.751 3013.42)"/>\
            <path data-name="路径 128" d="M1348.751-2814.744c.113-.5.314-.666.6-.666,3.941.011,3.883.007,7.824.007.362,0,.577.328.577.877s-.215.878-.576.878c-3.942,0-3.883,0-7.824.007-.285,0-.485-.167-.6-.666Z" transform="translate(-1342.751 2843.032)"/>\
            <path data-name="减去 1" d="M-218-417.448h0V-419.2h5.2a.906.906,0,0,0,1.037-1.042c0-3.984,0-10.973,0-14.956a.906.906,0,0,0-1.036-1.042h-18.984c-.725,0-1.049.325-1.05,1.055v3.546h-1.755v-4.108l.018-.052a1.126,1.126,0,0,0,.04-.124,2.566,2.566,0,0,1,1.33-1.75,3.793,3.793,0,0,1,.586-.23c.09-.03.184-.061.274-.094h20.083l.017.013a.131.131,0,0,0,.049.029A2.619,2.619,0,0,1-210-435.24c0,6.874,0,12.073,0,15.035a3.215,3.215,0,0,1-.083.759,2.62,2.62,0,0,1-2.646,2Z" transform="translate(242 438.501)" stroke="transparent" stroke-miterlimit="10"/>\
            <path data-name="路径 128" d="M1346.751-2814.744c.106-.5.3-.666.566-.666,3.726.011,2.452.007,6.178.007.342,0,.546.328.546.877s-.2.878-.545.878c-3.726,0-2.452,0-6.178.007-.27,0-.459-.167-.566-.666Z" transform="translate(-1327.042 2841.032)"/>\
          </g>\
        </svg>'+
      '</div>' +
       // 辅屏开着的icon
       '<div class="auxiliary_btn_y">'+
          '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32.498 29.391" width="32.498" height="29.391">\
            <g data-name="组 82" fill="currentColor">\
              <path data-name="路径 127" d="M1346.751-2991.417v-10.856c.016-.049.037-.1.049-.146a2.136,2.136,0,0,1,1.107-1.456,5.75,5.75,0,0,1,.716-.269h16.7a.193.193,0,0,0,.055.035,2.18,2.18,0,0,1,1.815,2.26q0,5,0,10.009a2.686,2.686,0,0,1-.068.631,2.176,2.176,0,0,1-2.2,1.661q-5.6,0-11.2,0c-1.589,0-3.178,0-4.767,0a2.19,2.19,0,0,1-2.1-1.5C1346.821-2991.172,1346.787-2991.295,1346.751-2991.417Zm10.227.411h7.894a.753.753,0,0,0,.862-.867q0-4.972,0-9.944a.754.754,0,0,0-.862-.867h-15.788c-.607,0-.873.268-.873.877v9.921c0,.606.271.879.873.879Z" transform="translate(-1346.751 3013.42)"/>\
              <path data-name="路径 128" d="M1348.751-2814.744c.113-.5.314-.666.6-.666,3.941.011,3.883.007,7.824.007.362,0,.577.328.577.877s-.215.878-.576.878c-3.942,0-3.883,0-7.824.007-.285,0-.485-.167-.6-.666Z" transform="translate(-1342.751 2843.032)"/>\
              <path data-name="减去 1" d="M-218-417.448h0V-419.2h5.2a.906.906,0,0,0,1.037-1.042c0-3.984,0-10.973,0-14.956a.906.906,0,0,0-1.036-1.042h-18.984c-.725,0-1.049.325-1.05,1.055v3.546h-1.755v-4.108l.018-.052a1.126,1.126,0,0,0,.04-.124,2.566,2.566,0,0,1,1.33-1.75,3.793,3.793,0,0,1,.586-.23c.09-.03.184-.061.274-.094h20.083l.017.013a.131.131,0,0,0,.049.029A2.619,2.619,0,0,1-210-435.24c0,6.874,0,12.073,0,15.035a3.215,3.215,0,0,1-.083.759,2.62,2.62,0,0,1-2.646,2Z" transform="translate(242 438.501)" stroke="transparent" stroke-miterlimit="10"/>\
              <path data-name="路径 128" d="M1346.751-2814.744c.106-.5.3-.666.566-.666,3.726.011,2.452.007,6.178.007.342,0,.546.328.546.877s-.2.878-.545.878c-3.726,0-2.452,0-6.178.007-.27,0-.459-.167-.566-.666Z" transform="translate(-1327.042 2841.032)"/>\
            </g>\
          </svg>'+
       '</div>' +
    '</div>' +
    '<div class="toolbar-item-title">辅屏</div>' +
    '</div>' +
    //说明
    '<div class="accessiblereading-toolbar-item toolbar-item-help toolbar-item-audio " onclick="navToolbarHelp()" audio="help" data-mtpis="进入帮助, 请按ctrl + alt + ？" >' +
    '<div class="toolbar-item-bg">'+
      '<svg xmlns="http://www.w3.org/2000/svg" width="28.167" height="28.172" viewBox="0 0 28.167 28.172">\
        <g id="组_68" data-name="组 68" transform="translate(0 0)">\
          <path id="联合_5" data-name="联合 5" d="M13.065,28.172c-.632-.1-1.271-.167-1.9-.3a14.139,14.139,0,1,1,5.923-.041c-.7.152-1.42.23-2.131.342ZM2.159,14.024A11.921,11.921,0,1,0,14.1,2.175h-.039A11.924,11.924,0,0,0,2.159,14.024Zm10.477,5.963a1.044,1.044,0,0,1,1.076-1.057,1.056,1.056,0,0,1,1.082,1.058,1.068,1.068,0,0,1-1.064,1.078h-.014A1.061,1.061,0,0,1,12.636,19.987Zm1.03-2.172A1.088,1.088,0,0,1,12.631,16.7,4.231,4.231,0,0,1,14.07,13.36c.378-.372.769-.73,1.149-1.1a1.585,1.585,0,0,0,.6-1.772,1.9,1.9,0,0,0-1.7-1.209,2.052,2.052,0,0,0-2.493,1.588,1.086,1.086,0,1,1-2.075-.64,4.26,4.26,0,0,1,4.5-3.144A4.061,4.061,0,0,1,17.76,9.531a3.415,3.415,0,0,1-.593,3.791,16.413,16.413,0,0,1-1.41,1.412,2.555,2.555,0,0,0-.977,2.024,1.019,1.019,0,0,1-1.074,1.057Z" transform="translate(0 0)" fill="currentColor"/>\
        </g>\
      </svg>'+
    '</div>' +
    '<div class="toolbar-item-title">说明</div>' +
    '</div>' +
    // 退出服务开关
    '<div class="accessiblereading-toolbar-item toolbar-item-switch toolbar-item-audio" onclick="toggleToolBar()" data-mtpis="退出服务, 请按alt + shift + J" audio="login-out" >' +
      '<div class="toolbar-item-bg">' +
        '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 27.797 27.992" width="27.797" height="27.992">\
          <g data-name="组 21">\
            <path data-name="联合 6" d="M.535,17.236a26.156,26.156,0,0,1-.487-2.857c-.022-.131-.032-.261-.048-.393v-.628c.053-.546.084-1.1.163-1.639A13.4,13.4,0,0,1,7.969,1.37a1.22,1.22,0,0,1,1.48.281,1.143,1.143,0,0,1,.108,1.425,1.862,1.862,0,0,1-.673.54A11.7,11.7,0,0,0,6,5.538,10.51,10.51,0,0,0,2.636,11.7,10.612,10.612,0,0,0,6.453,22.042a10.377,10.377,0,0,0,8.739,2.35A10.628,10.628,0,0,0,23,18.857a10.292,10.292,0,0,0,1.255-6.6,10.765,10.765,0,0,0-6.242-8.579,1.56,1.56,0,0,1-.857-.747,1.215,1.215,0,0,1,.261-1.342,1.186,1.186,0,0,1,1.37-.233,17.233,17.233,0,0,1,1.733.922A12.846,12.846,0,0,1,26.186,9.7a13.009,13.009,0,0,1-2.951,12.968,12.773,12.773,0,0,1-7.952,4.191,13.6,13.6,0,0,1-1.905.135A13.333,13.333,0,0,1,.535,17.236ZM12.2,12.309c-.013-.142-.013-.285-.013-.427,0-3.452.011-6.9-.009-10.355A1.385,1.385,0,0,1,13.175,0h.456a1.386,1.386,0,0,1,.992,1.528c-.02,3.5-.008,7-.01,10.5a1.208,1.208,0,0,1-1.1,1.35,1.14,1.14,0,0,1-.131.008A1.2,1.2,0,0,1,12.2,12.309Z" transform="translate(.5 .5)" fill="currentColor"/>\
            <path data-name="联合 6 - 轮廓" d="M13.378,27.492A13.833,13.833,0,0,1,.053,17.371a14.873,14.873,0,0,1-.373-2.036c-.039-.289-.079-.587-.126-.875-.017-.1-.027-.2-.037-.289,0-.041-.009-.082-.014-.124l0-.03,0-.706c.016-.169.031-.344.045-.512.032-.376.064-.764.12-1.15A13.9,13.9,0,0,1,7.764.914,1.915,1.915,0,0,1,8.553.738a1.665,1.665,0,0,1,1.273.586A1.641,1.641,0,0,1,9.96,3.373a2.34,2.34,0,0,1-.856.693A11.179,11.179,0,0,0,6.343,5.9a10.038,10.038,0,0,0-3.213,5.872A10.119,10.119,0,0,0,6.775,21.66a9.772,9.772,0,0,0,6.439,2.4,11.417,11.417,0,0,0,1.895-.163,10.148,10.148,0,0,0,7.454-5.287,9.79,9.79,0,0,0,1.2-6.289,10.7,10.7,0,0,0-1.9-4.885,10.967,10.967,0,0,0-4.071-3.316,2.024,2.024,0,0,1-1.1-1,1.711,1.711,0,0,1,.368-1.892A1.685,1.685,0,0,1,19,.9l.07.034a16.979,16.979,0,0,1,1.713.916A13.332,13.332,0,0,1,26.666,9.56a14.224,14.224,0,0,1,.314,7.136A14.143,14.143,0,0,1,23.607,23a13.256,13.256,0,0,1-8.255,4.353A14.156,14.156,0,0,1,13.378,27.492ZM.5,13.956c0,.036.008.072.012.108.009.082.017.159.029.231.05.3.091.61.131.905a13.912,13.912,0,0,0,.345,1.9,12.833,12.833,0,0,0,12.361,9.391,13.153,13.153,0,0,0,1.835-.13,12.282,12.282,0,0,0,7.649-4.03,12.529,12.529,0,0,0,2.843-12.5A12.359,12.359,0,0,0,20.25,2.7a16.229,16.229,0,0,0-1.613-.86l-.07-.034a.685.685,0,0,0-.8.137.716.716,0,0,0-.153.793c.094.222.306.34.619.495a11.27,11.27,0,0,1,6.515,8.957A10.768,10.768,0,0,1,23.435,19.1a11.106,11.106,0,0,1-8.16,5.784,12.419,12.419,0,0,1-2.061.177,10.747,10.747,0,0,1-7.083-2.638,11.546,11.546,0,0,1-3.5-4.84,11.781,11.781,0,0,1-.487-5.965A11.015,11.015,0,0,1,5.662,5.171a12.159,12.159,0,0,1,3-2,1.367,1.367,0,0,0,.488-.385.648.648,0,0,0-.082-.8.669.669,0,0,0-.517-.24.924.924,0,0,0-.379.088A12.9,12.9,0,0,0,.657,11.792c-.052.356-.082.712-.113,1.09-.014.164-.028.333-.044.5Zm12.884-.074a1.7,1.7,0,0,1-1.678-1.528c-.015-.165-.015-.321-.015-.473q0-1.5,0-2.993c0-2.412,0-4.906-.01-7.359A1.879,1.879,0,0,1,13.021-.476L13.1-.5h.614l.076.025a1.882,1.882,0,0,1,1.337,2.006c-.014,2.438-.012,4.918-.011,7.317q0,1.589,0,3.178a1.707,1.707,0,0,1-1.541,1.847A1.643,1.643,0,0,1,13.384,13.882ZM13.259.5c-.36.134-.58.368-.576,1.024.014,2.456.012,4.951.01,7.365q0,1.5,0,2.992c0,.135,0,.263.011.382a.7.7,0,0,0,.682.619.642.642,0,0,0,.074,0c.163-.019.655-.075.655-.853q0-1.589,0-3.177c0-2.4,0-4.881.011-7.323,0-.655-.216-.89-.576-1.025Z" transform="translate(.5 .5)" fill="transparent"/>\
          </g>\
        </svg>'+
      '</div>' +
    '<div class="toolbar-item-title">退出服务</div>' +
    '</div>' +
    // end
    '</div>' +
    '</div>' +
    '</div>';
    //截止以上是横向工具条
  // nodeToString(divDom)
  return textHTML;
}
//--------------------dom 转字符串------------------------//
function nodeToString(node) {
  //createElement()返回一个Element对象
  var tmpNode = document.createElement("div");
  //appendChild()  参数Node对象   返回Node对象  Element方法
  //cloneNode()  参数布尔类型  返回Node对象   Element方法
  tmpNode.appendChild(node.cloneNode(true));
  var str = tmpNode.innerHTML;
  tmpNode = node = null; // prevent memory leaks in IE
  return str;
};
//---------------------------智能导盲工具条开始------------------------//
var onClickTool = false;

function ergodicToolbar() {
  toggleOldManModal = true
  INSTANCE.blindFlag = "1";
  SetCookie("blindFlag", "1");
  $(".toolbar-normal").hide();
  $(".toolbar-toggle").show();
  var page = $('#page_type').attr("alt");
  if (page == '' || page == undefined) {
    $('.ymlx').css('display', 'none');
  }
  document.getElementById('type_page').innerHTML = page;
  var navigationAreaNum = 0;
  var viewAreaNum = 0;
  var serveAreaNum = 0;
  var articleAreaNum = 0;
  var keyHelp = "按键说明：";
  $("[ergodic]").each(function () {
    var value = $(this).attr("ergodic");
    if (value == BarrierFreeConfig.navigationArea) {
      navigationAreaNum += 1;
    } else if (value == BarrierFreeConfig.viewArea) {
      viewAreaNum += 1;
    } else if (value == BarrierFreeConfig.serveArea) {
      serveAreaNum += 1;
    } else if (value == BarrierFreeConfig.articleArea) {
      articleAreaNum += 1;
    }
  });
  var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
  var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
  let iframes = $(hostString).not('[src^="//"]')

  iframes.each(function() {
    var iframe = $(this);
    if (iframe.attr('src')) {
      // 当前xx区
      var ergodicValue = iframe.contents().find('[ergodic]').attr('ergodic');
      if (ergodicValue == BarrierFreeConfig.navigationArea) {
        navigationAreaNum += 1;
      } else if (ergodicValue == BarrierFreeConfig.viewArea) {
        viewAreaNum += 1;
      } else if (ergodicValue == BarrierFreeConfig.serveArea) {
        serveAreaNum += 1;
      } else if (ergodicValue == BarrierFreeConfig.articleArea) {
        articleAreaNum += 1;
      }
    }
  });
  iframes.on('load', function() {
    var iframe = $(this)//定位到当前iframe
    if (iframe.attr('src')) {
      // 当前xx区
      var ergodicValue = iframe.contents().find('[ergodic]').attr('ergodic');
      if (ergodicValue == BarrierFreeConfig.navigationArea) {
        navigationAreaNum += 1;
        document.getElementById('dhq').innerHTML = "(" + navigationAreaNum + ")";
      } else if (ergodicValue == BarrierFreeConfig.viewArea) {
        viewAreaNum += 1;
        document.getElementById('dhq').innerHTML = "(" + viewAreaNum + ")";
      } else if (ergodicValue == BarrierFreeConfig.serveArea) {
        serveAreaNum += 1;
        document.getElementById('dhq').innerHTML = "(" + serveAreaNum + ")";
      } else if (ergodicValue == BarrierFreeConfig.articleArea) {
        articleAreaNum += 1;
        document.getElementById('dhq').innerHTML = "(" + articleAreaNum + ")";
      }
    }
  });

  if (navigationAreaNum > 0) {
    $('.dhq').css('display', 'block');
    document.getElementById('dhq').innerHTML = "(" + navigationAreaNum + ")";
    keyHelp += "切换导航区：alt加1；";
  } else {
    $('.nav-area').css('display', 'none');
  }
  if (viewAreaNum > 0) {
    $('.scq').css('display', 'block');
    document.getElementById('scq').innerHTML = "(" + viewAreaNum + ")";
    keyHelp += "切换视窗区：alt加2；";
  } else {
    $('.window-area').css('display', 'none');
  }
  if (serveAreaNum > 0) {
    $('.fwq').css('display', 'block');
    document.getElementById('fwq').innerHTML = "(" + serveAreaNum + ")";
    keyHelp += "切换服务区：alt加3；";
  } else {
    $('.service-area').css('display', 'none');
  }
  if (articleAreaNum > 0) {
    $('.zwq').css('display', 'block');
    document.getElementById('zwq').innerHTML = "(" + articleAreaNum + ")";
    keyHelp += "定位正文区：alt加4；";
  } else {
    $('.article-area').css('display', 'none');
  }
  if (articleAreaNum === 0 && navigationAreaNum === 0 && viewAreaNum === 0 && serveAreaNum === 0) {
    $('.page-type').css('display', 'none');
  }
  keyHelp += "浏览信息：tab键；打开当前链接：回车键；";
  onClickTool = true;
  // 语音播报
  var totalNum = navigationAreaNum + viewAreaNum + serveAreaNum + articleAreaNum;
  var pageTitle = $('title').text();
  var str = $("#page_type").attr("alt") ? ('您已进入' + pageTitle + $("#page_type").attr("alt") + '。本页面是由' + (navigationAreaNum > 0 ? navigationAreaNum + '个导航区' : '') + ',' + (viewAreaNum > 0 ? viewAreaNum + '个视窗区' : '') + ',' + (serveAreaNum > 0 ? serveAreaNum + '个服务区' : '') + ',' + (articleAreaNum > 0 ? articleAreaNum + '个正文区' : '') + ',共计' + totalNum + '个区域组成。') : "";

  str += keyHelp;

  setTimeout(function () {
    if (BarrierFreeConfig.reader.isLoaded()) {
      BarrierFreeConfig.reader.stop();
      readContent(str);
    }
  }, 150);
}
//---------------------------智能导盲工具条结束------------------------//

//-------------------------遍历区块的事件开始-------------------------//
var ergodic_current_Val_total_num = 0 //一共多少个
var iframe_current_ergodic_val_toalNum = 0 // 所有iframe中的某个区一共多少个
//定义当前各个区域所在的序号
var currdKey = 0;
//所有文本的顺序标记
var tabNum = 0;
//模块内文本的顺序标记
var tabNumInModal = 0;
//定义当前选中的区域内的元素序号
var innerQNum = 0;
var currdQid = ""; //记录当前qid所在的区域
var clickModal = false //是否手动点击了某个页面类型[模块]
function changeArea(QId) {
  // 进入xx区后 以前存取的 辅屏 内容 值 清空
  toolbar.Function.textTips.textMessage = '';
  clickModal = true
  if (!onClickTool) {
    return;
  }
  //如果切换区域的话则将currdKey直接设置为0
  if (currdQid != QId) {
    currdKey = 0;
    iframe_current_ergodic_val_toalNum = 0
    currdQid = QId;
  }
  tabNum = 0;
  tabNumInModal = 0
  innerQNum = 0;
  $('.bl').removeClass('bl');
  $(".tbl").removeClass('tbl');
  var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
  var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
  let iframes = $(hostString).not('[src^="//"]')
  iframes.contents().find('.bl').removeClass('bl')// 进入之前移除其他 红框
  let currentZone = $("[ergodic='" + QId + "']").eq(currdKey)
  let html_current_ergodic_val_toalNum =$("[ergodic='" + QId + "']").length//body中当前区 个数
  // 非iframe中 
  if($("[ergodic='" + QId + "']").eq(currdKey).length === 0){
    // iframe中 eq值 去掉 body中的值 从新计算
    currentZone = iframes.contents().find("[ergodic='" + QId + "']").eq(currdKey - html_current_ergodic_val_toalNum)
    currentZoneIframe_offset = $('#iframe0').offset().top//这个iframe距顶部高度 距离
  }
  currentZone.addClass("bl");
  // 点击进入某个模块 添加蓝色在读标记
  currentZone.children('.startCricleDot').addClass("tbl").focus().mouseenter();
  var container = $('#barrierfree_container'),scrollTo = currentZone;
  // scrollTo.offset().top是滚动条距顶部高度 距离 也是选中框距离顶部的高度
  // scrollTo.outerHeight(true)选中框自身的高度
  // 如果当前在iframe中
  if($("[ergodic='" + QId + "']").eq(currdKey).length === 0){
    // 在页面中改dom 在iframe中 需要滚动的距离 是当前元素距离iframe顶部的距离+iframe距离页面顶部的距离 
    let needSrollDistance = currentZone.offset().top + currentZoneIframe_offset 
    if(needSrollDistance > currentZone.outerHeight(true)){
      container.scrollTop(needSrollDistance - currentZone.outerHeight(true));
    }else{
      container.scrollTop(needSrollDistance);
    }
  }else{
    // 如果不在iframe中
    if(scrollTo.offset().top > scrollTo.outerHeight(true)){
      container.scrollTop(scrollTo.offset().top - scrollTo.outerHeight(true));
    }else{
      container.scrollTop(scrollTo.offset().top);
    // scrollTo.offset().top - container.offset().top + container.scrollTop()
    }
  }
  var valueArea = currentZone.attr('ergodic'); //navigation
  if (valueArea == BarrierFreeConfig.articleArea) {
    readArticle();
  }
  iframes.each(function() {
    var iframe = $(this);
    if (iframe.attr('src')) {
      // 统计总个数
      iframe_current_ergodic_val_toalNum = iframe.contents().find("[ergodic='" + QId + "']").length//iframe中当前区 个数
      if (iframe_current_ergodic_val_toalNum > 0) {
        iframe_current_ergodic_val_toalNum++;
      }
    }
  });
  // iframe中的当前区 个数+body中当前区 个数
  ergodic_current_Val_total_num = iframe_current_ergodic_val_toalNum + html_current_ergodic_val_toalNum
  if (currdKey >= ergodic_current_Val_total_num - 1) {
    currdKey = 0;
  } else {
    currdKey += 1;
  }
}
//-------------------------遍历区块的事件结束-------------------------//
// 点击 某ergodic区空白处 提示 在xx区
$("[ergodic]").bind('mouseenter',function (events) {
  if(INSTANCE.openFlag !=='0'){
    $('.bl').removeClass('bl')
   $(this).addClass('bl')
   const startCircleDot = this.querySelector('.startCricleDot');
   if(events.target.attributes.ergodic !==undefined ){
    // var dsc =$(this).attr('bfr_zone_dsc')||'您未对该区进行描述'
    // $(this),$(this).find('[bfr_zone_dsc]').text()
    // Get all descendant elements with the attribute 'bfr_zone_dsc'
    const bfrZoneElems = this.querySelectorAll('[bfr_zone_dsc]');
    // Loop through all the descendant elements and concatenate their text content
    let bfr_zone_text = '';
    if(bfrZoneElems.length){
      bfr_zone_text = '内容主要涉及';
       for (let item of bfrZoneElems) {
         bfr_zone_text += item.textContent.trim()+'、';
       }
       bfr_zone_text = bfr_zone_text.slice(0, -1);
       bfr_zone_text+='...各类信息'
     }
    var aNum = $(this).find('a').length; //有多少链接
    var imgNum = $(this).find('img').length; //有多少图片
    var valueArea = $(this).attr('ergodic')
    var valueTitle = valueArea + 'AreaTitle';
    var dsc = BarrierFreeConfig[valueTitle] ? ('您已进入' + BarrierFreeConfig[valueTitle] + ',' + (aNum > 0 || imgNum > 0 || bfr_zone_text? '本区域含有' : '') + (aNum > 0 ? aNum + '个链接,' : '') + (imgNum > 0 ? imgNum + '张图片,' : '') + (bfr_zone_text  ? bfr_zone_text + ',' : '')+ '移动鼠标浏览信息') : "";
    if (valueArea == BarrierFreeConfig.articleArea) {
      readArticle();
    } else {
      readContent(dsc);
    }
    if($('.tbl')&&$('.tbl').get(0)&&$('.tbl').get(0).localName !=='input'){
      $('.tbl').removeClass('tbl')
    }
   }
  }
}).bind('mouseout',function (events) {
   if(events.target.attributes.ergodic !==undefined ){
    if($('.tbl')&&$('.tbl').get(0)&&$('.tbl').get(0).localName !=='input'){
      $('.tbl').removeClass('tbl')
    }
    $('.bl').removeClass('bl')
   }
})
// 点击 非 xx区域 去掉标记区的红框
$("body").on('click',function (events) {
  // 如果tab 进入了 浮动窗口 鼠标移走 此时 如果浮动框 未关闭 则需要找到 改浮动框 并关闭
  if(INSTANCE.obj&&INSTANCE.obj.bHeader.length===1){
    let bHeaderElems= $('[b-header]')
    $.each(bHeaderElems,function(index,item){
    // 循环到这个对象 且点击的不是这个对象时 才隐藏 浮动窗口
     if(item.getAttribute('readlabel')===INSTANCE.obj.bHeader.get(0).getAttribute('readlabel')&&events.target!==INSTANCE.obj.bHeader.get(0)){
      $(item).closest('[b-tab]').find('[b-panel]').css({
        'display': 'none',
      })
      return false // 跳出当前循环	
      }
    })
  }
  initMouseClick = 1//如果未点击页面 则不执行 读屏函数 点击了initmouseMove设置为1 初始值为0
  if(INSTANCE.openFlag !=='0'){
    if (events.target.nodeName !== 'SELECT'&&events.target.nodeName !== 'A') {
      events.stopPropagation()  
      if(events.target.nodeName !== 'IMG'&&events.target.nodeName !== 'BUTTON'&&events.target.nodeName!== 'P'&&events.target.nodeName!== 'DIV'&&events.target.nodeName!== 'INPUT'
      &&events.target.nodeName!== 'SPAN'&&events.target.nodeName!== 'B'&&events.target.nodeName!== 'I'&&events.target.nodeName!== 'STRONG'){
        events.preventDefault()
      }
    }
    var classString =events.target.className//如果点击的是工具条上的 导航键 标记红框不可去除 如果还在导航区中不可去除
    if(events.target.nodeName!=='svg'&&events.target.nodeName!=='path'&&classString.indexOf('mark_bl')===-1&&classString.indexOf('bfr_ergodic_span')===-1&&events.target.attributes.ergodic ===undefined){
      $('.bl').removeClass('bl')
      // 如果是iframe上的红框
      var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
      var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
      let iframes = $(hostString).not('[src^="//"]')
      iframes.contents().find('.bl').removeClass('bl')// 进入之前移除其他 红框
      if($('.tbl')&&$('.tbl').get(0)&&$('.tbl').get(0).localName !=='input'){
        $('.tbl').removeClass('tbl')
      }
    }
    // 如果点击的还是当前xx区 再提示一次
    if(events.target.attributes.ergodic !==undefined ){
      const bfrZoneElems = Array.from($(events.target).find('[bfr_zone_dsc]'));
      // Loop through all the descendant elements and concatenate their text content
      let bfr_zone_text = '';
      if(bfrZoneElems.length){
        bfr_zone_text = '内容主要涉及';
         for (let item of  Object.keys(bfrZoneElems)) {
           bfr_zone_text += bfrZoneElems[item].textContent.trim()+'、';
         }
         bfr_zone_text = bfr_zone_text.slice(0, -1);
         bfr_zone_text+='...各类信息'
       }
      let aNum = $(events.target).find('a').length; //有多少链接
      let imgNum = $(events.target).find('img').length; //有多少图片
      let valueArea = $(events.target).attr('ergodic')
      let valueTitle = valueArea + 'AreaTitle';
      let dsc = BarrierFreeConfig[valueTitle] ? ('您已进入' + BarrierFreeConfig[valueTitle] + ',' + (aNum > 0 || imgNum > 0 || bfr_zone_text? '本区域含有' : '') + (aNum > 0 ? aNum + '个链接,' : '') + (imgNum > 0 ? imgNum + '张图片,' : '') + (bfr_zone_text  ? bfr_zone_text + ',' : '')+ '按下tab键浏览信息') : "";
      if (valueArea == BarrierFreeConfig.articleArea) {
        readArticle();
      } else {
        readContent(dsc);
      }
      if($('.tbl')&&$('.tbl').get(0)&&$('.tbl').get(0).localName !=='input'){
        $('.tbl').removeClass('tbl')
      }
     }  
  }
})
//-------------------------按Tab键触发顺序遍历结束-------------------------//
// 如果是iframe上的红框
var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
let iframes = $(hostString).not('[src^="//"]')
iframes.each(function() {
  var iframe = $(this);
  iframe.contents().on('click',function (events) {
    initMouseClick = 1//如果未点击页面 则不执行 读屏函数 点击了initmouseMove设置为1 初始值为0
    if($(events.target).attr('ergodic')){
      iframes.contents().find(events.target).addClass('bl')// 进入之前移除其他 红框
    }else{
      iframes.contents().find('.bl').removeClass('bl')// 进入之前移除其他 红框
    }
  })
})
iframes.on('load', function() {
  var iframe = $(this)//定位到当前iframe
  if (iframe.attr('src')) {
    initMouseClick = 1//如果未点击页面 则不执行 读屏函数 点击了initmouseMove设置为1 初始值为0
    var iframe = $(this);
    iframe.contents().on('click',function (events) {
      if($(events.target).attr('ergodic')){
        iframes.contents().find(events.target).addClass('bl')// 进入之前移除其他 红框
      }else{
        iframes.contents().find('.bl').removeClass('bl')// 进入之前移除其他 红框
      }
    })
  }
});
//-------------------------按Enter键触发跳转开始--------点击无障碍阅读-----------------//
function downEnter() {
  if (outHrefVisited) {
    $('.tbl').attr('markAlink', 'markAlink');
    outHrefVisited = 0;
  } else {
    if (!onClickTool) {
      return;
    }
    // 如果是点击的弹框里面的否 就标记了markAlink的id
    var markAlink=$('.tbl').attr('markAlink');
    if(markAlink==='markAlink'){
      $('.tbl').attr('markAlink','');
      $('.tbl').focus();
      // 如果不是a标签 但是带有外链 弹框 这里的span 为了不去掉 红色 选中区域框
      if($('.tbl')[0].nodeName!=='A'&&$('.tbl')[0].nodeName!=='SPAN'){
        $('.tbl')&&$('.tbl').get(0)&&$('.tbl').get(0).click();
      }
    }else{
      $('.tbl')&&$('.tbl').get(0)&&$('.tbl').get(0).click();
    }
  }
}
//-------------------------按Enter键触发跳转结束-------------------------//
function reloadImagMethod() {
  location.reload()
}
//-------------------------关闭智能导盲开始-------------------------//
function readToolBar() {
  toggleOldManModal = false
  initMouseClick = 0;
  INSTANCE.blindFlag = "0";
  SetCookie("blindFlag", "0");
  $(".toolbar-normal").show();
  $(".toolbar-toggle").hide();
  onClickTool = false;
}
//-------------------------关闭智能导盲结束-------------------------//


//----------------------语速调节开始----------------------//
function readSpeedBtn() {
  if(INSTANCE.speedFlag=='1'){//如果是正常语速 仍然按左箭头重复操作
    INSTANCE.speedFlag = '0';
    SetCookie("speedFlag", "0");
    normalSpeakSpeed();
    $('.voice_btn_speed_q').show()
    $('.voice_btn_speed_n').hide()
  }else{
    INSTANCE.speedFlag = '1'
    SetCookie("speedFlag", "1");
    fastSpeakSpeed();
    $('.voice_btn_speed_q').hide()
    $('.voice_btn_speed_n').show()
  }
}
var spdNum;
function normalSpeakSpeed() {
  $(".speak_speed").attr('data-mtpis', '当前为正常语速，加快语速请按ctrl + alt + K');
  $(".speak_speed").attr('audio', 'read-speed-normal');
  spdNum = '5'
  readContent('当前为正常语速，加快语速请按ctrl + alt + K');
}

function fastSpeakSpeed() {
  $(".speak_speed").attr('data-mtpis', '当前为快语速，恢复正常语速请按ctrl + alt + K');
  $(".speak_speed").attr('audio', 'read-speed-quick');
  spdNum = '8'
  readContent('当前为快语速，恢复正常语速请按ctrl + alt + K');
}

//---------------------音量调节---------------------------------//
$('select').on('change',function(e){
  if (INSTANCE.openFlag == "0") {
    return;
  }
  var optionText = $(this).find("option:selected").get(0).innerHTML||$(this).find("option:selected").get(0).innerText|| $(this).find("option:selected").get(0).label
  readContent(optionText);
});

//------------------------指读连读功能切换------------------------//
function readModelBtn() {
  if (INSTANCE.readMode == '0') {
    INSTANCE.readMode = '1';
    $(".readtype_btnIcon_open").hide();
    $(".readtype_btnIcon_close").show();

    $(".toolbar-item-readtype").attr('data-mtpis', '当前为连读模式，切换指读 请按ctrl + alt + F');
    $('.toolbar-item-readtype').removeClass('read_set').addClass('read_setOne')
    readContent('已切换为连读模式，请将鼠标移至您需要阅读文字上开始连读');
    $(".toolbar-item-readtype").attr('audio', 'read-currentmode-continuous');
  } else {
    $(".readtype_btnIcon_open").show();
    $(".readtype_btnIcon_close").hide();
    INSTANCE.readMode = '0';
    $(".toolbar-item-readtype").attr('data-mtpis', '当前为指读模式，切换连读 请按ctrl + alt + F');
    readContent('已切换指读模式，请将鼠标移至您需要阅读文字上');
    $(".toolbar-item-readtype").attr('audio', 'read-currentmode-mouse');
  }
  SetCookie("readMode", INSTANCE.readMode);
}
//------------------------连读功能开始------------------------//

function readContinueBtn(currOb) {
  searchReadTag(currOb)
  return BarrierFreeConfig.readerSentences.join();
}

function searchReadTag(currOb, iframe) {
  var wind = iframe ? $(iframe).contents() : $(document)
  var host = location.host;
  var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
  var allTag = wind.find('.canRead,' + hostString);//所有
  var allNum = allTag.length; //所有标签的数量
  if (allNum > 0) {
    var index = allTag.index(currOb);//当前鼠标聚焦的这个元素
    var startIndex = index === -1 ? 0 : index;
    for (var i = startIndex; i < allNum; i++) {
      var el = allTag.get(i)
      if (el.tagName === 'IFRAME') {
        searchReadTag(currOb, el);
        continue;
      }

      // 遍历到当前对象或已经开始则继续
      if (el === currOb || BarrierFreeConfig.readerSentences.length > 0) {
        var text = judgeTag(allTag.get(i));
        if (text == undefined) {
          continue;
        } else if (text.length > 0) {
          BarrierFreeConfig.readerSentences.push(text);
        }
      }
    }
  }
}
//---------------------------连读功能结束------------------------//

//---------------------------读屏功能开始------------------------//
function readFunctionBtn() {
  if (INSTANCE.readFlag == '1') {
    readContent('已关闭读屏');
    // 开启状态
    INSTANCE.readFlag = '0';
    SetCookie("readFlag", "0");
    $('.voice_btn_close').show()
    $('.voice_btn_open').hide()
    closeReadFuction();
  } else {
    $('.voice_btn_close').hide()
    $('.voice_btn_open').show()
    // 关闭状态
    INSTANCE.readFlag = '1'
    SetCookie("readFlag", "1");
    startReadFunction();
    readContent('已开启读屏');
  }
}
// 关闭读屏voice_set
function closeReadFuction() {
  // change_voice_btn 给读屏按钮 切换开关，和提示文本赋值使用
  $(".change_voice_btn").removeClass('barrierfreeActive').attr('data-mtpis', '开启读屏, 请按ctrl + alt + V');
  $(".change_voice_btn").attr('audio', 'read-open');
  BarrierFreeConfig.reader.stop();
  $('#' + BarrierFreeConfig.mainBox).find('.canRead').hover(unPointRead, unPointRead);
}
function focusHandle(e) {
  e.stopPropagation()
  $('.tbl').removeClass('tbl')
  $('.bl').removeClass('bl')
  pointRead.bind(this)()
  if (!onClickTool) {
    return;
  }
// 为了兼容某些div foucs时添加不进去背景色做的兼容 添加tbl
  if($(this)[0].tagName !=='IFRAME'||$(this).is('.canRead')){
    $(this).addClass('tbl')
  }
  $('.activeScalePic').removeClass('activeScalePic')
  if(INSTANCE.openFlag==='1'){
    $(this).closest("[ergodic]").addClass("bl") //tab按住不放时 最后只执行一次  这时从当前焦点目标往上级查找 直到找到对应的区域
  }
  if ($(':focus')&&$(':focus').closest('[b-tab]')&& $(':focus').closest('[b-tab]').length) { 
    // 查找 当前聚焦点的父元素 下其他的 并行的tab 导航栏节点 并去掉 script标签 
    let obj={}
    obj.focus=$(':focus')
    obj.bTab=$(':focus').closest('[b-tab]')
      if($(':focus').closest('[b-tab]').find('[b-header]').children()&&$(':focus').closest('[b-tab]').find('[b-header]').children().length){
        obj.bHeader=$(':focus').closest('[b-tab]').find('[b-header]').children().not('script')
      }else{
        obj.bHeader=$(':focus').closest('[b-tab]').find('[b-header]').not('script')
      }
      obj.bPanel=$(':focus').closest('[b-tab]').find('[b-panel]').children().not('script')  
      obj.headerToParentLevel=$(':focus').parentsUntil('[b-header]').length //到父级一共多少层
      //到父级bHeader的索引【排序】
      let header = $(':focus').closest('[b-header]')
      let panel = $(':focus').closest('[b-panel]')
      if(header.length){
        obj.currentHeaderChildIndex=obj.bHeader.index($(':focus').parentsUntil('[b-header]')[obj.headerToParentLevel-1]) //当前耳机菜单所在和-tab的索引
      }
      obj.panelToParentLevel=$(':focus').parentsUntil('[b-panel]').length //到父级一共多少层
      //到父级panel的索引【排序】
      if(panel.length){
        obj.currentPanelChildIndex=obj.bPanel.index($(':focus').parentsUntil('[b-panel]')[obj.panelToParentLevel-1]) //当前耳机菜单所在和-tab的索引  
      }
      INSTANCE.obj=obj
  }
}
function startReadFunction() {
  $(".change_voice_btn").addClass('barrierfreeActive').attr('data-mtpis', '关闭读屏, 请按ctrl + alt + V');
  $(".change_voice_btn").attr('audio', 'read-close');


}
//---------------------------读屏功能结束------------------------//

//---------------------------读文章开始------------------------//
function readArticle() {
  // 如果页面未 执行click事件 不执行读文本操作【页面不报错】
  if(!initMouseClick){
    return false
  }
  // 当文章非单纯一个段落
  if($('.bfr_article_content').get(0) !==undefined){
    var content = $('.bfr_article_content').get(0).innerText;
    var sentenceArray = content.split(/[,?!，。？！“”''""\n]/)
    $.each(sentenceArray, function (i, str) {
      var text = $.trim(str);
      if (text.length > 0) {
        BarrierFreeConfig.readerSentences.push(text);
      }
    });
    BarrierFreeConfig.reader.read('提示');
  }
}
//---------------------------读文章结束------------------------//

//------------------- 声音控制--------------------------//


//---------------------------大鼠标------------------------//
function bigMouseBtn() {
  var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
  if (!iframeNode) {
    return;
  }
  var length = iframeNode.length;
  var jsPath = $('#barrierfree').get(0).src;
  jsPath = jsPath.substr(0, jsPath.lastIndexOf('/') + 1);
  if($('#yx_cursor')&&$('#yx_cursor').length){
    $('#yx_cursor').remove();
  }
  var css = '<style id="yx_cursor" type="text/css">';
  css += '*{cursor:url(' + jsPath + 'images/allaw.cur),auto !important;}';
  css += '</style>';
  if (INSTANCE.mouseFlag == '0') {
    INSTANCE.mouseFlag = '1';
    localStorage.setItem("mouseFlag", "1");
    $("#mouse").addClass('barrierfreeActive').attr('data-mtpis', '关闭大鼠标, 请按ctrl + alt + M');
    $("#mouse").attr('audio', 'bigmouse-close');
    $('body').append(css);
    $('.mouse_btn_n').hide()
    $('.mouse_btn_big').show()
    for (var i = 0; i < length; i++) {
      if (iframeNode[i].style.display == 'none') {
        continue;
      }
      var iframeObject = iframeNode[i].contentWindow;
      try {
        $(iframeObject.document.body).append(css);
      } catch (e) {}
    }
    readContent('已开启大鼠标');
  } else {
    INSTANCE.mouseFlag = '0';
    localStorage.setItem("mouseFlag", "0");
    $("#mouse").removeClass('barrierfreeActive').attr('data-mtpis', '开启大鼠标, 请按ctrl + alt + M');
    $("#mouse").attr('audio', 'bigmouse-open');
    $('.mouse_btn_n').show()
    $('.mouse_btn_big').hide()
    $('#yx_cursor').remove();
    for (var i = 0; i < length; i++) {
      if (iframeNode[i].style.display == 'none') {
        continue;
      }
      var iframeObject = iframeNode[i].contentWindow;
      try {
        $(iframeObject.document.body).children('#yx_cursor').remove()
      } catch (e) {}
    }
    readContent('已关闭大鼠标');
  }
}

//---------------------------纯文本通道功能开始------------------------//
//执行函数
function openTextFunction() {
  // 取消页面放大
  INSTANCE.zoomValue = 1
  SetCookie("zoomValue", INSTANCE.zoomValue);
  pageFunction(INSTANCE.zoomValue);
  if (INSTANCE.textFlag == "0") {
    textFunction();
    INSTANCE.textFlag = "1";
    SetCookie("textFlag", "1");

    // 设置对比色
    if (INSTANCE.colorFlag != 0) {
      SetCookie("colorFlag", Number(INSTANCE.colorFlag));
    }
    readContent('恢复图文模式, 请按 alt 加 shift 加 3');
    $('#txt').attr('audio', 'viewmode-normal');
    $('#txt').attr('data-mtpis', '恢复图文模式, 请按 alt + shift + 3');
    $('.only_text_btn_n').show()
    $('.only_text_btn_y').hide()
  } else {
    //navgationIframeBack();
    INSTANCE.textFlag = "0";
    SetCookie("textFlag", "0");
    readContent('将恢复图文模式');
    setTimeout(function () {
      window.location.href = window.location.href;
      window.location.reload();
    }, 2000)
    $('#txt').attr('audio', 'viewmode-text');
    $('#txt').attr('data-mtpis', '进入纯文本模式, 请按 alt + shift + 3');
    $('.only_text_btn_y').show()
    $('.only_text_btn_n').hide()
  }
}
//纯文本功能实现

function textFunction() {
  // changeIframe();
  changeImage();
  changeStyle();
}
//替换、清除页面样式

function changeStyle() {
   //清除页面样式
   $('#' + BarrierFreeConfig.mainBox).find("video").css("visibility","hidden")
   $('#' + BarrierFreeConfig.mainBox).find("video").remove()
   var css = '<style id="pure_text" type="text/css">';
   css += 'body{background:none !important;}#barrierfree_container{color:#000 !important;background:none !important;}#barrierfree_container *{color:#000 !important;background:none !important;} #barrierfree_container img{visibility:hidden !important;} #barrierfree_container a{color:#0000FF !important;}';
   css += '</style>';
   $('body').append(css);
    var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        
    var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src],iframe:not(#bfr_iframe)"
    let iframes = $(hostString).not('[src^="//"]')
    // 已经加载好的iframe
    iframes.each(function() {
      var iframe = $(this);
      iframe.find("video").css("visibility","hidden")
      iframe.find("video").remove()
      iframe.contents().find('body').append(css);
      // 覆盖去掉iframe中的样式
      var iframeCss = `<style id="iframe_pure_text" type="text/css">
      body{background:none !important;} 
      body *{color:#000 !important;background:none !important;} 
      body img{visibility:hidden !important;}
      body a{color:#0000FF !important;}</style>`
      iframe.contents().find('body').append(iframeCss);
      iframe.contents().find("#iframes_css").remove();
      var imgTags = iframe.contents().find('img');
      imgTags.each(function() {
        var currentImg = $(this);
        var currentImgAlt=currentImg.attr('alt')||currentImg.attr('title')
        var spanElement = $('<span></span>');
        //创建可读标签代替之前的img
        spanElement.attr('tabindex', 0).addClass('canRead');
        spanElement.html(currentImgAlt);
        currentImg.replaceWith(spanElement);
      });
  });
 }
//用文字替换页面图片

function changeImage() {
  var allImage = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("img");
  for (i = 0; i < allImage.length; i++) {
    var allImageAlt = allImage[i].getAttribute("alt");
    if (allImageAlt == "" || allImageAlt == null) {
      allImageAlt = allImage[i].getAttribute("title");
    }
    var newImageNode = document.createElement("span");
    newImageNode.innerHTML = allImageAlt;
    allImage[i].parentNode.insertBefore(newImageNode, allImage[i]);
  }
  while (allImage.length) {
    allImage[0].parentNode.removeChild(allImage[0]);
  }
}
//处理页面中的iframe

function changeIframe() {
  var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).querySelectorAll("iframe :not(#bfr_iframe)");
  if (!iframeNode) {
    return;
  }
  var length = iframeNode.length;
  for (var i = 0; i < length; i++) {

    if (iframeNode[i].style.display == 'none') {
      continue;
    }

    var iframeObject = iframeNode[i].contentWindow;

    try {
      var iFrameHTML = iframeObject.document.body.innerHTML;
      var divForiFrame = document.createElement("div");
      divForiFrame.setAttribute("id", "iframeDiv_" + i);
      divForiFrame.innerHTML = iFrameHTML;
      iframeNode[i].parentNode.insertBefore(divForiFrame, iframeNode[i]);
    } catch (e) {}
  }
  while (iframeNode.length) {
    iframeNode[0].parentNode.removeChild(iframeNode[0]);
  }
}

//---------------------------纯文本通道功能结束------------------------//
//---------------------------页面缩放功能开始--------------------------//
//执行函数

// 放大缩小功能
function openPageFunction(flag) {
  var scrollTopPercent = $(document).scrollTop() / $('body').height();

  var readText = '';

  if (flag == "0") {
    INSTANCE.zoomValue = INSTANCE.zoomValue + 0.2;
    if (INSTANCE.zoomValue > 2) {
      INSTANCE.zoomValue = 2;
    }
    readText = "页面放大至百分之"
  } else {
    INSTANCE.zoomValue = INSTANCE.zoomValue - 0.2;
    if (INSTANCE.zoomValue < 1) {
      INSTANCE.zoomValue = 1;
    }
    readText = "页面缩小至百分之"
  }


  switch (Number(INSTANCE.zoomValue.toFixed(1) * 100)) {
    case 100:
      readText = '页面已缩小至最小百分之一百';
      break
    case 120:
      readText = readText + '一百二';
      break
    case 140:
      readText = readText + '一百四';
      break
    case 160:
      readText = readText + '一百六';
      break
    case 180:
      readText = readText + '一百八';
      break
    case 200:
      readText = '页面已放大至最大百分之两百';
      break
  }

  readContent(readText);
  $('#page-zoom-value').html(Number(INSTANCE.zoomValue.toFixed(1) * 100))
  $('#verticalPage').html(Number(INSTANCE.zoomValue.toFixed(1) * 100) + '%')
  SetCookie("zoomValue", INSTANCE.zoomValue);
  pageFunction(INSTANCE.zoomValue);

  $(document).scrollTop($('body').height() * scrollTopPercent);
}
//缩放功能实现

var rabitPx = 1;

function pageFunction(value) {
  if (rabitPx == 1) {
    rabitPx = 0;
  } else {
    rabitPx = 1;
  }
  if (INSTANCE.browser.chrome || INSTANCE.browser.safari) {
    if (INSTANCE.browser.safari) {
      $('body').append('<video id="video-play" src=""></video>')
    }
    $(mainBoxID).css({
      "-webkit-transform-origin": "top left",
      "-webkit-transform": "scale(" + value + ")",
      "padding": rabitPx + "px"
    });
  } else if (INSTANCE.browser.firefox) {
    $(mainBoxID).css({
      "-moz-transform-origin": "top left",
      "-moz-transform": "scale(" + value + ")",
      "padding": rabitPx + "px"
    });
  } else if (INSTANCE.browser.opera) {
    $(mainBoxID).css("-o-transform:scale(" + value + ")");
  } else {
    document.getElementById(BarrierFreeConfig.mainBox).style.zoom = value;
  }
  // 控制滚动条始终居中
  window.scrollTo((document.body.scrollWidth - document.body.offsetWidth) / 2, 0)
}
//---------------------------页面缩放功能结束--------------------------//
//---------------------------文字缩放功能结束----------------------------//


// 文字缩放
var fontZoom = 1;

function bigFont() {

  if (fontZoom === 2) {
    readContent('文字已放至最大百分之两百');
    return false;
  }
  fontZoom = fontZoom + 0.2;
  if (fontZoom > 2) {
    fontZoom = 2;
  }
  var fontPercent = (fontZoom / 1).toFixed(1) * 100
  $('#font-zoom-value').html(fontPercent)
  $('#verticalText').html(fontPercent + '%')

  var readText = '文字放大至百分之'

  switch (fontPercent) {
    case 100:
      readText = readText + '一百';
      break
    case 120:
      readText = readText + '一百二';
      break
    case 140:
      readText = readText + '一百四';
      break
    case 160:
      readText = readText + '一百六';
      break
    case 180:
      readText = readText + '一百八';
      break
    case 200:
      readText = '文字已放至最大百分之两百';
      break
  }


  setTimeout(function () {
    changeFont('biger');
    readContent(readText);
  }, 150)


}

function smallFont() {
  if (fontZoom === 1) {
    readContent('文字已缩小至最小百分之一百');
    return false;
  }
  fontZoom = fontZoom - 0.2;
  if (fontZoom < 1) {
    fontZoom = 1;
  }
  var fontPercent = (fontZoom / 1).toFixed(1) * 100
  $('#font-zoom-value').html(fontPercent)
  $('#verticalText').html(fontPercent + '%')

  var readText = '文字缩小至百分之'

  switch (fontPercent) {
    case 100:
      readText = '文字已缩小至最小百分之一百';
      break
    case 120:
      readText = readText + '一百二';
      break
    case 140:
      readText = readText + '一百四';
      break
    case 160:
      readText = readText + '一百六';
      break
    case 180:
      readText = readText + '一百八';
      break
    case 200:
      readText = readText + '两百';
      break
  }

  setTimeout(function () {
    changeFont('smaller');
    readContent(readText);
  }, 150)

}

function changeFont(mode) {

  $('.text-tag').each(function () {
    $(this).css('font-size', function (index, value) {
      if (mode === 'biger') { // 放大
        var basicPX = parseFloat(value);
        if (fontZoom > 1.2) {
          var newValue = $(this).attr("class").split("fontModify_")[1];
          basicPX = parseFloat(newValue) / (((fontZoom * 10) - 2) / 10); //fontZoom-0.2  获取当前字体处于的倍数
        }
        var fontSize = basicPX * fontZoom;
        var lastFontSize = basicPX * (fontZoom - 0.2);
        $(this).addClass("fontModify_" + fontSize.toFixed(2));
        $(this).removeClass("fontModify_" + lastFontSize.toFixed(2));
        return fontSize + "px";
      } else { // 缩小
        var newValue = $(this).attr("class").split("fontModify_")[1];
        var basicPX = parseFloat(newValue) / (((fontZoom * 10) + 2) / 10); //fontZoom+0.2  获取当前字体处于的倍数
        var fontSize = basicPX * fontZoom;
        var lastFontSize = basicPX * (fontZoom + 0.2);
        $(this).addClass("fontModify_" + fontSize.toFixed(2));
        $(this).removeClass("fontModify_" + lastFontSize.toFixed(2));
        return fontSize + "px";
      }
    })
  })
}
//---------------------------文字缩放功能结束----------------------------//
//返回首页
function backHome() {
  INSTANCE.openFlag = "0";
  // 清除样式
  toggleToolBar();
  window.location.href="//"+window.location.host;
}
//----------------------------跳转首页功能结束---------------------------//
//----------------------------开启全屏----------------------------------//
function toggleAllScreen() {
  var isFull = document.fullscreenElement || document.mozFullScreenElement || document.webkitFullscreenElement;
  if (isFull) {
    closeAllScreen(true);
  } else {
    openAllScreen();
  }
}

function openAllScreen() {
  var element = document.documentElement;
  if (element.requestFullscreen) {
    element.requestFullscreen();
  } else if (element.webkitRequestFullScreen) {
    element.webkitRequestFullScreen();
  } else if (element.mozRequestFullScreen) {
    element.mozRequestFullScreen();
  } else if (element.msRequestFullscreen) {
    // IE11
    element.msRequestFullscreen();
  }

  setTimeout(function () {
    playAudio('alreadyAllScreen');
  }, 500)
}

function closeAllScreen(force) {
  // 判断是否已经是全屏
  // 如果是全屏，退出
  var isFull = document.fullscreenElement || document.mozFullScreenElement || document.webkitFullscreenElement;
  if (force) {
    if (document.exitFullscreen) {
      document.exitFullscreen();
    } else if (document.webkitCancelFullScreen) {
      document.webkitCancelFullScreen();
    } else if (document.mozCancelFullScreen) {
      document.mozCancelFullScreen();
    } else if (document.msExitFullscreen) {
      document.msExitFullscreen();
    }
    playAudio('closeAllScreen');
  } else if (!isFull) {
    playAudio('closeAllScreen');
  }
}
//---------------------------全屏功能结束--------------------------------//
//---------------------------灰度调节功能开始----------------------------//


// 灰度调节点击以20%的灰度递减，减到100%时回到初始灰度值
var scaleNum = 0;
var count = 0

function grayAdjust() {
  //判断是否是ie浏览器
  if (!!window.ActiveXObject || "ActiveXObject" in window) {
    alert('该浏览器不支持灰度调节')
  } else {
    count += 1
    if (count == 1) {
      $(mainBoxID).css('filter', 'grayscale(20%)')
      readContent('灰度调节至百分之20')
    }
    if (count == 2) {
      $(mainBoxID).css('filter', 'grayscale(40%)')
      readContent('灰度调节至百分之40')

    }
    if (count == 3) {
      $(mainBoxID).css('filter', 'grayscale(60%)')
      readContent('灰度调节至百分之60')

    }
    if (count == 4) {
      $(mainBoxID).css('filter', 'grayscale(80%)')
      readContent('灰度调节至百分之80')

    }
    if (count == 5) {
      $(mainBoxID).css('filter', 'grayscale(100%)')
      readContent('灰度调节至百分之100')
    }
    if (count == 6) {
      $(mainBoxID).css('filter', 'grayscale(0%)')
      readContent('灰度调节至百分之0')
      count = 0
    }
  }
}

//---------------------------灰度调节功能结束----------------------------//

function backHorizontal() {
  $('#horizontal').show()
  BarrierFreeConfig.reader.play(BarrierFreeConfig.contextPath + 'audio/cancelMove.mp3');
  document.body.style.paddingTop = "65px";
  $("#wcagnav").css("height", "55px")
}
//-------------------------拖动竖形工作条结束--------------------------//
//---------------------------对比度功能开始----------------------------//
//执行函数
function setColorFunction() {
  // 点击触发 且当前状态非重置状态
  if (parseInt(INSTANCE.colorFlag) < 4 && parseInt(INSTANCE.colorFlag) >= 0) {
    INSTANCE.colorFlag = parseInt(INSTANCE.colorFlag) + 1 + ''
  } else {
    INSTANCE.colorFlag = '0'
  }
  SetCookie("colorFlag", INSTANCE.colorFlag);
  switchTheme()
}
function switchTheme(){
  var mode = parseInt(getCookie("colorFlag"));
  $('a').removeClass('link-tag-color-blue');
  $('a').removeClass('link-tag-color-white');
  switch (mode) {
    case 0:
      changeColorStyle('default-color','');
      $('.color-toolbar-pannel').attr('audio', 'color-ysps');
      $('.color-toolbar-pannel').attr('data-mtpis', '当前为页面原始配色,调整配色请按 ctrl + alt + T');
      readContent('当前为页面原始配色,调整配色请按 ctrl + alt + T');
      break;
    case 1:
      changeColorStyle('white-black-blue','link-tag-color-blue');
      $('a').addClass('link-tag-color-blue');
      $('.color-toolbar-pannel').attr('audio', 'color-white-black-blue');
      $('.color-toolbar-pannel').attr('data-mtpis', '当前为白底黑字蓝链接,调整配色请按 ctrl + alt + T');
      readContent('当前为白底黑字蓝链接,调整配色请按 ctrl + alt + T');
      break;
    case 2:
      changeColorStyle("blue-yellow-white",'link-tag-color-white');
      $('a').addClass('link-tag-color-white');
      $('.color-toolbar-pannel').attr('audio', 'color-blue-yellow-white');
      $('.color-toolbar-pannel').attr('data-mtpis', '当前为蓝底黄字白链接,调整配色请按 ctrl + alt + T');
      readContent('当前为蓝底黄字白链接,调整配色请按 ctrl + alt + T');
      break;
    case 3:
      changeColorStyle("yellow-black-blue",'link-tag-color-blue');
      $('a').addClass('link-tag-color-blue');
      $('.color-toolbar-pannel').attr('audio', 'color-yellow-black-blue');
      $('.color-toolbar-pannel').attr('data-mtpis', '当前为黄底黑字蓝链接,调整配色请按 ctrl + alt + T');
      readContent('当前为黄底黑字蓝链接,调整配色请按 ctrl + alt + T');
      break;
    case 4:
      changeColorStyle("black-yellow-white",'link-tag-color-white');
      $('a').addClass('link-tag-color-white');
      $('.color-toolbar-pannel').attr('audio', 'color-black-yellow-white');
      $('.color-toolbar-pannel').attr('data-mtpis', '当前为黑底黄字白链接,调整配色请按 ctrl + alt + T');
      readContent('当前为黑底黄字白链接,调整配色请按 ctrl + alt + T');
      break;
    default:
      break;
  }
}

function changeColorStyle(colorClass,aColorClass) {
  $('.fun_button_list_color').find(".color-item:not(." + colorClass + ")").addClass('hideChangeColor')
  $('.fun_button_list_color').find(".color-item:not(." + colorClass + ")").removeClass('showChangeColor')
  $('.fun_button_list_color').find("." + colorClass).removeClass('hideChangeColor')
  $('.fun_button_list_color').find("." + colorClass).addClass('showChangeColor')


  $(mainBoxID).find("*:not(#wcagnav," + BarrierFreeConfig.exclude + ")")
  .removeClass("white-black-blue blue-yellow-white yellow-black-blue black-yellow-white")
  .addClass(colorClass);
  $(mainBoxID).removeClass("white-black-blue blue-yellow-white yellow-black-blue black-yellow-white").addClass(colorClass);
  BarrierFreeConfig.UpDownKey=0
  var host = location.host;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
  var hostString = "iframe[src*='"+host+"'], iframe[src^='.'], iframe[src^='/'],iframe[src=''], iframe:not([src])"
  let iframes = $(hostString).not('[src^="//"]')
  iframes.each(function() {
    var iframe = $(this);
    changeIframeColor(colorClass,aColorClass,iframe)
  });
  iframes.on('load', function() {
    var iframe = $(this)//定位到当前iframe
    if (iframe.attr('src')) {
      changeIframeColor(colorClass,aColorClass,iframe)
    }
  });
}
// 切换iframe主题 颜色
function changeIframeColor(themeClass,aColorClass, iframe) {
  try {
    var iFrameAllaNode= iframe.contents().find('body a')
    iFrameAllaNode.removeClass("link-tag-color-blue link-tag-color-white").addClass(aColorClass);
    iframe.contents().find('body').removeClass('white-black-blue blue-yellow-white yellow-black-blue black-yellow-white default-color')
          .addClass(themeClass)
    var iFrameAllNode= iframe.contents().find('body *:not(a)');
    iFrameAllNode.removeClass("white-black-blue blue-yellow-white yellow-black-blue black-yellow-white default-color").addClass(themeClass);
    for (var j = 0; j < iFrameAllNode.length; j++) {
      if (iFrameAllNode[j].tagName == 'iframe' || iFrameAllNode[j].tagName == 'IFRAME') {
        changeIframeColor(themeClass, aColorClass, iFrameAllNode[j].contentWindow);
      } else {
        iFrameAllaNode.removeClass("link-tag-color-blue link-tag-color-white").addClass(aColorClass);
        iFrameAllNode.removeClass("white-black-blue blue-yellow-white yellow-black-blue black-yellow-white default-color").addClass(themeClass);
      }
    }
    //加载进来的iframe 继续插入节点 比如websockt
    let iframeBody=iframe.contents().find('body')
    iframeBody.on('DOMNodeInserted',function(e){
      let _that = $(e.target)
        if(_that){
          // 给插入的节点添加类
          var iFrameAllaNode= iframe.contents().find('body a')
          iFrameAllaNode.removeClass('link-tag-color-blue link-tag-color-white').addClass(aColorClass);
          iframeBody.removeClass('white-black-blue blue-yellow-white yellow-black-blue black-yellow-white default-color')
          .addClass(themeClass)
          var iFrameAllNode= iframe.contents().find('body *:not(a)');
          iFrameAllNode.removeClass('white-black-blue blue-yellow-white yellow-black-blue black-yellow-white default-color')
          .addClass(themeClass);
        }
    });
  } catch (e) {}
}

function openColorFunction() {
  if (INSTANCE.colorFlag == "0") {
    colorFunction();
    INSTANCE.colorFlag = "1";
    SetCookie("colorFlag", "1");
  } else {
    closeColorFunction();
    INSTANCE.colorFlag = "0";
    SetCookie("colorFlag", "0");
  }
}

function closeColorFunction() {
  iframeClearColorFunction();
  $(mainBoxID).find("*:not(:#wcagnav)").css({
    "backgroundColor": "",
    "backgroundImage": "",
    "color": ""
  });
}
//高对比度功能实现

function colorFunction() {
  iframeColorFunction();
  $(mainBoxID).find("*:not(:#wcagnav)").css({
    "backgroundColor": "#000",
    "backgroundImage": "none",
    "color": "#FFF"
  });
}

//iframe对比度处理

function iframeColorFunction() {
  var iframeNode = document.getElementsByTagName("iframe");
  if (!iframeNode) {
    return;
  }
  for (var i = 0; i < iframeNode.length; i++) {
    var iframeObject = iframeNode[i].contentWindow;
    try {
      var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
      iframeObject.document.getElementsByTagName("body")[0].style.backgroundColor = "#000";
      iframeObject.document.getElementsByTagName("body")[0].style.backgroundImage = "none";
      iframeObject.document.getElementsByTagName("body")[0].style.color = "#FFF";
      for (j = 0; j < iFrameAllNode.length; j++) {
        iFrameAllNode[j].style.backgroundColor = "#000";
        iFrameAllNode[j].style.backgroundImage = "none";
        iFrameAllNode[j].style.color = "#FFF";
      }
    } catch (e) {}
  }
}

// iframe 去掉高对比度

function iframeClearColorFunction() {
  var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
  if (!iframeNode) {
    return;
  }
  for (var i = 0; i < iframeNode.length; i++) {
    var iframeObject = iframeNode[i].contentWindow;
    try {
      var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
      iframeObject.document.getElementsByTagName("body")[0].style.backgroundColor = "";
      iframeObject.document.getElementsByTagName("body")[0].style.backgroundImage = "";
      iframeObject.document.getElementsByTagName("body")[0].style.color = "";
      for (j = 0; j < iFrameAllNode.length; j++) {
        iFrameAllNode[j].style.backgroundColor = "";
        iFrameAllNode[j].style.backgroundImage = "";
        iFrameAllNode[j].style.color = "";
      }
    } catch (e) {}
  }
}
//---------------------------对比度功能结束----------------------------//

//---------------------------辅助线功能开始---------------------------//
//辅助线执行函数

function openLineFunction() {
  if (INSTANCE.lineFlag == "0") {
    INSTANCE.lineFlag = "1";
    SetCookie("lineFlag", "1");
    lineFunction();
    $("#line").attr('data-mtpis', '关闭辅助线, 请按ctrl + alt + N');
    $('.line_btn_n').show()
    $('.line_btn_y').hide()
    readContent('已开启辅助线');
  } else {
    closeLineFunction();
    INSTANCE.lineFlag = "0";
    SetCookie("lineFlag", "0");
    $('.line_btn_n').hide()
    $('.line_btn_y').show()
    $("#line").attr('data-mtpis', '开启辅助线, 请按ctrl + alt + N');
    readContent('已关闭辅助线');
  }
}
//辅助线功能实现，辅助线移动工具:页面出现2条辅助功能线，用来从水平和垂直两方面校对页面文本。

function lineFunction() {
  //初始化辅助线
  var lineDivHTML = "<div id=\"lineX\" style=\"pointer-events:none;border-top:5px red solid;position:absolute;width:100%;height:4px;left:0px;top:0px;font-size:0px;line-height:0px;z-index:99999;\"></div>";
  lineDivHTML = lineDivHTML + "<div id=\"lineY\" style=\"pointer-events:none;border-left:5px red solid;position:absolute;width:4px;height:100%;top:0px;font-size:0px;line-height:0px;z-index:99998;\"></div>";

  var lineDiv = document.getElementById("lineDiv");
  if (!lineDiv) {
    lineDiv = document.createElement("div");
    lineDiv.setAttribute("id", "lineDiv");
    lineDiv.setAttribute("style", "width:100%;height:0px;line-height:0px;font-size:0px;top:0px;left:0px;");
    lineDiv.innerHTML = lineDivHTML;
    document.body.insertBefore(lineDiv, document.body.firstChild);
  }
  document.getElementById('lineX').style.display = 'block';
  document.getElementById('lineY').style.display = 'block';
  $("html").bind("mousemove", mouseLineMove);
  //$("iframe").bind("mousemove", mouseLineMove);
  setIframeOnMouseMoveEevent();
  $("#line").addClass('barrierfreeActive').attr('readlabel', '关闭辅助线, 请按ctrl + alt + N');
  $('#line').attr('audio', 'bfr-line-close');
}

function closeLineFunction() {
  document.getElementById('lineX').style.display = 'none';
  document.getElementById('lineY').style.display = 'none';
  $("html").unbind("mousemove", mouseLineMove);
  $("#line").removeClass('barrierfreeActive').attr('readlabel', '开启辅助线, 请按ctrl + alt + N');
  $('#line').attr('audio', 'bfr-line-open');
}

function setIframeOnMouseMoveEevent() {
  var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
  if (!iframeNode) {
    return;
  }
  for (var i = 0; i < iframeNode.length; i++) {
    var iframeObject = iframeNode[i].contentWindow;
    bindOnMouseEvent(iframeObject);
  }
}

function bindOnMouseEvent(iframeObject) {
  try {
    iframeObject.document.onmousemove = mouseIframeLineMove;
    var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
    for (var j = 0; j < iFrameAllNode.length; j++) {
      if (iFrameAllNode[j].tagName == 'iframe' || iFrameAllNode[j].tagName == 'IFRAME') {
        var innerIframeObject = iFrameAllNode[j].contentWindow;
        bindOnMouseEvent(innerIframeObject);
      }
    }
  } catch (e) {}
}
//当前鼠标位置判断
var browserToolBarHeight = 0;

function mouseLineMove(e) {
  e.stopPropagation();
  e = e || event || window.event;
  var lineValueX = e.pageX;
  var lineValueY = e.pageY;

  if (!lineValueX && !lineValueY) {
    lineValueX = e.clientX;
    lineValueY = e.clientY + (document.documentElement.scrollTop || document.body.scrollTop);
  }

  document.getElementById('lineX').style.top = lineValueY + "px";
  document.getElementById('lineY').style.height = document.documentElement.scrollHeight + "px";
  document.getElementById('lineX').style.width = document.documentElement.scrollWidth + "px";
  document.getElementById('lineY').style.left = lineValueX + "px";

  browserToolBarHeight = e.screenY - e.clientY;
}

function mouseIframeLineMove(e) {
  e = e || event || window.event;
  // var lineValueX = e.screenX;
  var lineValueX = (e.pageX)* INSTANCE.zoomValue;
  if (!lineValueX && !lineValueY) {
    lineValueX = e.clientX;
  }
  var lineValueY = e.screenY - browserToolBarHeight + (document.documentElement.scrollTop || document.body.scrollTop);;

  document.getElementById('lineX').style.top = lineValueY + 5 + "px";
  document.getElementById('lineY').style.height = document.documentElement.scrollHeight + "px";
  document.getElementById('lineX').style.width = document.documentElement.scrollWidth + "px";
  document.getElementById('lineY').style.left = lineValueX + 5 + "px";
}
//---------------------------辅助线功能结束---------------------------//
//---------------------------帮组功能开始---------------------------//

function navToolbarHelp() {
  window.open(BarrierFreeConfig.barrierfreeHelp);
}
//---------------------------帮组功能结束---------------------------//
//---------------------------重置功能开始-----------------------------//

function resetNavToolbar() {
  localStorage.removeItem("toolBarFoldFlag");
  delCookie("textFlag");
  delCookie("zoomValue");
  delCookie("fontValue");
  delCookie("colorFlag");
  delCookie("lineFlag");
  delCookie("readFlag");
  delCookie("readMode");
  localStorage.removeItem("mouseFlag");
  delCookie("speedFlag");
  delCookie("textTips");
  window.location.href = window.location.href;
  window.location.reload();
}
//---------------------------重置功能结束-----------------------------//
//工具条监听函数


//无障碍快捷键JS

//键盘键
//大键盘 0
var NumZeroKey = '48';
//大键盘 1
var NumOneKey = '49';
//大键盘 2
var NumTwoKey = '50';
//大键盘 3
var NumThreeKey = '51';
//大键盘 4
var NumFourKey = '52';
//大键盘 5
var NumFiveKey = '53';
//大键盘 6
var NumSixKey = '54';
//大键盘 7
var NumSevenKey = '55';
//大键盘 8
var NumEightKey = '56';
//大键盘 9
var NumNineKey = '57';
//字母键 A
var LetterAKey = '65';
//字母键 B
var LetterBKey = '66';
//字母键 C
var LetterCKey = '67';
//字母键 D
var LetterDKey = '68';
//字母键 E
var LetterEKey = '69';
//字母键 F
var LetterFKey = '70';
//字母键 G
var LetterGKey = '71';
//字母键 H
var LetterHKey = '72';
//字母I
var LetterIKey = '73';
//字母键 J
var LetterJKey = '74';
//字母K
var LetterKkey = '75';
//字母L
var LetterLKey = '76';
//字母键 M
var LetterMKey = '77';
// 字母键 N
var LetterNKey = '78';
// 字母键 O
var LetterOKey = '79';
// 字母键 P
var LetterPKey = '80';
//字母键 Q
var LetterQKey = '81';
//字母键 R
var LetterRKey = '82';
//字母键 S
var LetterSKey = '83';
//字母键 T
var LetterTKey = '84';
//字母键 U
var LetterUKey = '85';
//字母键 V
var LetterVKey = '86';
//字母键 W
var LetterWKey = '87';
//字母键 X
var LetterXKey = '88';
//字母键 Y
var LetterYKey = '89';
//字母键 Z
var LetterZKey = '90';
//ESC
var Esc = '27';
// 上箭头
var UpKey = '38';
// 下箭头
var DownKey = '40';
// 左箭头
var LeftKey = '37';
// 右箭头
var RightKey = '39';
// 加号
var AddKey = '187';
// 减号
var MinusKey = '189';
// 左破折号
var LeftDashesKey = '188';
// 右破折号
var RightDashesKey = '190';
// 斜杠
var SlashKey = '191';

//小键盘数字0
var MinNumZeroKey = '96';
//小键盘数字1
var MinNumOneKey = '97';
//小键盘数字1
var MinNumTwoKey = '98';
//小键盘数字2
var MinNumThreeKey = '99';
//小键盘数字3
var MinNumFourKey = '100';
//小键盘数字4
var MinNumFiveKey = '101';
//小键盘数字5
var MinNumSixKey = '102';
//小键盘数字6
var MinNumSevenKey = '103';
//小键盘数字7
var MinNumEightKey = '104';
//小键盘数字8
var MinNumNineKey = '105';
//小键盘数字9
var MinAddKey = '107';
//小键盘 +
var MinMinusKey = '109';
//小键盘 -

//区域  ID

//网站地图区ID//读屏软件语音接口：已跳转到网站地图
//var SiteMap = BarrierFreeConfig.SiteMap;//'copyright';
var SiteMapTitle = "已跳转到网站地图区";

//搜索区ID//读屏软件语音接口：已跳转到搜索区域
//var SearchForm = BarrierFreeConfig.SearchForm;//'searchbox';
var SearchFormTitle = "已跳转到搜索区域";

//头部内容区ID//读屏软件语音接口：已跳转到头部内容区域
//var HeadContent = BarrierFreeConfig.HeadContent;//'header';
var HeadContentTitle = "已跳转到头部内容区域";

//底部内容区ID//读屏软件语音接口：已跳转到底部内容区域
//var BottomContent = BarrierFreeConfig.BottomContent;//'copyright';
var BottomContentTitle = "已跳转到底部内容区域";

//网页左栏区ID//读屏软件语音接口：已跳转网页左栏区域
//var LeftContent = BarrierFreeConfig.LeftContent;//'leftbox';
var LeftContentTitle = "已跳转网页左栏区域";

//网页中间区ID//读屏软件语音接口：已跳转到中间结构区域
//var MiddleContent = BarrierFreeConfig.MiddleContent;//'leftbox';
var MiddleContentTitle = "已跳转到中间结构区域";

//网页右栏区ID//读屏软件语音接口：已跳转到网页右栏区域
//var RightContent = BarrierFreeConfig.RightContent;//'rightbox';
var RightContentTitle = "已跳转到网页右栏区域";

//栏目分组变量
//栏目分组标记 H2 或 H3 或 H4
var GroupTagNameH2 = 'H2';
var GroupTagNameH3 = 'H3';
var GroupTagNameH4 = 'H4';
//栏目分组计数器初始化为-1
var GroupCount = -1;
//顺（逆）向标记
var ForwardFlag = false;
var BackwardFlag = false;

var v = 0;

function accessKeyboardListener(currkey, e) {
  if (INSTANCE.openFlag == "0") {
    return;
  }
  var browser = browserFlag();
  //浏览器类型判断
  /*--------------------------------------------------------快捷键开始--------------------------------------------------------*/
  if (String(navigator.platform).indexOf("Win") != -1||String(navigator.platform).indexOf("Linux") != -1) {
    //windows操作系统
    if (e.altKey && !e.shiftKey && !e.ctrlKey) {
      if (currkey == NumOneKey||currkey == MinNumOneKey) {
        //alt+1: 定位到网站导航容器，
        changeArea(BarrierFreeConfig.navigationArea);
      } else if (currkey == NumTwoKey||currkey == MinNumTwoKey) {
        //alt+2: 定位到网站视窗容器，
        changeArea(BarrierFreeConfig.viewArea);
      } else if (currkey == NumThreeKey||currkey == MinNumThreeKey) {
        //alt+3: 定位到网站服务引导区，
        changeArea(BarrierFreeConfig.serveArea);
      } else if (currkey == NumFourKey||currkey == MinNumFourKey) {
        //alt+4: 定位到主要内容区，
        changeArea(BarrierFreeConfig.articleArea);
      } else if (currkey == NumZeroKey||currkey == MinNumZeroKey) {
        //alt+0: 定位到页面主要搜索框，
        createNodeDiv(BarrierFreeConfig.SearchForm, BarrierFreeConfig.SearchFormTitle);
      }
    }
  } else if (String(navigator.platform).indexOf("Mac") != -1) {
    //Mac操作系统
    if (e.altKey && !e.shiftKey && !e.ctrlKey) {
      if (currkey == NumOneKey||currkey == MinNumOneKey) {
        //alt+1: 定位到网站导航容器，
        changeArea(BarrierFreeConfig.navigationArea);
      } else if (currkey == NumTwoKey||currkey == MinNumTwoKey) {
        //alt+2: 定位到网站视窗容器，
        changeArea(BarrierFreeConfig.viewArea);
      } else if (currkey == NumThreeKey||currkey == MinNumThreeKey) {
        //alt+3: 定位到网站服务引导区，
        changeArea(BarrierFreeConfig.serveArea);
      } else if (currkey == NumFourKey||currkey == MinNumFourKey) {
        //alt+4: 定位到主要内容区，
        changeArea(BarrierFreeConfig.articleArea);
      } else if (currkey == NumFiveKey||currkey == MinNumFiveKey) {
        //alt+5：跳转到头部，
        createNodeDiv(BarrierFreeConfig.HeadContent, BarrierFreeConfig.HeadContentTitle);
      } else if (currkey == NumSixKey||currkey == MinNumSixKey) {
        //alt+6: 跳转到左栏，
        createNodeDiv(BarrierFreeConfig.LeftContent, BarrierFreeConfig.LeftContentTitle);
      } else if (currkey == NumSevenKey||currkey == MinNumSevenKey) {
        //alt+7: 跳转到中间区域，
        createNodeDiv(BarrierFreeConfig.MiddleContent, BarrierFreeConfig.MiddleContentTitle);
      } else if (currkey == NumEightKey||currkey == MinNumEightKey) {
        //alt+8: 跳转到右栏，
        createNodeDiv(BarrierFreeConfig.RightContent, BarrierFreeConfig.RightContentTitle);
      } else if (currkey == NumNineKey||currkey == MinNumNineKey) {
        //alt+9: 跳转到底部，
        createNodeDiv(BarrierFreeConfig.BottomContent, BarrierFreeConfig.BottomContentTitle);
      } else if (currkey == NumZeroKey||currkey == MinNumZeroKey) {
        //alt+0: 定位到页面主要搜索框，
        createNodeDiv(BarrierFreeConfig.SearchForm, BarrierFreeConfig.SearchFormTitle);
      }
    }
  }
  /*--------------------------------------------------------页面导航快捷键结束-------------------------------------------------------*/
  if (e.altKey && e.ctrlKey && !e.shiftKey) {
       if (currkey == LetterRKey) {
        //alt+alt+R: 智能导盲功能打开，
        if(toggleOldManModal){
          readToolBar()
        }else{
          ergodicToolbar()
        }
      }else if (currkey == LetterKkey) {
        // 语速恢复正常【慢速】 ; 语速加快
        readSpeedBtn();
      }else if (currkey == LetterFKey) {
        //ctrl+alt+f: 读屏模式切换，
        readModelBtn();
      }else if (currkey == LetterTKey) { // 切换颜色
        setColorFunction()
      }else if (currkey == AddKey||currkey == MinAddKey) {
        //ctrl+alt+加号：页面放大，
        openPageFunction(0);
      } else if (currkey == MinusKey||currkey == MinMinusKey) {
        //ctrl+alt+减号：页面缩小，
        openPageFunction(1);
      } else if (currkey == LetterMKey) {
        //ctrl+alt+M: 鼠标大小切换，
        bigMouseBtn();
      }else if (currkey == LetterNKey) {
        //ctrl+alt+N: 辅助线功能开关，
        openLineFunction();
      }else if (currkey == LetterBKey) {
        //ctrl+alt+B: 辅屏功能开关
        toolbar.Function.textTips.mainMethod();
      } else if (currkey == LetterLKey) {
        //ctrl+alt+L: 固定折叠
        if (INSTANCE.toolBarFoldFlag==="0") {
          foldToolBar();
        } else {
          unfoldToolBar();
        }
      } else if (currkey == LetterCKey) {
        //ctrl+alt+C: 重置，
        resetNavToolbar();
      } else if (currkey == SlashKey) {
        //ctrl+alt+？: 无障碍通道帮助功能，
        navToolbarHelp();
      } else if (currkey == LetterVKey) {
        //ctrl+alt+V: 读屏功能开关，
        BarrierFreeConfig.reader.stop();//快捷键切换读屏和禁止读屏
        readFunctionBtn();
      } 
    }
  /*----------------------------------------------------------工具栏快捷键开始------------------------------------------------------*/
  if (e.altKey && e.shiftKey && !e.ctrlKey) {
    if (currkey == NumFourKey||currkey == MinNumFourKey) { // 文字放大
      bigFont();// alt+shift+4
    } else if (currkey == NumFiveKey||currkey == MinNumFiveKey) { // 文字缩小
      smallFont();// alt+shift+5
    } else if (currkey == NumThreeKey||currkey == MinNumThreeKey) {
      //alt+shift+3: 纯文本转换模式，
      openTextFunction();
    } else if (currkey == LeftDashesKey) { // 后退
      window.history.back();// 可去掉
    } else if (currkey == RightDashesKey) { // 前进
      window.history.forward();//可去掉
    }else if (currkey == LetterHKey) {
      //alt+shift+H: 回到首页
      backHome()
    } else if (currkey == LetterPKey) {
      //alt+shift+P: 全屏
      toggleAllScreen()
    } else if (currkey == LetterMKey) {
      //alt+shift+M: 灰度调节
      grayAdjust()
    }
  }
  if (e.ctrlKey&&currkey == DownKey) {
    // 如果是多个tab 此时有多个header
    if(INSTANCE.obj.bHeader.length>1){
      INSTANCE.obj.bPanel.eq(INSTANCE.obj.currentHeaderChildIndex).find('.canRead:first').focus()
      INSTANCE.obj.panelToParentLevel=$(':focus').parentsUntil('[b-panel]').length //到父级一共多少层
      INSTANCE.obj.currentPanelChildIndex=INSTANCE.obj.bPanel.index($(':focus').parentsUntil('[b-panel]')[INSTANCE.obj.panelToParentLevel-1]) //当前耳机菜单所在和-tab的索引  
    }else{
      // 单个tab 可能是下拉框或者 展开框 如果未打开 则打开 二级菜单
      $(':focus').closest('[b-tab]').find('[b-panel]').css({
        "display": "block"
      })
      // 让其二级菜单的第一个 可读标签 聚焦 开始读
      INSTANCE.obj.bPanel.eq(0).find('.canRead:first').focus()
    }
    $(':focus').mouseover()
  }
  if (e.key === 'Tab') {
    const focusedElement = $(':focus');
    if (focusedElement) {
      const closestBfrArticleContent = focusedElement.closest('.bfr_article_content');
      if (closestBfrArticleContent.length) {
        toolbar.Function.textTips.textMessage = '';
      }
      focusedElement.mouseover();
    }
  }
  if (currkey == Esc) {
    if(($(':focus')&&$(':focus').closest('[b-panel]')&& $(':focus').closest('[b-panel]').length)){
      // 该层级内nav的可读标签聚焦焦点
      // 如果是单个tab
      if(INSTANCE.obj.bHeader.length>1){
        INSTANCE.obj.bHeader.eq(INSTANCE.obj.currentPanelChildIndex).find('.canRead:first').focus()
        INSTANCE.obj.bPanel=$(':focus').closest('[b-tab]').find('[b-panel]').children().not('script')  
        INSTANCE.obj.headerToParentLevel=$(':focus').parentsUntil('[b-header]').length //到父级一共多少层
        INSTANCE.obj.currentHeaderChildIndex=INSTANCE.obj.bHeader.index($(':focus').parentsUntil('[b-header]')[INSTANCE.obj.headerToParentLevel-1]) //当前耳机菜单所在和-tab的索引
      }else{
        $(':focus').closest('[b-tab]').find('[b-panel]').css({
          "display": "none"
        })
        // 如果单个tab 且 header 无父级
        INSTANCE.obj.bHeader.focus()
      }
    }

  }

  /*----------------------------------------------------------工具栏快捷键结束------------------------------------------------------*/
  /*------------------------------------------------------分组栏目跳转开始-----------------------------------------------------*/
  if (currkey == LetterZKey) {
    if ((!e.altKey && !e.shiftKey && e.ctrlKey) || (e.altKey && !e.shiftKey && !e.ctrlKey)) {
      groupSkip(0);
      //分组栏目跳转快捷键：ctrl+Z
    } else if ((!e.altKey && e.shiftKey && e.ctrlKey) || (e.altKey && e.shiftKey && !e.ctrlKey)) {
      groupSkip(1);
    }
  }
  /*--------------------------------------------------------分组栏目跳转结束----------------------------------------------------*/

}

function toolBarKeyDownEvent(sKeycode, e) {
  if (sKeycode == 74 && !e.ctrlKey && e.shiftKey && e.altKey) {
    //Alt+J:工具条开关
    toggleToolBar();
  }

  if (sKeycode == 13 && !e.ctrlKey && !e.shiftKey && !e.altKey) {
    //Enter: 点击链接
    downEnter();
  }

}

//栏目分组跳转

function groupSkip(skipFlag, GroupTagName) {
  var allSkipNode = new Array();
  var j = 0;
  var allNode = document.getElementsByTagName("*");
  for (i = 0; i < allNode.length; i++) {
    var newNodeName = allNode[i].nodeName;
    if (newNodeName == BarrierFreeConfig.GroupTagNameH2 || newNodeName == BarrierFreeConfig.GroupTagNameH3 || newNodeName == BarrierFreeConfig.GroupTagNameH4) {
      allSkipNode[j] = i;
      j++;
    }
  }
  //获取栏目分组跳转标签的个数
  var NumGroupTagID = allSkipNode.length
  if (NumGroupTagID == 0) {
    return;
  }
  //没有栏目分组标签返回
  if (skipFlag == 0) {
    //分组栏目正向跳转
    ForwardFlag = true;
    if (BackwardFlag) {
      BackwardFlag = false;
    }
    this.GroupCount++;
    if (this.GroupCount > NumGroupTagID - 1) {
      this.GroupCount = 0;
    }
  } else if (skipFlag == 1) {
    //分组栏目逆向跳转
    BackwardFlag = true;
    if (ForwardFlag) {
      ForwardFlag = false;
    }
    this.GroupCount--;
    if (this.GroupCount < 0) {
      this.GroupCount = NumGroupTagID - 1;
    }
  }
  var mainDiv = allNode[allSkipNode[GroupCount]];
  var titleText = mainDiv.innerText || mainDiv.textContent;
  var title = titleText + "";
  if (mainDiv.nodeName == BarrierFreeConfig.GroupTagNameH2) {
    title = titleText + "";
  }
  createNode(mainDiv, title);
}

//创建层节点：----------------------------------

function createNodeDiv(divID, title) {
  var mainDiv = document.getElementById(divID);
  //若主目录下无跳转ID，查看Iframe中是否有
  if (!mainDiv) {
    mainDiv = iframeSearch(divID);
    if (!mainDiv) {
      return;
    }
  }
  createNode(mainDiv, title);
}
//在跳转区域第一个子节点前创建----------------

function createNode(mainDiv, title) {
  var newNode = document.createElement("div");
  newNode.style.cssText = "width:0px;height:0px;overflow:hidden;";
  newNode.innerHTML = "<a href=\"javascript:\" title=\"" + title + "\" onblur=\"deleteNodeDiv(this)\">" + title + "</a>";
  mainDiv.parentNode.insertBefore(newNode, mainDiv);
  newNode.firstChild.focus();
}

//删除层节点----------------------------------

function deleteNodeDiv(node) {
  var browser = browserFlag();
  if (browser.ie) {
    node.parentNode.removeNode(true);
  } else {
    node.parentNode.parentNode.removeChild(node.parentNode);
  }
}
//查找Iframe中快捷键ID

function iframeSearch(divID) {
  var iframeNode = document.body.getElementsByTagName("iframe");
  if (!iframeNode) {
    return;
  }
  for (var i = 0; i < iframeNode.length; i++) {
    try {
      var newDivID = iframeNode[i].contentWindow.document.getElementById("divID");
    } catch (e) {}
  }
  return newDivID;
}

//在iframe中增加监听调用父页面监听函数
function addKeyListenerToIframe(iframeObject) {
  var iframeNode = document.body.getElementsByTagName("iframe");
  if (!iframeNode) {
    return;
  }
  for (var i = 0; i < iframeNode.length; i++) {
    var iframeObject = iframeNode[i].contentWindow;
    if (iframeObject.body.contenteditable) {
      continue;
    }
    bindKeyDownEvent(iframeObject);
  }
}

function bindKeyDownEvent(iframeObject) {
  if (event.srcElement.nodeName !== 'undefined' || event.srcElement.nodeName !== null) {
    if (event.srcElement.nodeName == 'INPUT' || event.srcElement.nodeName == 'TEXTAREA') {
      return;
    }
  } else {
    if (event.target.tagName == 'INPUT' || event.target.tagName == 'TEXTAREA') {
      return;
    }
  }
  try {
    iframeObject.document.onkeydown = KeyDownEvent;
    var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
    for (var j = 0; j < iFrameAllNode.length; j++) {
      if (iFrameAllNode[j].tagName == 'iframe' || iFrameAllNode[j].tagName == 'IFRAME') {
        var innerIframeObject = iFrameAllNode[j].contentWindow;
        if (iframeObject.body.contenteditable) {
          continue;
        }
        bindKeyDownEvent(innerIframeObject);
      }
    }
  } catch (e) {}
}

function KeyDownEvent(e) {
  if (event.srcElement.nodeName !== 'undefined' || event.srcElement.nodeName !== null) {
    if (event.srcElement.nodeName == 'INPUT' || event.srcElement.nodeName == 'TEXTAREA') {
      return;
    }
  } else {
    if (event.target.tagName == 'INPUT' || event.target.tagName == 'TEXTAREA') {
      return;
    }
  }
  //快捷键获取
  var currkey = 0,
  e = e || event || window.event;
  currkey = e.keyCode || e.which || e.charCode;
  //快捷键键盘监听
  top.accessKeyboardListener(currkey, e);
  //工具条键盘监听
  top.toolBarKeyDownEvent(currkey, e);
}

//定义主内容盒子
var mainBoxID;

initBarrierFree();

var styleTag = document.createElement("link");
styleTag.setAttribute('type', 'text/css');
styleTag.setAttribute('rel', 'stylesheet');
styleTag.setAttribute('href', BarrierFreeConfig.HtmlToolCssUrl);
$("body")[0].appendChild(styleTag);

spdNum = '5';

// 当 页面发生跳转  当前tab页切换后 停止语音阅读
var hidden, bfr_browser_state, visibilityChange;
if (typeof document.hidden !== "undefined") {
  hidden = "hidden";
  visibilityChange = "visibilitychange";
  bfr_browser_state = "visibilityState";
} else if (typeof document.mozHidden !== "undefined") {
  hidden = "mozHidden";
  visibilityChange = "mozvisibilitychange";
  bfr_browser_state = "mozVisibilityState";
} else if (typeof document.msHidden !== "undefined") {
  hidden = "msHidden";
  visibilityChange = "msvisibilitychange";
  bfr_browser_state = "msVisibilityState";
} else if (typeof document.webkitHidden !== "undefined") {
  hidden = "webkitHidden";
  visibilityChange = "webkitvisibilitychange";
  bfr_browser_state = "webkitVisibilityState";
}
// 添加监听器
if (visibilityChange) {
  document.addEventListener(visibilityChange, function () {
    BarrierFreeConfig.reader.stop();
  }, false);
}

function readTest() {
  readContent('关闭, 请按alt加shift加j')
}
//  放大验证码图片
$('[zoomview]').mouseenter(function () {
  var imgHasParent = $(this).parent().hasClass('zoomPicBox')
  if (!imgHasParent) {
    $(this).before('<div id="zoomPicBox" class="zoomPicBox" style="position:relative;display:inline-block"></div>')
    $(this).appendTo('#zoomPicBox')
  }
  //给需要放大的验证码 找一个box 存放
  //将图片放大两倍
  $(this).addClass('activeScalePic');
})
$('[zoomview]').mouseout(function (e) {
  //将图片放大效果移除
  $(this).removeClass('activeScalePic');
  //将每次新追加的节点移除
  $(this).siblings('#zoomPicBox').remove()
})